-- 
DELETE FROM `achievement_reward_locale` WHERE `ID` IN (4784,4785) AND `locale` = 'ruRU';
INSERT INTO `achievement_reward_locale` (`ID`, `Locale`, `Subject`, `Body`) VALUES
(4784, 'ruRU', 'Эмблемы интендантов в Серебряном анклаве в Даларане', 'Твои достижения в Нордсколе не остались незамеченными, $Gдруг:подруга;.$B$BЗаработанные тобой эмблемы можно использовать для покупки снаряжения у различных интендантов эмблем в Даларане.$B$BТы можешь найти нас в Серебряном анклаве, где для каждого типа эмблем есть свой интендант.$B$BЖдем тебя с нетерпением!'),
(4785, 'ruRU', 'Эмблемы интендантов в Святилище Похитителей Солнца в Даларане', 'Твои достижения в Нордсколе не остались незамеченными, $Gдруг:подруга;.$B$BЗаработанные тобой эмблемы можно использовать для покупки снаряжения у различных интендантов эмблем в Даларане.$B$BТы можешь найти нас в Святилище Похитителей Солнца, где для каждого типа эмблем есть свой интендант.$B$BЖдем тебя с нетерпением!');
