DELETE FROM `battleground_template` WHERE id = 754;
INSERT INTO `battleground_template` VALUES (754,8,15,90,90,4487,0,4486,0,75,1,0,'','Deepwind Gorge');

DELETE FROM `creature_template`  WHERE entry = 53194;
INSERT INTO `creature_template` VALUES (53194,0,0,0,0,0,38214,0,0,0,'Capture Point','','Interact',0,1,1,0,0,35,35,16777216,0,1,1.14286,1.14286,1,0,1,2,0,0,1,2000,0,1,768,1141377024,0,0,0,0,0,0,0,0,0,9,553649152,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,'',0,3,1,1.35,1,1,1,0,0,0,0,0,0,0,0,1,0,0,0,'',15595);

DELETE FROM `gameobject_template` WHERE entry IN (220164, 220166);
INSERT INTO `gameobject_template` VALUES 
(220164,36,13817,'Вагонетка Альянса','','','',1995,32,1,0,0,0,0,0,0,0,140876,0,1,0,1,0,10000,5000,220165,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,'','',17538),
(220166,36,13817,'Вагонетка Орды','','','',1997,32,1,0,0,0,0,0,0,0,141210,0,1,0,1,0,10000,5000,220174,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,'','',17538);

