SET NAMES 'utf8';
DELETE FROM `quest_template_locale` WHERE `locale`='zhCN' AND `ID` IN (50432, 50374, 50373, 50372, 50371, 50364, 50360, 50358, 50341, 50338, 50337, 50336, 50335, 50319, 50316, 50313, 50305, 50303, 50254, 50248, 50247, 50242, 50239, 50232, 50231, 50230, 50229, 50228, 50227, 50226, 50131, 50130, 50071, 50055, 50054, 50053, 50052, 50049, 50048, 50047, 50046, 50035, 49982, 49981, 49977, 49976, 49973, 49933, 49930, 49929, 49928, 49866, 49865, 49864, 49863, 49862, 49860, 49855, 49852, 49851, 49846, 49817, 49816, 49813, 49812, 49788, 49787, 49784, 49783, 49782, 49773, 49772, 49698, 49614, 49613, 49567, 49566, 49565, 49564, 49561, 49560, 49559, 49558, 49557, 49556, 49555, 49554, 49553, 49552, 49551, 49550, 49549, 49548, 49547, 49546, 49543, 49542, 49541, 49540, 49539, 49538, 49537, 49536, 49535, 49534, 49533, 49532, 49354, 49266, 49198, 49197, 49049, 49043, 48985, 48962, 48936, 48832, 48739, 48737, 48731, 48728, 48726, 48723, 48696, 48689, 48687, 48624, 48511, 48467, 48434, 48433, 48403, 48306, 48302, 48298, 48294, 48287, 48286, 48285, 48190, 48185, 48175, 48102, 48100, 48097, 48096, 48095, 48079, 48067, 48066, 47712, 47705, 47507, 47008, 46947, 46707, 46278, 46236, 46190, 46180, 46179, 46161, 46134, 46063, 46046, 46032, 46013, 46011, 45805, 45791, 45653, 45626, 45542, 44971, 44943, 44847, 44786, 44765, 44174, 44157, 44067, 44044, 44033, 44013, 43964, 43959, 43807, 43804, 43769, 43752, 43751, 43709, 43642, 43512, 43460, 43459, 43456, 43451, 43436, 43434, 43328, 43121, 42969, 42798, 42712, 42652, 42633, 42631, 42274, 42270, 42269, 42240, 42177, 42159, 42151, 42145, 42111, 41992, 41950, 41948, 41925, 41884, 41882, 41841, 41840, 41815, 41802, 41800, 41799, 41766, 41764, 41701, 41692, 41659, 41657, 41646, 41566, 41553, 41526, 41517, 41486, 41446, 41421, 41411, 41397, 41395, 41394, 41368, 41367, 41302, 41297, 41289, 41282, 41274, 41272, 41264, 41242, 41239, 41238, 41227, 41225, 41208, 41206, 41186, 41175, 41174, 41168, 41158, 40980, 40395, 40298, 40279, 39019, 39004, 38926, 38287, 38051, 38043, 37968, 37966, 37868, 37852, 37851, 37850, 37849, 37848, 37814, 37813, 37811, 37799, 37798, 37797, 37792, 37790, 37786, 37778, 37774, 37773, 37102, 37068, 37039, 37026, 37023, 37004, 36749, 36699, 36681, 36491, 36296, 36290, 36162, 36161, 35993, 35888, 35841, 35840, 35839, 35449, 35316, 35315, 35312, 35311, 35309, 34953, 32854, 32843, 32712, 32710, 32692, 32639, 32635, 32633, 32631, 32558, 32548, 32545, 32541, 32532, 32526, 32521, 32517, 32489, 32485, 32471, 32470, 32469, 32468, 32460, 32451, 32448, 32423, 32416, 32372, 32368, 32352, 32351, 32348, 32342, 32320, 32318, 32305, 32302, 32288, 32287, 32268, 32266, 32264, 32262, 32252, 32227, 32215, 32200, 32189, 32145, 32144, 32143, 32128, 32127, 32120, 31931, 31799, 31796, 31787, 31721, 31718, 31709, 31706, 31664, 31583, 31238, 31234, 31201, 31117, 31083, 31076, 30733, 30729, 30726, 30465, 30462, 30461, 30382, 30376, 30188, 30106, 29847, 29361, 29321, 29316, 29237, 29232, 29149, 29148, 29137, 29085, 29084, 28874, 28871, 28665, 28664, 28663, 28649, 28476, 28109, 27955, 27787, 27784, 27782, 27720, 27719, 27711, 27702, 27700, 27695, 27688, 27657, 27654, 27652, 27636, 27627, 27500, 27498, 27494, 27445, 27444, 26885, 26090, 25157, 24918, 24917, 24916, 24915, 24894, 24893, 24892, 24891, 24890, 24889, 24886, 24885, 24884, 24883, 24882, 24881, 24838, 24833, 24832, 24826, 24820, 24662, 24659, 24652, 24647, 14392, 14372, 14261, 14171, 14012, 13825, 13795, 13770, 13763, 13752, 13741, 13733, 13729, 13709, 13684, 13398, 13396, 13394, 13392, 13391, 13390, 13389, 13388, 13368, 13365, 13361, 13360, 13359, 13355, 13354, 13353, 13352, 13348, 13332, 13329, 13328, 13316, 13314, 13313, 13305, 13281, 13263, 13242, 13229, 13196, 13193, 13190, 13174, 13172, 13171, 13160, 13147, 13116, 13109, 13108, 13103, 12811, 12782, 12761, 12744, 12732, 12481, 12432, 12428, 12338, 12198, 12073, 11790, 11499, 11498, 11416, 11414, 11384, 11373, 11363, 11359, 11358, 11355, 11349, 11348, 11303, 11302, 11285, 11283, 11220, 11114, 11113, 11112, 11111, 11110, 11109, 11108, 11107, 11100, 11099, 11092, 11026, 11010, 10827, 10823, 10822, 10681, 10679, 10652, 10603, 10599, 10380, 10330, 10323, 10322, 10321, 10263, 10246, 9838, 9299, 9268, 9267, 9266, 9259, 9257, 8983, 8902, 8872, 8547, 7937, 7493, 7241, 6862, 6609, 4763, 4604, 2952, 2770, 1701, 1655, 1442, 1368, 1275, 1144, 986, 982, 967, 948, 729, 484, 458, 391, 171, 126, 115, 19);
INSERT INTO `quest_template_locale` (`ID`, `locale`, `LogTitle`, `LogDescription`, `QuestDescription`, `AreaDescription`, `PortraitGiverText`, `PortraitGiverName`, `PortraitTurnInText`, `PortraitTurnInName`, `QuestCompletionLog`, `VerifiedBuild`) VALUES
(50432, 'zhCN', '泰坦革新', '', '', '', '', '', '', '', '', 26365),
(50374, 'zhCN', '艾泽拉斯之血', '传达麦格尼·铜须的信息。', '联盟和部落的领袖到底知不知道他们争夺的是什么东西？\n\n这一从伤口溢出的物质正是艾泽拉斯的生命之血！\n\n我们得治愈伤口，而不是开采其中的能量！艾泽拉斯是我们唯一的家园，我们不能眼睁睁看着她死去！\n\n我相信你，$n，也知道你的言辞在联盟中举足轻重。你必须把缘由告诉他们，阻止这种疯狂的行为！\n\n这是我们的世界的唯一希望……', '', '', '', '', '', '', 26365),
(50373, 'zhCN', '最近的访客', '与大法师卡德加谈一谈。', '希利苏斯的情况似乎引起了更多的注意。\n\n大法师卡德加在你离开的时候刚到。他似乎是来找你的，$n。\n\n他看上去挺急的。要是我的话我会尽快去和他谈谈。', '', '', '', '', '', '', 26365),
(50372, 'zhCN', '沙漠研究', '与塔米·旋匠谈一谈。', '萨格拉斯的黑暗之刃在这片土地上洒下了一片毁灭的阴影。\n\n虽然异种蝎虫巢似乎在攻击下被摧毁，然而我却接到报告说异种蝎又回来了。\n\n我们得弄清这些异种蝎是如何幸免于难，萨格拉斯之刃又是如何影响它们的虫巢的。\n\n国王希望解剖并研究活体异种蝎。\n\n塔米·旋匠正在进行这项研究，她正需要一名“采集者“。\n\n\n', '', '', '', '', '', '', 26365),
(50371, 'zhCN', '暴风城的召唤', '前往暴风城，与马迪亚斯·肖尔见面。', '乌瑞恩国王要求你尽快赶回暴风城。有件紧急事务需要你处理。\n\n你回来后我会马上告知你详情。\n\n来雄狮之眠找我。要快……时机稍纵即逝！', '', '', '', '', '', '', 26365),
(50364, 'zhCN', '艾泽拉斯之血', '传达麦格尼·铜须的信息。', '联盟和部落的领袖到底知不知道他们争夺的是什么东西？\n\n这一从伤口溢出的物质正是艾泽拉斯的生命之血！\n\n我们得治愈伤口，而不是开采其中的能量！艾泽拉斯是我们唯一的家园，我们不能眼睁睁看着她死去！\n\n我相信你，$n，也知道你的言辞在部落中举足轻重。你必须把缘由告诉他们，阻止这种疯狂的行为！\n\n这是我们的世界的唯一希望……', '', '', '', '', '', '', 26365),
(50360, 'zhCN', '卡德加的请求', '与大法师卡德加谈一谈。', '你不在的时候大法师卡德加来了。他似乎是来找你的，$n。\n\n赶紧去见他，看看他到底想做什么。我要他马上走，越快越好。\n\n我最不想看到的，就是人类来打探部落事务！', '', '', '', '', '', '', 26365),
(50358, 'zhCN', '沙漠研究', '与皮克妮·锈弹谈一谈。', '萨格拉斯的黑暗之刃在这片土地上洒下了一片毁灭的阴影。\n\n虽然异种蝎虫巢似乎在攻击下被摧毁，然而我却接到报告说异种蝎又回来了。\n\n要是我的话，我宁愿一劳永逸地烧光这些讨厌的虫巢！然而，我说的不算。\n\n黑暗女王希望解剖并研究活体异种蝎。\n\n皮克妮·锈弹正在进行这项研究，她正需要一名“采集者“。\n\n\n', '', '', '', '', '', '', 26365),
(50341, 'zhCN', '近期发现', '与纳萨诺斯·凋零者谈一谈。', '今天早些时候，部落的领袖们齐聚一堂，欢庆我们在对抗燃烧军团战争中的胜利。\n\n宴席进行到一半，加里维克斯要求和黑暗女王单独见面。\n\n他似乎在希利苏斯找到了一种神秘物质……一种我们之前从未遇到过的魔法矿物。\n\n酋长命令我告知你细节，为一项特殊安排做好准备。', '', '', '', '', '', '', 26365),
(50338, 'zhCN', '地龙特攻队', '杀死粘性辐射尘。', '你怎么跑到这里来的，$n？\n\n我是地龙特攻队的莫多克。我们需要像你这样的$r的帮助。\n\n帮我们打败那些被辐射的居民，他们现在已经占据了诺莫瑞根。完成后，我就能帮你任命为荣耀的地龙特攻队特种兵！\n\n拿着这包降落伞，直接跳到齿轮大厅里去，干掉粘性辐射尘。完成这个任务之后，到西边的走廊去找特种兵“坏脾气”巴拉克斯报告。我敢说，你们两个肯定很合得来。', '', '', '', '', '', '', 26365),
(50337, 'zhCN', '地龙特攻队', '杀死电刑器6000型。', '那个莫多克是个疯子，$c。绝对绝对不要跟这个疯侏儒乘坐同一架飞机。\n\n鬼鬼祟祟的做法不是我擅长的风格，显然也不该是你的。沿着这条走廊前往发射台，除掉电刑器6000型。\n\n电刑器是负责管理飞机的……\n\n……而我讨厌飞机。我绝对不会乘坐任何一种飞机！\n\n解决它之后，就用这包降落伞跳下去，找特种兵费斯接你的下一个任务。', '', '', '', '', '', '', 26365),
(50336, 'zhCN', '地龙特攻队', '消灭机械师瑟玛普拉格。', '我要跟“坏脾气”巴拉克斯和莫多克保持距离，他俩都出奇地不靠谱。\n\n那就派你去干活吧！顺着这条隧道往下走，一直到工匠议会。希望你知道如何对付机械师瑟玛普拉格。\n\n我们的领队，特种兵汉尼巴尔就在那里的某处等着你。他会重重奖赏你的出色表现。\n\n应该是这样吧……', '', '当心他的炸弹！', '机械师瑟玛普拉格', '', '', '', 26365),
(50335, 'zhCN', '为我复仇', '杀死兰多菲·摩洛克，灼热勋爵以及霍格。', '我不管你效忠谁，$r。我要霍格死！\n\n他——以及他那些被圣光遗忘的同伙——杀了我的人。联盟与部落可能是看不对眼，但你必须明白，我们不能容忍冷血的谋杀。', '', '', '', '', '', '', 26365),
(50319, 'zhCN', '异乡异客', '在奥格瑞玛找到酋长的命令布告板。', '嗨。我是黑卫大使。\n\n<黑卫低头看着手上的字条。>\n\n我很荣幸能代表大酋长欢迎你来到奥格瑞玛，$r。\n\n<他看了你一眼，勉强扯出一个微笑，目光又回到了纸上。>\n\n有无尽的冒险在前方等着你，请确保……呃……\n\n你知道吗？我在这里读这份欢迎信读了一整天了。受够了。\n\n去和你的使者谈谈，想想该去哪冒险。走吧。', '', '', '', '', '', '', 26365),
(50316, 'zhCN', '干扰检测：奥杜尔', '重温奥杜尔的探险。', '你来晚了。不记得上次我们怎么处理逃出奥杜尔地下监狱的尤格-萨隆了吗？那次你也迟到了。你真的应该学会守时。\n\n好了，快去！上古之神！守护者！泰坦造物！赶紧解决这件事情我们才能走。还有更多的时间和地点要去呢。\n\n<沃尔姆做了个不耐烦的手势，要你离开。>', '', '', '', '', '', '', 26365),
(50313, 'zhCN', '异乡异客', '找到暴风城里的英雄的召唤布告牌。', '欢迎来到暴风城，$r。安度因·乌瑞恩国王诚挚欢迎你，请尽情游览我们这座伟大的城市。你看上去像是信仰虔诚的人。这里有座大教堂，你一定会感兴趣的！\n\n啊，那个其实不急。有位光铸德莱尼大使正在等你，他会告诉你城市之外有什么样的冒险在等待你。\n\n希望你在这里过得愉快，$n。噢，这里偶尔会有地方比较脏乱，请不要介意！这里的市民可比不上以严于律己闻名的圣光军团战士！', '', '', '', '', '', '', 26365),
(50305, 'zhCN', '异乡异客', '找到暴风城里的英雄的召唤布告牌。', '欢迎来到暴风城，$r。安度因·乌瑞恩国王诚挚欢迎你，请尽情游览我们这座伟大的城市。你看上去像是喜欢夜生活的那类人。这里有许多流行的酒馆，还有美妙的音乐表演！\n\n啊，那些都不急。有位朗多雷的大使正在等你，他会告诉你城市之外有什么样的冒险在等待你。\n\n希望你在这里过得愉快，$n。噢，还有个友情提醒……还请控制好你的那些暗影能量。在暴风城不是所有人都像我一样开明！', '', '', '', '', '', '', 26365),
(50303, 'zhCN', '异乡异客', '在奥格瑞玛找到酋长的命令布告板。', '嗨。我是黑卫大使。\n\n<黑卫低头看着手上的字条。>\n\n我很荣幸能代表大酋长欢迎你来到奥格瑞玛，$r。\n\n<他看了你一眼，勉强扯出一个微笑，目光又回到了纸上。>\n\n有无尽的冒险在前方等着……呃！\n\n够了！我受够整天在这里读这份欢迎信了。\n\n自己想想该去哪冒险，再和你的大使谈谈。\n\n让我一个人静一静。', '', '', '', '', '', '', 26365),
(50254, 'zhCN', '伟大事业的第二个盟友', '选择另一个要寻找的盟友。', '一个盟友对我们很有用。而两个盟友会让我们实力大增。\n\n即使现在，联盟还在密谋对抗我们。我们必须赶快行动，不然就无法再他们袭击前做好准备，抵御侵略。\n\n你做好准备就告诉我，开始追寻我们下一个盟友。事不宜迟。', '', '', '', '', '', '', 26365),
(50248, 'zhCN', '伟大事业的第二个盟友', '选择另一个要寻找的盟友。', '你迈出了重要的一步，增强了联盟的实力，$n。干得好。\n\n但恐怕只增加一个盟友并不能威慑部落。在奥格瑞玛的军力远超暴风城前大酋长是不会罢休的。\n\n我必须请你找到我们下一个盟友。事不宜迟。', '', '', '', '', '', '', 26365),
(50247, 'zhCN', '邮件必达', '在时间限制内帮助邮政长整理至少15封信件。', '由于最近那些闹剧，用来整理邮件的邮件元素短缺。\n\n其实这是一项简单的工作——就是把不同的邮件扔进不同的传送门，送到艾泽拉斯的各个角落。\n\n来玩个游戏吧。看你一分钟内能整理多少邮件呢？', '', '', '', '', '', '', 26365),
(50242, 'zhCN', '选择盟友', '与贝恩和莉亚德琳交谈，了解潜在的盟友。', '贝恩·血蹄与女伯爵莉亚德琳提议让潜在的盟友加入我们。他们知道如何让部落保持强大。\n\n你已经证明了自己是坚定的勇士，$n。我相信该由你决定我们先去做哪件事。\n\n听听他们说的，做出你的决定。把你的选择告诉我，我们将实施计划，增强部落的实力。\n', '', '', '', '', '', '', 26365),
(50239, 'zhCN', '选择盟友', '与图拉杨和奥蕾莉亚交谈，了解潜在的盟友。', '大主教图拉杨与奥蕾莉亚·风行者提议让潜在的盟友加入我们。这些英雄奉献了自己的毕生保卫我们的世界，我很相信他们的意见。\n\n你是联盟坚定的勇士，$n。我相信该由你决定我们先去做哪件事。\n\n听听他们说的，做出你的决定。让我知道我们该先与哪个盟友结盟。\n', '', '', '', '', '', '', 26365),
(50232, 'zhCN', '暮光幸存者', '取得米希尔·虚无行者的徽记。', '暮光之锤教徒曾经遍布这块土地。\n\n我们本以为这一教派已被彻底铲除，但黑暗总能在阴影中苟活。\n\n虽然这里的大多数教徒在萨格拉斯进攻时已经被消灭，但仍有一些幸存者。他们的领袖米希尔·虚无行者在希利苏斯被毁后愈发肆无忌惮。\n\n我们不能任由这个疯子集结那些幸存者。把他的徽记给我带来！', '', '', '', '', '', '', 26365),
(50231, 'zhCN', '成打的幼虫', '收集$1oa个异种幼蝎。', '异种蝎是如何在萨格拉斯之刃下幸存的？！\n\n我从没见过有物种适应环境的速度有异种蝎这么快！\n\n一定有办法驯服这些虫子！利用它们的进化生物学知识来赚钱！\n\n我们得从小训练它们！别管那些暴躁的成虫，我们需要幼虫！\n\n尽可能多地给我偷点异种蝎幼虫，我会想办法训练它们！', '', '', '', '', '', '', 26365),
(50230, 'zhCN', '力量之源', '收集$1oa个异种蝎大脑。', '异种蝎来势汹汹，而且从未如此强大！\n\n我猜异种蝎正汲取地底的某种能量。也许就在萨格拉斯之刃附近！\n\n我奉命研究这一影响异种蝎的神秘能量。\n\n带给我尽可能多的完整的异种蝎大脑，我就能开始研究了！\n\n', '', '', '', '', '', '', 26365),
(50229, 'zhCN', '一小块布', '收集$1oa块暮光丝绸。', '$n，是你在外面嚷嚷吗？是我，安古斯·雷酒！\n\n这里到处都是异教徒，请小声点。靠近我，讲话的时候挡住鼻子！\n\n这是希利苏斯唯一的厕所！我花了一整晚才找到的。我打算乘异教徒们睡着时溜进去方便一下，不过有个小问题……\n\n这里没有东西擦……你懂的……\n\n你能不能去找点布头，悄悄带进来给我！', '', '', '', '', '', '', 26365),
(50228, 'zhCN', '暮光幸存者', '取得米希尔·虚无行者的徽记。', '暮光之锤教徒曾经遍布希利苏斯。\n\n我们本以为这一教派已被彻底铲除，然而他们总能在阴影中苟活。即使成员数量锐减，但他们的狂热程度不亚于当年。\n\n虽然这里的大多数教徒在萨格拉斯进攻时已经被消灭，但仍有一些幸存者。他们的领袖米希尔·虚无行者在希利苏斯被毁后愈发肆无忌惮。\n\n我们不能任由米希尔集结那些幸存者。必须阻止他！', '', '', '', '', '', '', 26365),
(50227, 'zhCN', '成打的幼虫', '收集$1oa个异种幼蝎。', '异种蝎是如何在萨格拉斯之刃下幸存的？我不明白！\n\n我从没见过哪个物种适应环境的速度有异种蝎这么快！\n\n它们的幼虫，或者说幼蝎可以根据虫巢需要，进化成不同的种类。\n\n到底是虫巢发出信号影响了幼虫进化，还是有什么环境因素在作祟？\n\n科学必须找到答案！', '', '', '', '', '', '', 26365),
(50226, 'zhCN', '力量之源', '收集$1oa个异种蝎大脑。', '尽管异种蝎在希利苏斯毁灭后立即消失了一段时间，但他们最近又从地下回来了。\n\n这些新型异种蝎似乎比以往更加强大！\n\n我的假设是，这些异种蝎正在从萨格拉斯之刃汲取某种力量。\n\n我奉命研究这种神秘力量对于异种蝎虫巢的影响。\n\n带给我尽可能多的完整的异种蝎大脑，我就能开始研究了！', '', '', '', '', '', '', 26365),
(50131, 'zhCN', '外来视角', '在孢子村达到中立声望。', '感谢你为我的人民所做的一切，但他们还是很怕外来者。\n\n请打败沼泽领主，救出孢殖林里的孢子囊。这关系到我们的未来！', '', '', '', '', '', '', 26365),
(50130, 'zhCN', '友善的表示', '在孢子村达到友善声望。', '沼泽生活很艰难，$n。我们希望与这里的其他居民和平共处，但这里的敌人一直威胁着我们的生存。\n\n请为我们出一份力，让孢子村繁荣起来。', '', '', '', '', '', '', 26365),
(50071, 'zhCN', '为圣光而战！', '回到暴风城，与安度因·乌瑞恩国王谈一谈。', '圣光军团很乐意加入联盟。\n\n现在，我们拥有共同的事业了，$n。\n\n我们回暴风城吧，法瑞娅队长会对我们的人讲话。', '', '', '', '', '', '', 26365),
(50055, 'zhCN', '代言人的观点', '把卡德加的信交给希利苏斯的麦格尼·铜须。', '萨格拉斯在我们的世界上留下了一道伤疤，$n。这道伤疤绝不会马上愈合……\n\n联盟和部落之间的伤疤也一样。\n\n为了拯救艾泽拉斯免遭毁灭，已经有太多生命在战斗中牺牲。我绝不能坐看这个世界再次陷落。\n\n我走之前有个请求。请把这封信交给麦格尼·铜须。他在希利苏斯寻找治疗伤口的方法。\n\n这封信里的信息对他或许会很有用。', '', '', '', '', '', '', 26365),
(50054, 'zhCN', '涌泉海滩', '完成涌泉海滩战场。', '我们收到报告说，希利苏斯近海有座岛，上面有丰富的艾泽里特矿藏。\n\n我们必须赶在联盟得知这座岛的存在前夺下它。\n\n纳萨诺斯·凋零者会亲自带领远征队，他还要求你前去报到。祝你好运！', '', '', '', '', '', '', 26365),
(50053, 'zhCN', '懒惰的勘探者！', '动员$1oa名懒惰的勘探者。', '从我的经验来看，永远不要把兽人的工作托付给地精。\n\n加里维克斯和他的财团也许目前是在为大酋长效命，但要成事的话我们也得对他们多一个心眼。\n\n我已经看到许多地精工人游手好闲，工作时偷偷打瞌睡。部落绝不容忍懒惰！\n\n快去，让那些懒惰的勘探者回去干活！', '', '', '', '', '', '', 26365),
(50052, 'zhCN', '反谍报', '在希利苏斯消灭$1oa个军情七处特工。', '嘿，$n，很高兴你来了。\n\n我已经焦头烂额了！会杀人的虫子，陌生的矿物……插在地上的巨型利剑……我对这里有种不好的感觉！\n\n更糟的是，我接到报告，说有联盟间谍在营地周围打探！\n\n孩子，黑暗女王对这种神秘矿物有很多打算，而我不想让她失望，你明白我的意思吗？\n\n到采掘营地去，把那些军情七处间谍干掉，别让他们把整个行动都毁了！', '', '', '', '', '', '', 26365),
(50049, 'zhCN', '代言人的观点', '把卡德加的信交给希利苏斯的麦格尼·铜须。', '萨格拉斯在我们的世界上留下了一道伤疤，$n。这道伤疤绝不会马上愈合……\n\n联盟和部落之间的伤疤也一样。\n\n为了拯救艾泽拉斯免遭毁灭，已经有太多生命在战斗中牺牲。我绝不能坐看这个世界再次陷落。\n\n我走之前有个请求。请把这封信交给麦格尼·铜须。他在希利苏斯寻找治疗伤口的方法。\n\n这封信里的信息对他或许会很有用。', '', '', '', '', '', '', 26365),
(50048, 'zhCN', '涌泉海滩', '完成涌泉海滩战场。', '我们收到报告说，希利苏斯近海有座岛，上面有丰富的艾泽里特矿藏。\n\n我们必须赶在部落得知这座岛的存在前夺下它。\n\n马迪亚斯·肖尔大师会亲自带领远征队，他还要求你前去报到。祝你好运！', '', '', '', '', '', '', 26365),
(50047, 'zhCN', '免费样品', '收集$1oa个神秘矿石样本。', '王室命令军情七处渗透进地精采掘工程并收集情报，让我们了解这种崭新神秘物质。\n\n我的特工已经渗透了营地，但时间有限，我们必须快点拿到一些提取出来的矿物的样品。\n\n也就是说，我需要找人进行直接行动。那个人要能够在处于极端劣势的战斗中幸存下来。\n\n你回来后，把矿物样本带给卡古斯·石衣进行分析。', '', '', '', '', '', '', 26365),
(50046, 'zhCN', '有人搞破坏', '放置$1oa捆炸药。', '部落一直在争分夺秒地从巨大的伤口中抽取这种神秘物质，真是不知羞耻。\n\n幸好，地精工程学远远没有我们在诺莫瑞根做的东西复杂。只需要一点传统的炸药，就能彻底摧毁一台地精切割机。\n\n多单纯的机器啊！\n\n拿上这些炸药包，放在矿工营地周围还没启动的切割机上。\n\n那些贪婪的地精得花好几周才能找到备用机器重新开工！', '', '', '', '', '', '', 26365),
(50035, 'zhCN', 'Bret Test - SQL', '', '', '', '', '', '', '', '', 26365),
(49982, 'zhCN', '见证伤痕', '前往希利苏斯与格洛尔·战刃交谈。', '锈水财阀已经开始在希利苏斯的挖掘作业，提取这一神秘物质。\n\n大酋长坚持让你亲自监督在希利苏斯的萃取工程，并提防联盟的阻挠。\n\n加里维克斯对你的认命不是很满意，不过没人敢拒绝希尔瓦娜斯……\n\n你必须立刻前往希利苏斯。基地指挥官正在那里等你。', '', '', '', '', '', '', 26365),
(49981, 'zhCN', '见证伤痕', '去希利苏斯与军情七处指挥官会面。', '我已经派遣特工前往希利苏斯建立营地。\n\n他们受命监视部落的行动，并收集一切关于这一神秘物质的信息。\n\n我的一位军情七处指挥官正在那里等你。快去吧。', '', '', '', '', '', '', 26365),
(49977, 'zhCN', '奥格瑞玛的召唤', '与纳萨诺斯·凋零者谈一谈。', '大酋长要你尽快回到奥格瑞玛。有一件紧急事务需要你处理。\n\n等你到达后我会详细告诉你。\n\n我就在格罗玛什要塞的入口附近。黑暗女王有任务给你，$n。我可不会让她等太久……', '', '', '', '', '', '', 26365),
(49976, 'zhCN', '牺牲者的馈赠', '跟马迪亚斯·肖尔谈一谈。', '今天早些时候，乌瑞恩国王在雄狮之眠向暴风城的市民发表演说，宣布战争告一段落。\n\n在人群离去后，我与国王及他的顾问进行了一次单独会面，商议在希利苏斯找到的一种神秘物质。\n\n这一发光的矿石似乎有着强大的力量，部落正争分夺秒地从巨大的伤口处抽取这一物质。\n\n国王命令我将细节告诉你，为一项重要的任务做好准备。', '', '', '', '', '', '', 26365),
(49973, 'zhCN', '塔莉萨的庄园', '在苏拉玛首席奥术师的庄园与女伯爵莉亚德琳见面。', '摄政王塞隆邀请夜之子在银月城会面。\n\n首先，我们要对他们发出邀请。而这种事情我喜欢亲自来做。\n\n请跟我一起前往苏拉玛，与塔莉萨女士见面。', '', '', '', '', '', '', 26365),
(49933, 'zhCN', '为了部落', '去奥格瑞玛大使馆与黑卫大使见面。', '经过多年的离群索居，我们再一次成为了某个重要事业的一部分。与部落的结盟为我们带来了一个崭新的开始，以及一个独一无二的机会，我们决不能浪费。\n\n大酋长的大使在奥格瑞玛等你，$n。你可以从那里开始在艾泽拉斯的旅程。守卫这片土地，为夏多雷争得一席之地。\n\n让世界看看我们是谁，$c。为部落带去荣耀，也就是为苏拉玛带来荣耀。', '', '', '', '', '', '去奥格瑞玛大使馆与黑卫大使见面。', 26365),
(49930, 'zhCN', '呼唤同盟', '去奥格瑞玛大使馆与大酋长希尔瓦娜斯·风行者见面。', '部落领导军团之战时太过无私，使得军力下降。我们的敌人妄想趁机夺取我们的应得之物。不能让他们得逞。\n\n我下令在奥格瑞玛建好了大使馆，争取让其他人加入我们的事业。去那儿见我。', '', '', '', '', '', '', 26365),
(49929, 'zhCN', '呼唤同盟', '去暴风城大使馆与乌瑞恩国王见面。', '部落会不惜一切夺取艾泽拉斯的生命之血。我担心，军团之战后，我们的军力已经空虚，没法阻止他们的侵犯。\n\n时机到了，应该有新血加入联盟的事业了。我们在暴风城建了座大使馆来指导相关事务。到那儿见。\n', '', '', '', '', '', '', 26365),
(49928, 'zhCN', '虚空的传承', '前往泰洛古斯裂隙，与奥蕾莉亚·风行者见面。', '经过在艾泽拉斯的冒险之旅， 这股力量虽然总想控制你，但终于为你所用。\n\n你已经成为了联盟的强大武器，$p。回到虚空裂隙，让我们来嘉奖你的成就吧。', '', '', '', '', '', '', 26365),
(49866, 'zhCN', '前往潘达利亚！', '去暴风城找利尔·夜风。', '请立刻前往暴风要塞会见瓦里安·乌瑞恩国王。$b$b我们得到消息说，南海发生了一场冲突，我们需要一位老练的$c来协助调查。', '', '', '', '', '', '', 26365),
(49865, 'zhCN', '大灾变急救员', '向暴风城的地语者纳拉特报到。', '死亡之翼，死亡的化身巨龙，派遣了爪牙想要清除艾泽拉斯的生物。$B$B地语者纳拉特可以告诉你更多海加尔山、瓦丝琪尔以及其他死亡之翼袭击的地方的情报。', '', '', '', '', '', '', 26365),
(49864, 'zhCN', '两线作战', '使用特别任务指派书选择你的下一个冒险目的地。', '$n！你再一次受到了召唤，协助联盟完成重要任务。\n\n你愿意协助联盟对抗死亡之翼和暮光之锤吗？\n\n还是想飞往南方的潘达利亚，抢在部落前头夺取那里的资源？\n\n做出你的选择，然后投入战斗吧！', '', '', '', '', '', '', 26365),
(49863, 'zhCN', '前往诺森德！', '乘船前往诺森德。$b$b你可以从暴风城港口登船前往北风苔原，或者从湿地登船前往嚎风峡湾。', '北方的巫妖王已经蠢蠢欲动。$b$b在他的指挥下，一支亡灵大军正在横扫诺森德，到处散播瘟疫。$b$b我们需要你去阻止他们，$n。', '', '', '', '', '', '', 26365),
(49862, 'zhCN', '前往外域！', '穿过诅咒之地的黑暗之门。', '燃烧军团——那支由无数恶魔组成的大军突袭了德莱尼破碎的故乡，外域。联盟的冒险者需要保护外域的残余土地，不能让它们彻底毁于恶魔入侵。$b$b快前往诅咒之地，穿过黑暗之门吧。', '', '', '', '', '', '', 26365),
(49860, 'zhCN', '冒险的召唤', '使用特别任务指派书选择你的下一个冒险目的地。', '你的英勇事迹已经传遍了艾泽拉斯内外。其他地方也需要你的高超身手。\n\n你愿意穿过黑暗之门，去外域的破碎世界与燃烧军团战斗吗？\n\n或者是飞往北方的诺森德，参加对抗巫妖王的战争。\n\n做出你的选择吧，冒险者。', '', '', '', '', '', '', 26365),
(49855, 'zhCN', '海加尔山之灾', '跟塞纳里奥使者托尔·黑蹄谈一谈，进入月光林地。', '塞纳里奥议会的兄弟报告说，死亡之翼的爪牙对世界树发动了袭击，试图把它烧光！$B$B你可以与塞纳里奥使者托尔·黑蹄谈一谈，获得进入月光林地的许可。他在奥格瑞玛的智慧谷的牛头人区。', '获得前往月光林地的许可', '', '', '', '', '跟月光林地永夜港的风歌使者谈一谈。', 26365),
(49852, 'zhCN', '前往潘达利亚！', '到奥格瑞玛的格罗玛什要塞报到。', '你受命即刻前去格罗玛什要塞报到。$B$B我们得到消息说，南方新发现了一块富饶的大陆，我们计划派你和一小队士兵，为部落占领那里。', '', '', '', '', '', '', 26365),
(49851, 'zhCN', '大灾变急救员', '向奥格瑞玛的先知克洛伽报到。', '死亡之翼，死亡的化身巨龙，派遣了爪牙想要清除艾泽拉斯的生物。$B$B奥格瑞玛的先知克洛伽可以告诉你更多海加尔山、瓦丝琪尔以及其他死亡之翼袭击的地方的情报。', '', '', '', '', '', '', 26365),
(49846, 'zhCN', '两线作战', '使用特别任务指派书选择你的下一个冒险目的地。', '$n！你再一次受到了召唤，协助部落完成重要任务。\n\n你愿意协助部落对抗死亡之翼和暮光之锤吗？\n\n还是想飞往南方，抢在联盟前头夺取那里的资源？\n\n做出你的选择，然后投入战斗吧！', '', '', '', '', '', '', 26365),
(49817, 'zhCN', '前往诺森德！', '乘坐飞艇前往诺森德吧。$b$b你可以在提瑞斯法林地搭乘飞往嚎风峡湾的飞艇，或是在奥格瑞玛搭乘飞往北风苔原的飞艇。', '北方的巫妖王已经蠢蠢欲动。$b$b在他的指挥下，一支亡灵大军正在横扫诺森德，到处散播瘟疫。$b$b我们需要你去阻止他们，$n。', '', '', '', '', '', '', 26365),
(49816, 'zhCN', '前往外域！', '穿过诅咒之地的黑暗之门。', '燃烧军团——那支由无数恶魔组成的大军突袭了兽人破碎的故乡，外域。部落的冒险者需要保护外域的残余土地，不能让它们彻底毁于恶魔入侵。$b$b快前往诅咒之地，穿过黑暗之门吧。', '', '', '', '', '', '', 26365),
(49813, 'zhCN', '冒险的召唤', '使用特别任务指派书选择你的下一个冒险目的地。', '你的英勇事迹已经传遍了艾泽拉斯内外。其他地方也需要你的高超身手。\n\n你愿意穿过黑暗之门，去外域的破碎世界与燃烧军团战斗吗？\n\n或者是飞往北方的诺森德，参加对抗巫妖王的战争。\n\n做出你的选择吧，冒险者。', '', '', '', '', '', '', 26365),
(49812, 'zhCN', '达拉然的德拉丝', '前往达拉然的安东尼达斯纪念碑处找到德拉丝·月牙。', '德拉丝·月牙需要我们的帮助。作为回报，她会协助我们破译命令法典。$B$B我想请你尽快去找到她。据说她很喜欢在肯瑞托已故的伟大领袖——安东尼达斯的纪念碑那里逗留。', '', '', '', '', '', '前往达拉然的安东尼达斯纪念碑处找到德拉丝·月卡。', 26365),
(49788, 'zhCN', '为了联盟', '去暴风城大使馆与穆加德大使见面。', '要掌控虚空低语，需要无时无刻的专注和自律。你的奉献鼓舞了所有朗多雷——因为我们已是虚空之子。\n\n你在我这里学了很多，是时候去泰洛古斯裂隙之外冒险了。\n\n去联盟的心脏暴风城。国王的使者会在那里迎接你，并指引你的旅程。\n\n我们必须守护艾泽拉斯。你是我能想到回应这一号召的最佳人选，$p。', '', '', '', '', '', '去暴风城大使馆与穆加德大使见面。', 26365),
(49787, 'zhCN', '幽魂之地', '找到乌布里克在幽魂之地的家。', '有个叫乌布里克的血精灵和他的追随者被银月城驱逐了，理由是探索虚空魔法。\n\n虽然虚空魔法的确被禁了，但这样的处理方式也太极端了。\n\n不过，这恰好为联盟带来了机遇。如果我们可以找到这些流放者，就可以让他们加入我们的事业。而且更重要的是，我们可以帮助他们理解虚空，防止虚空腐化他们。', '', '', '', '', '', '', 26365),
(49784, 'zhCN', '夜之子的传承', '与暗夜要塞的塔莉萨见面。', '你是夏多雷的第一批冒险者，你游历了艾泽拉斯的荒野。但现在，该回家了。\n\n回苏拉玛来。你帮助族人在这个世界重获地位，我们要感谢你。', '', '', '', '', '', '', 26365),
(49783, 'zhCN', '至高岭的传承', '在雷霆图腾与梅拉·高岭见面。', '你在艾泽拉斯旅行了很久，$p。在这段时间里，你为至高岭带来了荣耀。\n\n现在，至高岭正在召唤你回家。我们觉得是时候了，应该感谢你为我们所做的一切。', '', '', '', '', '', '', 26365),
(49782, 'zhCN', '光铸者的传承', '与维迪卡尔的法瑞娅队长见面。', '你对联盟的帮助令人印象深刻，$p。换了我也不可能做得更好。呃，或许可以……但也好不了太多。\n\n来吧，到维迪卡尔来见我。我们该嘉奖你的勤勉了。', '', '', '', '', '', '', 26365),
(49773, 'zhCN', '为了部落！', '去奥格瑞玛大使馆与黑卫大使见面。', '这是高岭部族的一个新纪元，$n。\n\n经过数个世纪的分离，我们与卡利姆多的同胞们重聚。在拯救我们家园的战争中，我们又在部落找到了新的朋友。\n\n像你这样勇敢的牛头人应该响应冒险的号召，向我们的盟友展示实力。\n\n他们邀请你前往奥格瑞玛。去大酋长的大使馆与大使见面，开始你在艾泽拉斯的旅程吧。\n\n大地母亲与你同在，$n。', '', '', '', '', '', '去奥格瑞玛大使馆与黑卫大使见面。', 26365),
(49772, 'zhCN', '为了联盟', '去暴风城大使馆与穆加德大使见面。', '圣光军团建立的唯一目的，就是击败燃烧军团。尽管我们已经达成了这一目标，但新的职责也已降临。\n\n艾泽拉斯世界充斥着许多敌人。用你在训练中掌握的力量去抗击黑暗，实现联盟的理想。\n\n去暴风城，在大使馆找到国王大使，是时候将正义的圣光的洒遍这块土地了。\n\nPheta thones gamera，$n。', '', '', '', '', '', '去暴风城大使馆与穆加德大使见面。', 26365),
(49698, 'zhCN', '光铸者', '与图拉扬一起前往维迪卡尔。', '$n，你已经亲眼目睹了我们的力量。数千年的战争已经把我们塑造成了对抗军团的专家。\n\n现在，时候到了，可以拿起武器，与联盟的同胞并肩作战了。\n\n到维迪卡尔与我们汇合吧。我相信，我们与法瑞娅队长有很多要谈。', '', '', '', '', '', '与维迪卡尔的法瑞娅队长见面', 26365),
(49614, 'zhCN', '夜之子', '向奥格瑞玛的大酋长复命。', '我们的胜利会让大酋长很高兴。\n\n塔莉萨和她的夜之子必然会成为强大的盟友。', '', '', '', '', '', '', 26365),
(49613, 'zhCN', '银月城', '在银月城与女伯爵莉亚德琳谈一谈。', '夜之子与世隔绝了几千年。现在重现于世，自然需要我们来为他们指引正道。\n\n摄政王塞隆已经邀请夜之子和我们在银月城一叙。\n\n来吧，$n，我们去银月城与塔莉萨会面。', '', '', '', '', '', '', 26365),
(49567, 'zhCN', '英雄的召唤：纳格兰！', '前往德拉诺，与纳格兰的巴弗尔中尉谈一谈。', '联盟所有身强力壮的公民都要前往德拉诺，向纳格兰的巴弗尔中尉报到。\n\n伊瑞尔提议，联盟应该在纳格兰修建一个岗哨，协助抗击战歌氏族。\n\n飞往纳格兰，与巴弗尔中尉和补给车队会面。\n\n荣耀属于联盟！', '', '', '', '', '', '前往德拉诺，与纳格兰的巴弗尔中尉谈一谈。', 26365),
(49566, 'zhCN', '英雄的召唤：阿兰卡峰林！', '与阿兰卡峰林的阿兹克谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候阿兰卡峰林的阿兹克差遣。\n\n那些没有翅膀的鸦人似乎正在逃离阿兰卡峰林。传言说他们是为了躲避钢铁部落的超级武器。\n\n我们需要查明是什么导致他们逃离自己的家园，他们的翅膀又是为何枯萎。\n\n荣耀属于联盟！', '', '', '', '', '', '与阿兰卡峰林的阿兹克谈一谈。', 26365),
(49565, 'zhCN', '英雄的召唤：塔拉多！', '与塔拉多的监工艾克索斯谈一谈。', '联盟所有身强力壮的公民都要向塔拉多的监工艾克索斯报到。\n\n钢铁部落想要攫取塔拉多。这片土地的位置很适合向德拉诺的其他地区迅速增派援军，同时不会遭到抵抗。\n\n监工艾克索斯目前正在塔拉多修建一个岗哨。前往那里，阻止钢铁部落。\n\n荣耀属于联盟！', '', '', '', '', '', '与塔拉多的监工艾克索斯谈一谈。', 26365),
(49564, 'zhCN', '英雄的召唤：戈尔隆德！', '与戈尔隆德的伊瑞尔谈一谈。', '联盟所有身强力壮的公民都要前往德拉诺，向戈尔隆德的伊瑞尔报到。\n\n伊瑞尔和玛尔拉德希望派遣一个小队深入戈尔隆德的荒野。\n\n我们希望借此增加对这片土地的了解，从而掌握钢铁部落的弱点。\n\n协助他们的探险吧。\n\n荣耀属于联盟！', '', '', '', '', '', '与戈尔隆德的伊瑞尔谈一谈。', 26365),
(49561, 'zhCN', '英雄的召唤：恐惧废土！', '去蟠龙脊和女射手李琪薇谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候锦绣谷的蟠龙脊的女射手李琪薇差遣。\n\n影踪派正在努力阻止螳螂妖大军入侵整个潘达利亚。\n\n你可以征用一只风筝，飞向蟠龙脊，前往女射手李琪薇的位置。\n\n荣耀属于联盟！', '', '', '', '', '', '去蟠龙脊和女射手李琪薇谈一谈。', 26365),
(49560, 'zhCN', '英雄的召唤：螳螂高原！', '与螳螂高原的祝踏岚谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候螳螂高原的祝踏岚差遣。\n\n影踪派希望从野牛人手中夺回他们的土地，但他们人手不足。\n\n协助他们攻打野牛人吧。\n\n荣耀属于联盟！', '', '', '', '', '', '与螳螂高原的祝踏岚谈一谈。', 26365),
(49559, 'zhCN', '英雄的召唤：昆莱山！', '与四风谷的土地精信使谈一谈。', '所有身强力壮的联盟成员，从此刻起都要前往昆莱山协助游学者周卓。\n\n与四风谷的土地精信使谈一谈。他们会指引你攀登昆莱山的路。\n\n荣耀属于联盟！', '', '', '', '', '', '与四风谷的土地精信使谈一谈。', 26365),
(49558, 'zhCN', '英雄的召唤：卡桑琅丛林！', '与卡桑琅丛林的肯肯谈一谈。', '所有身强力壮的联盟成员，从此刻起都要前往卡桑琅丛林的朱家堡报到。\n\n有传言说，卡桑琅丛林里的熊猫人行事变得很古怪。\n\n与朱家堡的肯肯谈一谈。也许他知道发生了什么事，导致熊猫人变得如此了无生气。', '', '', '', '', '', '与卡桑琅丛林的肯肯谈一谈。', 26365),
(49557, 'zhCN', '英雄的召唤：四风谷！', '与四风谷的陈·风暴烈酒谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候四风谷的陈·风暴烈酒差遣。\n\n风暴烈酒家族的探险精神值得联盟成员学习。\n\n与风暴烈酒家族一起旅行，探索潘达利亚隐藏的秘密。\n\n荣耀属于联盟！', '', '', '', '', '', '与四风谷的陈·风暴烈酒谈一谈。', 26365),
(49556, 'zhCN', '英雄的召唤：翡翠林！', '向暴风要塞的杰塔瑞斯将军报到。', '所有身强力壮的联盟成员，都要立刻前往暴风城的暴风要塞报到。\n\n杰塔瑞斯将军正在召集队伍完成一个重要任务。\n\n立刻前往暴风要塞了解详情吧。\n\n荣耀属于联盟！', '', '', '', '', '', '', 26365),
(49555, 'zhCN', '英雄的召唤：冰冠冰川！', '与晶歌森林上方的达拉然的军官范恩·罗希姆谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候晶歌森林上方的达拉然的军官范恩·罗希姆差遣。\n\n无畏远征军需要更多冒险者来壮大力量，从而攻打冰冠堡垒和阿尔萨斯本人。\n\n时机已经成熟，巫妖王要为自己犯下的罪行付出代价。\n\n荣耀属于联盟！', '', '', '', '', '', '与晶歌森林上方的达拉然的军官范恩·罗希姆谈一谈。', 26365),
(49554, 'zhCN', '英雄的召唤：风暴峭壁！', '与晶歌森林上方的达拉然的林·多克塔谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候晶歌森林上方的达拉然的林·多克塔差遣。\n\nK3的地精在风暴峭壁修建了一座城市，并派遣大使来招募冒险者。\n\n与林谈一谈，看看K3的居民有什么需要。他们在对抗巫妖王的战争中可以成为宝贵的盟友。\n\n荣耀属于联盟！', '', '', '', '', '', '与晶歌森林上方的达拉然的林·多克塔谈一谈。', 26365),
(49553, 'zhCN', '英雄的召唤：索拉查盆地', '与晶歌森林上方的达拉然的大法师伯塔鲁斯谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候晶歌森林上方的达拉然的大法师伯塔鲁斯差遣。\n\n赫米特·奈辛瓦里带着他的远征军前去探索索拉查盆地，但从此杳无音信。\n\n我们对索拉查的广袤丛林所知不多，但那座盆地里可能里隐藏着许多秘密，可以帮助我们在对抗巫妖王时占得上风。\n\n荣耀属于联盟！', '', '', '', '', '', '与晶歌森林上方的达拉然的大法师伯塔鲁斯谈一谈。', 26365),
(49552, 'zhCN', '英雄的召唤：祖达克！', '与祖达克的北伐军领主兰迪加谈一谈。', '所有身强力壮的联盟成员，从此刻起都要听候祖达克的北伐军领主兰迪加差遣。\n\n天灾军团正在屠杀祖达克当地的居民，并把他们转化为自己的一份子。\n\n协助银色北伐军和黑锋骑士团，阻止这场威胁。\n\n荣耀属于联盟！', '', '', '', '', '', '与祖达克的北伐军领主兰迪加谈一谈。', 26365),
(49551, 'zhCN', '英雄的召唤：嚎风峡湾！', '与嚎风峡湾的玛卡洛伊谈一谈。', '所有身强力壮的联盟成员，都要立刻向嚎风峡湾的玛卡洛伊报到。\n\n港口小镇瓦加德就位于嚎风峡湾的核心地带，能够让联盟占据攻击天灾军团的有利地形。\n\n快去协助驻扎在那里的士兵吧。\n\n荣耀属于联盟！', '', '', '', '', '', '与嚎风峡湾的玛卡洛伊谈一谈。', 26365),
(49550, 'zhCN', '英雄的召唤：影月谷！', '前往外域，与影月谷的空军指挥官努埃恩谈一谈。', '所有身强力壮的联盟成员，都要立刻前往外域的影月谷，向空军指挥官努埃恩报到。\n\n燃烧军团正在围攻蛮锤要塞，威胁到了我们人民的生命安全。\n\n我们需要增援要塞，阻止燃烧军团无休止的进攻！\n\n荣耀属于联盟！', '', '', '', '', '', '前往外域，与影月谷的空军指挥官努埃恩谈一谈。', 26365),
(49549, 'zhCN', '大酋长的命令：纳格兰！', '前往德拉诺的纳格兰，与石头守卫布罗克斯谈一谈。', '所有身强力壮的部落成员必须立即前往德拉诺的纳格兰，向头守卫布罗克斯报到。\n\n萨尔正在彼处建造部落岗哨，需要帮手抵挡战歌部族。\n\n快去和布罗恩·天角谈一谈，与补给车队汇合吧。\n\n为了部落！', '', '', '', '', '', '前往德拉诺的纳格兰，与石头守卫布罗克斯谈一谈。', 26365),
(49548, 'zhCN', '大酋长的命令：阿兰卡峰林！', '与阿兰卡峰林的阿兹克谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候阿兰卡峰林的阿兹克差遣。\n\n那些没有翅膀的鸦人似乎正在逃离阿兰卡峰林。传言说他们是为了躲避钢铁部落的超级武器。\n\n我们需要查明是什么导致他们逃离自己的家园，他们的翅膀又是为何枯萎。\n\n为了部落！', '', '', '', '', '', '与阿兰卡峰林的阿兹克谈一谈。', 26365),
(49547, 'zhCN', '大酋长的命令：塔拉多！', '与塔拉多的工头格罗巴什谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候塔拉多的工头格罗巴什差遣。\n\n钢铁部落想要攫取塔拉多。这片土地的位置很适合向德拉诺的其他地区迅速增派援军，同时不会遭到抵抗。\n\n工头格罗巴什目前正在塔拉多修建一个岗哨。前往那里，阻止钢铁部落。\n\n为了部落！', '', '', '', '', '', '与塔拉多的工头格罗巴什谈一谈。', 26365),
(49546, 'zhCN', '大酋长的命令：戈尔隆德！', '与戈尔隆德的杜隆坦谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候戈尔隆德的杜隆坦差遣。\n\n杜隆坦正在寻求盟友，帮助我们在戈尔隆德的蛮荒地表上前进，从而找到远古的力量帮助我们摧毁钢铁部落。\n\n与他谈一谈，了解这片土地包含的秘密。\n\n为了部落！', '', '', '', '', '', '与戈尔隆德的杜隆坦谈一谈。', 26365),
(49543, 'zhCN', '大酋长的命令：恐惧废土！', '去蟠龙脊和女射手李琪薇谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候锦绣谷的蟠龙脊的女射手李琪薇差遣。\n\n影踪派正在努力阻止螳螂妖大军入侵整个潘达利亚。\n\n你可以征用一只风筝，飞向蟠龙脊，前往女射手李琪薇的位置。\n\n命运在召唤！', '', '', '', '', '', '去蟠龙脊和女射手李琪薇谈一谈。', 26365),
(49542, 'zhCN', '大酋长的命令：螳螂高原！', '与螳螂高原的祝踏岚谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候螳螂高原的祝踏岚差遣。\n\n影踪派希望从野牛人手中夺回他们的土地，但他们人手不足。\n\n协助他们攻打野牛人吧。\n\n为了部落！', '', '', '', '', '', '与螳螂高原的祝踏岚谈一谈。', 26365),
(49541, 'zhCN', '大酋长的命令：昆莱山！', '与四风谷的土地精信使谈一谈。', '所有身强力壮的部落成员，从此刻起都要前往昆莱山协助游学者周卓。\n\n与四风谷的土地精信使谈一谈。他们会为你指引攀登昆莱山的路。\n\n为了部落！', '', '', '', '', '', '与四风谷的土地精信使谈一谈。', 26365),
(49540, 'zhCN', '大酋长的命令：卡桑琅丛林！', '与卡桑琅丛林的肯肯谈一谈。', '所有身强力壮的部落成员，从此刻起都要前往卡桑琅丛林的朱家堡报到。\n\n有传言说，卡桑琅丛林里的熊猫人行事变得很古怪。\n\n与朱家堡的肯肯谈一谈。也许他知道发生了什么事，导致熊猫人变得如此了无生气。', '', '', '', '', '', '与卡桑琅丛林的肯肯谈一谈。', 26365),
(49539, 'zhCN', '大酋长的命令：四风谷！', '与四风谷的陈·风暴烈酒谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候四风谷的陈·风暴烈酒差遣。\n\n风暴烈酒家族的探险精神值得部落成员学习。\n\n与风暴烈酒家族一起旅行，探索潘达利亚隐藏的秘密。\n\n为了部落！', '', '', '', '', '', '与四风谷的陈·风暴烈酒谈一谈。', 26365),
(49538, 'zhCN', '大酋长的命令：翡翠林！', '前往格罗玛什要塞向纳兹戈林将军报到。', '所有身强力壮的部落成员必须立即前往奥格瑞玛的纳兹戈林将军处报到。\n\n最近在与联盟的海战中取得的胜利进一步加强了我们的决心。\n\n赶快前往格罗玛什要塞报到，协助部落的远征舰队吧。\n\n为了部落！', '', '', '', '', '', '', 26365),
(49537, 'zhCN', '大酋长的命令：冰冠冰川！', '与晶歌森林上方的达拉然的掠天者科鲁姆谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候晶歌森林上方的达拉然的掠天者科鲁姆差遣。\n\n战歌远征军需要更多冒险者来壮大力量，从而攻打冰冠堡垒和阿尔萨斯本人。\n\n时机已经成熟，巫妖王要为自己犯下的罪行付出代价。\n\n为了部落！', '', '', '', '', '', '与晶歌森林上方的达拉然的掠天者科鲁姆谈一谈。', 26365),
(49536, 'zhCN', '大酋长的命令：风暴峭壁！', '与晶歌森林上方的达拉然的林·多克塔谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候晶歌森林上方的达拉然的林·多克塔差遣。\n\nK3的地精在风暴峭壁修建了一座城市，并派遣大使来招募冒险者。\n\n与林谈一谈，看看K3的居民有什么需要。他们在对抗巫妖王的战争中可以成为宝贵的盟友。\n\n为了部落！', '', '', '', '', '', '与晶歌森林上方的达拉然的林·多克塔谈一谈。', 26365),
(49535, 'zhCN', '大酋长的命令：索拉查盆地！', '与晶歌森林上方的达拉然的大法师伯塔鲁斯谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候晶歌森林上方的达拉然的大法师伯塔鲁斯差遣。\n\n赫米特·奈辛瓦里带着他的远征军前去探索索拉查盆地，但从此杳无音信。\n\n我们对索拉查的广袤丛林所知不多，但那座盆地里可能里隐藏着许多秘密，可以帮助我们在对抗巫妖王时占得上风。\n\n为了部落！', '', '', '', '', '', '与晶歌森林上方的达拉然的大法师伯塔鲁斯谈一谈。', 26365),
(49534, 'zhCN', '大酋长的命令：祖达克！', '与祖达克的北伐军领主兰迪加谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候祖达克的北伐军领主兰迪加差遣。\n\n天灾军团正在屠杀祖达克当地的居民，并把他们转化为自己的一份子。\n\n协助银色北伐军和黑锋骑士团，阻止这场威胁。\n\n为了部落！', '', '', '', '', '', '与祖达克的北伐军领主兰迪加谈一谈。', 26365),
(49533, 'zhCN', '大酋长的命令：嚎风峡湾！', '与嚎风峡湾的药剂师雷杉德尔谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候嚎风峡湾的药剂师雷杉德尔差遣。\n\n被遗忘者在诺森德东岸修建了一座要塞。\n\n时机已经成熟，我们要用强大的军事力量，和皇家药剂师协会研制的新型瘟疫来打击天灾军团。\n\n为了部落！', '', '', '', '', '', '与嚎风峡湾的药剂师雷杉德尔谈一谈。', 26365),
(49532, 'zhCN', '大酋长的命令：影月谷！', '与外域影月谷的血卫士古尔穆克谈一谈。', '所有身强力壮的部落成员，从此刻起都要听候外域影月谷的血卫士古尔穆克差遣。\n\n燃烧军团企图围攻影月村，但我们的精英库卡隆部队已经让他们明白了，与部落对抗是多么的愚蠢。\n\n把燃烧军团碾碎吧。\n\n为了部落！', '', '', '', '', '', '与外域影月谷的血卫士古尔穆克谈一谈。', 26365),
(49354, 'zhCN', '记住太阳之井的耻辱', '完成“记住太阳之井的耻辱”场景战役。', '摄政王希望向首席奥术师塔莉萨展示一下太阳井。\n\n我不知道他是否同意让奥蕾莉亚·风行者参与会面，但我们也受邀了。', '', '', '', '', '', '', 26365),
(49266, 'zhCN', '万世熔炉', '见证光铸仪式。', '光铸者一直都是军团之战的希望明灯。\n\n但很少有人知道，要成为圣光之怒的化身需要付出什么代价。\n\n圣光军团有少数几名勇士做好了准备，即将接受最终的试练。\n\n我们能有幸请你见证这一伟大的时刻吗？', '', '', '', '', '', '', 26365),
(49198, 'zhCN', '大型侵入点：审判官梅托', '', '', '', '', '', '', '', '', 26365),
(49197, 'zhCN', '大型侵入点：索塔纳索尔', '', '', '', '', '', '', '', '', 26365),
(49049, 'zhCN', '烁光之翼', '', '', '', '', '', '', '', '', 26365),
(49043, 'zhCN', '毒光鳐', '', '', '', '', '', '', '', '', 26365),
(48985, 'zhCN', '执政团之座：暮光使徒萨鲁尔', '', '', '', '', '', '', '', '', 26365),
(48962, 'zhCN', '泰洛古斯裂隙', '前往泰洛古斯裂隙，完成场景战役。', '乌布里克和他的血精灵同胞因为追求知识而被自己的家园驱逐。\n\n我比任何人都清楚虚空的危险。我们应该伸出援手，免得他们做出什么铤而走险的事情。\n\n这个裂隙会将我们带到他们当前的位置。我希望现在拯救他们还为时不晚。', '', '', '', '', '', '', 26365),
(48936, 'zhCN', '最后的希里索恩', '', '', '', '', '', '', '', '', 26365),
(48832, 'zhCN', '雷尔瓦将军', '', '', '', '', '', '', '', '', 26365),
(48739, 'zhCN', '指挥官泽斯加尔', '', '', '', '', '', '', '', '', 26365),
(48737, 'zhCN', '导师塔拉娜', '', '', '', '', '', '', '', '', 26365),
(48731, 'zhCN', '混沌先驱', '', '', '', '', '', '', '', '', 26365),
(48728, 'zhCN', '乌伯拉利斯', '', '', '', '', '', '', '', '', 26365),
(48726, 'zhCN', '清醒者图瑞克', '', '', '', '', '', '', '', '', 26365),
(48723, 'zhCN', '警卫泰诺斯', '', '', '', '', '', '', '', '', 26365),
(48696, 'zhCN', '牧羊人卡沃斯', '', '', '', '', '', '', '', '', 26365),
(48689, 'zhCN', 'Lockout Tracking - Boss - Marsh', '', '', '', '', '', '', '', '', 26365),
(48687, 'zhCN', 'Lockout Tracking - Boss - Blood', '', '', '', '', '', '', '', '', 26365),
(48624, 'zhCN', '恶犬归西', '', '', '', '', '', '', '', '', 26365),
(48511, 'zhCN', '指挥官安达西斯', '', '', '', '', '', '', '', '', 26365),
(48467, 'zhCN', '普希拉', '', '', '', '', '', '', '', '', 26365),
(48434, 'zhCN', '黑角的现状', '返回雷霆图腾探望黑角。', '我们已经修复了三个古代结界。这座山还不安全，但我们或许已经能够让黑角摆脱控制他的黑暗力量了。\n\n让我们回雷霆图腾去看看他怎么样了。但愿黑角能告诉我们更多有关亡黯教派以及他们所侍奉的那个邪恶主子的信息。', '', '', '', '', '', '', 26365),
(48433, 'zhCN', '团结是部落的力量！', '返回奥格瑞玛，在奥格瑞玛大使馆与大酋长谈一谈。', '一场简单的宴会最后却引发了一场与想要吞噬世界的古代邪神间的大战。\n\n我就喜欢这种日子！\n\n你的行动保障了奥格瑞玛与至高岭的盟约。这些牛头人会成为部落的宝贵力量。\n\n大酋长一定会很满意的。', '', '', '', '', '', '', 26365),
(48403, 'zhCN', '黑暗之兽', '击败黑暗之王乌尔吉奈斯。', '数千年来，黑暗之王一直被阻挡着。这些结界不断运转……保护着至高岭。\n\n现在，它们消失了，邪神重获自由了。\n\n一直纠缠着我们的黑暗梦魇……就连狗头人也只敢满怀恐惧地窃窃私语的邪神……就要来了。\n\n上古之神的使徒乌尔吉奈斯在为他的主子铺路。除非我们能齐心协力打败他，否则一切都将完蛋。\n\n你必须全力以赴，勇士。我们都得全力以赴。', '', '', '乌尔吉奈斯', '', '', '', 26365),
(48306, 'zhCN', '寂灭者', '击败安托鲁斯，燃烧王座的寂灭者阿古斯。', '阿古斯是萨格拉斯消灭万物存在的终极手段。为了现在和将来的所有生命，请消灭寂灭者。', '', '', '', '', '', '', 26365),
(48302, 'zhCN', '寂灭者', '击败安托鲁斯，燃烧王座的寂灭者阿古斯。', '阿古斯是萨格拉斯消灭万物存在的终极手段。为了现在和将来的所有生命，请消灭寂灭者。', '', '', '', '', '', '', 26365),
(48298, 'zhCN', '寂灭者', '击败安托鲁斯，燃烧王座的寂灭者阿古斯。', '阿古斯是萨格拉斯消灭万物存在的终极手段。为了现在和将来的所有生命，请消灭寂灭者。', '', '', '', '', '', '', 26365),
(48294, 'zhCN', '寂灭者', '击败安托鲁斯，燃烧王座的寂灭者阿古斯。', '阿古斯是萨格拉斯消灭万物存在的终极手段。为了现在和将来的所有生命，请消灭寂灭者。', '', '', '', '', '', '', 26365),
(48287, 'zhCN', '悲伤收割者', '', '', '', '', '', '', '', '', 26365),
(48286, 'zhCN', '水晶的用途', '', '', '', '', '', '', '', '', 26365),
(48285, 'zhCN', '制空权', '', '', '', '', '', '', '', '', 26365),
(48190, 'zhCN', '胡恩的高岭', '在雪盲台地与灵魂行者灰天见面。', '我们激活结界的任务有了一些进展，但还有更多事情要做。\n\n我感觉黑角正在挣扎。虽然他已经全力反抗，却仍一步步滑向深渊。如果这个“黑暗之王”出现在我们的世界，我们的朋友恐怕就没救了。\n\n黑角提到过，雪盲台地的某个地方还有一个结界。去那里找我吧，我或许能指引你进入另一段回忆。', '', '', '', '', '', '在雪盲台地与灵魂行者灰天见面。', 26365),
(48185, 'zhCN', '圣墓的阴影', '在苍穹圣墓与灵魂行者灰天见面。', '黑角说过，有一个结界保护着天角部族的土地。据说它就位于苍穹圣墓附近。这个“黑暗之王”曾经在那里出现过。\n\n去那里找我吧，$n。我会告诉你该如何走进一位伟大的天角英雄的回忆。', '', '', '', '', '', '在苍穹圣墓与灵魂行者灰天见面。', 26365),
(48175, 'zhCN', '藏匿虚空', '', '', '', '', '', '', '', '', 26365),
(48102, 'zhCN', '鳞片样本', '', '', '', '', '', '', '', '', 26365),
(48100, 'zhCN', '保卫玛凯雷', '', '', '', '', '', '', '', '', 26365),
(48097, 'zhCN', '守门人的评价：机智', '', '', '', '', '', '', '', '', 26365),
(48096, 'zhCN', '核心机制', '', '', '', '', '', '', '', '', 26365),
(48095, 'zhCN', '黑暗实验', '', '', '', '', '', '', '', '', 26365),
(48079, 'zhCN', '返回至高岭', '前往至高岭的雷霆图腾找梅拉·高岭。', '灵魂行者黑角还有危险。他与梅拉已经回到了至高岭，但我相信他们仍然需要帮助。\n\n让我们前往雷霆图腾，尽可能治愈黑角。也许我们的努力能加强我们人民之间的联系。', '', '', '', '', '', '前往至高岭的雷霆图腾找梅拉·高岭。', 26365),
(48067, 'zhCN', '雷霆崖的阴影', '在雷霆崖消灭$1oa条黑暗触须和$2oa个乌尔之影。', '一股黑暗力量降临到了我们头上。我不相信这是高岭牛头人策划的。\n\n外面的噪音有点耳熟，这让我很不安。难道是……\n\n不！上古之神的爪牙进攻了！我们必须为雷霆崖而战，$n！', '', '', '', '', '', '', 26365),
(48066, 'zhCN', '款待同胞', '前往莫高雷的雷霆崖找贝恩·血蹄。', '为了欢迎至高岭牛头人访问雷霆崖，我们策划了一场盛大的宴会。这将是他们第一次造访卡利姆多。我跟他们的酋长通过信……很期待能与她面对面交流。\n\n你会来莫高雷加入我们吗？他们一定很乐意见到你这位协助他们对抗燃烧军团的老熟人。', '', '', '', '', '', '前往莫高雷的雷霆崖找贝恩·血蹄。', 26365),
(47712, 'zhCN', '灭绝者', '', '', '', '', '', '', '', '', 26365),
(47705, 'zhCN', '深入敌后', '', '', '', '', '', '', '', '', 26365),
(47507, 'zhCN', '卡扎杜姆', '', '', '', '', '', '', '', '', 26365),
(47008, 'zhCN', '法师塔之赐', '', '', '', '', '', '', '', '', 26365),
(46947, 'zhCN', '布鲁塔卢斯', '', '', '', '', '', '', '', '', 26365),
(46707, 'zhCN', '仆从！把那个也干掉！', '', '', '', '', '', '', '', '', 26365),
(46278, 'zhCN', '送还给寄件人', '退回$1oa封被拒收的信件。', '你来得正是时候！$B$B不像最近的邮件，总是迟到。$B$B我们人手严重不足，而需求却创历史新高。我们真的忙不过来了！$B$B我是想聊天，但在我要想稍微休息下，就得需要帮助。$B$B首先，好几个被拒收的包裹又散开了；你能帮我把它们重新打包，再送还给寄件人吗？', '', '', '', '', '', '', 26365),
(46236, 'zhCN', '石化士兵', '', '', '', '', '', '', '', '', 26365),
(46190, 'zhCN', '乌格姆', '', '', '', '', '', '', '', '', 26365),
(46180, 'zhCN', '敌人的力量', '', '', '', '', '', '', '', '', 26365),
(46179, 'zhCN', '击溃军团', '', '', '', '', '', '', '', '', 26365),
(46161, 'zhCN', '邪能召唤者萨勒兹拉', '', '', '', '', '', '', '', '', 26365),
(46134, 'zhCN', '需要宝石切割', '', '', '', '', '', '', '', '', 26365),
(46063, 'zhCN', '哀嚎的亡者', '', '', '', '', '', '', '', '', 26365),
(46046, 'zhCN', '巫妖的日常生活', '', '', '', '', '', '', '', '', 26365),
(46032, 'zhCN', '受难者归来', '', '', '', '', '', '', '', '', 26365),
(46013, 'zhCN', '召火者洛顿', '', '', '', '', '', '', '', '', 26365),
(46011, 'zhCN', '巨型地狱火', '', '', '', '', '', '', '', '', 26365),
(45805, 'zhCN', '燃烧的钥匙', '', '', '', '', '', '', '', '', 26365),
(45791, 'zhCN', '战争物资', '', '', '', '', '', '', '', '', 26365),
(45653, 'zhCN', '火攻！', '', '', '', '', '', '', '', '', 26365),
(45626, 'zhCN', '设置炸弹！', '', '', '', '', '', '', '', '', 26365),
(45542, 'zhCN', '穿越敌人的传送门', '', '', '', '', '', '', '', '', 26365),
(44971, 'zhCN', '兽人的气味', '带着你的雪羽雏龙前往奥格瑞玛的“破裂的獠牙”。', '<你发现只要有兽人靠近，这只雪羽雏龙就会瑟瑟发抖。看来它真的很怕兽人。或许你能把它带到兽人聚集的地方，让它习惯这种气味。>', '', '', '', '', '', '', 26365),
(44943, 'zhCN', '克劳德舒斯的利爪', '', '', '', '海边最狂暴的龙虾人。', '克劳德舒斯', '', '', '', 26365),
(44847, 'zhCN', '直指源头', '', '', '', '', '', '', '', '', 26365),
(44786, 'zhCN', '期中考试：符文测验', '', '', '', '', '', '', '', '', 26365),
(44765, 'zhCN', '荆棘谷钓鱼大赛', '', '', '', '', '', '', '', '', 26365),
(44174, 'zhCN', '强中自有强中手', '通过搜寻战斗功能，以全队25级宠物打败5名玩家。', '这次星辰的排列真的非常奇怪，它们使得最微小的生物也有了不寻常的天资。我们的贤者无法解释这一现象，不过精明的训练师会把握这个机会，尤其是借这段时间与其他同好切磋技艺。', '', '', '', '', '', '', 26365),
(44157, 'zhCN', '枯法之争：泰安诺', '', '', '', '', '', '', '', '', 26365),
(44067, 'zhCN', '巩固力量', '', '', '', '', '', '', '', '', 26365),
(44044, 'zhCN', '失败的实验', '', '', '', '', '', '', '', '', 26365),
(44033, 'zhCN', '啊，坚果！', '', '', '', '', '', '', '', '', 26365),
(44013, 'zhCN', '通缉：卫兵索艾尔', '', '', '', '', '', '', '', '', 26365),
(43964, 'zhCN', '族长的盛宴', '', '', '', '', '', '', '', '', 26365),
(43959, 'zhCN', '讹诈斯特拉瑞斯', '', '', '', '', '', '', '', '', 26365),
(43807, 'zhCN', '枯法之争：琥珀谷', '', '', '', '', '', '', '', '', 26365),
(43804, 'zhCN', '被怨恨的积怨', '', '', '', '', '', '', '', '', 26365),
(43769, 'zhCN', '魔网竞速', '', '', '', '', '', '', '', '', 26365),
(43752, 'zhCN', '哦，船！', '', '', '', '', '', '', '', '', 26365),
(43751, 'zhCN', '哦，船！', '', '', '', '', '', '', '', '', 26365),
(43709, 'zhCN', '海豹俱乐部', '', '', '', '', '', '', '', '', 26365),
(43642, 'zhCN', '黑鸦堡垒：悲伤', '', '', '', '', '', '', '', '', 26365),
(43512, 'zhCN', '鬼母阿娜', '', '', '', '', '', '', '', '', 26365),
(43460, 'zhCN', '通缉：奇兰尼斯·暮语', '', '', '', '', '', '', '', '', 26365),
(43459, 'zhCN', '通缉：松达克斯', '', '', '', '', '', '', '', '', 26365),
(43456, 'zhCN', '通缉：斯库瓦克斯', '', '', '', '', '', '', '', '', 26365),
(43451, 'zhCN', '通缉：掠夺者乌格夫', '', '', '', '', '', '', '', '', 26365),
(43436, 'zhCN', '通缉：葛利玛·铁拳', '', '', '', '', '', '', '', '', 26365),
(43434, 'zhCN', '通缉：法斯尼尔', '', '', '', '', '', '', '', '', 26365),
(43328, 'zhCN', '神秘莫测', '', '', '', '', '', '', '', '', 26365),
(43121, 'zhCN', '危险：宝物主管加布里尔', '', '', '', '', '', '', '', '', 26365),
(42969, 'zhCN', '身边的间谍', '', '', '', '', '', '', '', '', 26365),
(42798, 'zhCN', '危险：女猎手艾丝蒂德', '', '', '', '', '', '', '', '', 26365),
(42712, 'zhCN', '艾萨拉之眼：终结之爪', '', '', '', '', '', '', '', '', 26365),
(42652, 'zhCN', '古老样本', '', '', '', '', '', '', '', '', 26365),
(42633, 'zhCN', '通缉：沃萨克斯', '', '', '', '', '', '', '', '', 26365),
(42631, 'zhCN', '通缉：审判官提沃斯', '', '', '', '', '', '', '', '', 26365),
(42274, 'zhCN', '会有人想起雏龙吗？', '', '', '', '', '', '', '', '', 26365),
(42270, 'zhCN', '天空之劫', '', '', '', '', '', '', '', '', 26365),
(42269, 'zhCN', '夺魂者', '', '', '', '', '', '', '', '', 26365),
(42240, 'zhCN', '英灵殿：笨重偷猎', '', '', '', '', '', '', '', '', 26365),
(42177, 'zhCN', '夺回墨尔海姆', '', '', '', '', '', '', '', '', 26365),
(42159, 'zhCN', '守夜人训练', '', '', '', '', '', '', '', '', 26365),
(42151, 'zhCN', '净化天空', '', '', '', '', '', '', '', '', 26365),
(42145, 'zhCN', '逃出险境', '', '', '', '', '', '', '', '', 26365),
(42111, 'zhCN', '火力侦察', '', '', '', '', '', '', '', '', 26365),
(41992, 'zhCN', '扭曲之尘', '', '', '', '', '', '', '', '', 26365),
(41950, 'zhCN', '雷霆呼唤！', '乘着维瑟尔飞行，在赫达沙尔消灭150名神王的部下。', '你已经证明了自己是托林尼尔的朋友，我们愿意给予你力量。不过，我们新的勇士，我想请你帮最后一个忙。 \n\n指引你来找我的巨龙还在等待一个向维库人复仇的机会。我希望你跟我们齐心协力，一起去惩治这些德克加尔，让他们看看惹怒托林尼尔的后果。他们必须血债血偿。\n\n等你准备好之后就去找维瑟尔。', '', '', '', '', '', '', 26365),
(41948, 'zhCN', '宠物登天', '', '', '', '', '', '', '', '', 26365),
(41925, 'zhCN', '大闹地狱', '', '', '', '', '', '', '', '', 26365),
(41884, 'zhCN', '黑暗传说', '前往河湾找灵魂行者灰天。', '灵魂行者黑角暂时没事了。\n\n他曾告诉我过，他维护着对抗上古之神的封印。他将这些结界放在了这条山脉的各个关键位置，但凡人的眼睛看不到它们的位置——就连我也不例外。\n\n但他现在失去了行动能力，他的结界也无法再阻挡邪恶力量了。这显然就是他们攻击的目的。\n\n如果想要找到结界，我们就必须进入黑角的回忆，与那里的灵魂交谈。\n\n来河湾找我吧，$n。我们要从那里开始找起。', '', '', '', '', '', '前往河湾找灵魂行者灰天。', 26365),
(41882, 'zhCN', '黑暗低语', '解救$1oa个至高岭保卫者。', '在我们几个到来之前，我们已经有很多人来消灭这里的威胁。但他们并不知道自己面对的是什么。\n\n我们的人民现在正在受到低语的折磨。上古之神想要腐化他们，让他们自相残杀。\n\n唤醒他们吧，不管用什么办法也要把他们从低语中解救出来。', '', '', '', '', '', '', 26365),
(41841, 'zhCN', '最后的结界', '修复山顶结界。', '亡黯教派正在准备仪式，要为黑暗之王制造躯体。他们把自己封印在了里面，并挡住了我们的去路。\n\n你带给我的碎冰应该可以打破这个屏障。一旦屏障消失，我们就得迅速行动。我们必须在黑暗之王显形前修复最后一个结界。\n\n不要犹豫。至高岭已经命悬一线了。', '', '', '', '', '', '', 26365),
(41840, 'zhCN', '冰与影', '收集$1oa块暗浊碎冰。', '我们打倒了一个亡黯教徒。黑角发现它手上有一块灌注了暗影精华的冰块。\n\n这些恶棍或许是将这些碎片当成了某种护符。我建议你去从他们手上再抢一些过来。\n\n我对这种魔法知之甚少，但黑角似乎知道该怎么使用它们。', '', '', '', '', '', '', 26365),
(41815, 'zhCN', '亡黯的诅咒', '前往高岭峰。', '显然上古之神一直想要控制至高岭。这片土地上的力量，以及回荡在它的高山峡谷的万灵之力都令这些贪婪的家伙垂涎欲滴。\n\n只要我还有一口气在，他们就休想占据我们的圣山，$n。\n\n只要高岭诸族齐心协力，再加上贝恩·血蹄的帮助，我们就能彻底打败黑暗之王。\n\n来吧。让我们夺回山顶，击退那股想要腐化它的恶势力。', '', '', '', '', '', '在高岭峰与贝恩·血蹄汇合。', 26365),
(41802, 'zhCN', '勇者之门', '在风暴峡湾的勇者之门附近进行勘测，取得$1oa块破损的泰坦圆盘碎片。', '通常来说你不会知道，维库英灵殿入口处的阶梯其实是挖掘古代神器的好地方。问题是，那里被恶魔弄得一团糟。$b$b你的选择不多。如果圆盘不在风暴峡湾的其他地方，那就最有可能在勇者之门附近。祝你好运，$n。', '', '', '', '', '', '', 26365),
(41800, 'zhCN', '黑暗之王的仆从', '使用视像之水，进入胡恩·高岭的记忆。', '至高岭历史上的英雄们曾设下过结界，以保护我们的土地不受邪恶的上古之神侵扰。这些高贵勇士的功绩保护了我们数千年。\n\n我们绝不能让他们失望。\n\n胡恩·高岭本人也在雪盲台地设置过一个结界。我们必须重新激活它，才有可能拯救黑角。\n\n进入胡恩之魂的回响，让他的勇气指引你找到这个结界吧。', '', '', '', '', '', '', 26365),
(41799, 'zhCN', '黑暗爪牙', '使用视像之水，进入奥妮娅·天角的记忆。', '奥妮娅·天角是天角部族的传奇酋长。虽然她已前往灵魂世界，可我们身边仍有她留下的印记。\n\n黑角告诉过我，奥妮亚在这里设下过一个结界，以保护她深爱的族人……也许就是为了阻挡黑暗之王的幽灵。\n\n使用视像之水走进她的回响吧。不要担心这个仪式会打扰她的安息。像奥妮娅这样的英雄一定会不遗余力地帮助我们的。', '', '', '', '', '', '', 26365),
(41766, 'zhCN', '野生动物保护力量', '在宠物战斗中击败罗克。', '', '', '', '', '', '', '', 26365),
(41764, 'zhCN', '前人的脚步', '使用视像之水，进入屠龙者伊格鲁尔的记忆。', '灵魂行者维护着生者和灵魂世界之间的平衡。我们可以进入亡者的记忆，收集历史的线索。\n\n黑角维护的结界是很久之前，由对抗黑暗的英雄们所设置的。只要追随他们的脚步，我们或许就能找到结界并修复它们。\n\n这位人称“屠龙者”的卓格巴尔——伊格鲁尔，他是胡恩·高岭的朋友。使用视像之水进入他的记忆，找到他将第一个结界放在哪里了。', '', '', '', '', '', '', 26365),
(41701, 'zhCN', '难上加难', '', '', '', '', '', '', '', '', 26365),
(41692, 'zhCN', '沉船打捞者', '', '', '', '', '', '', '', '', 26365),
(41659, 'zhCN', '产品订单：雪崩药剂', '', '', '', '', '', '', '', '', 26365),
(41657, 'zhCN', '产品订单：原始魔力饮剂', '', '', '', '', '', '', '', '', 26365),
(41646, 'zhCN', '产品订单：丝纹手套', '', '', '', '', '', '', '', '', 26365),
(41566, 'zhCN', '魔皮', '', '', '', '', '', '', '', '', 26365),
(41553, 'zhCN', '厚切培根', '', '', '', '', '', '', '', '', 26365),
(41526, 'zhCN', '茂盛的狐尾花', '', '', '', '', '', '', '', '', 26365),
(41517, 'zhCN', '邪能球茎', '', '', '', '', '', '', '', '', 26365),
(41486, 'zhCN', '硫磺毁灭者', '', '', '', '', '', '', '', '', 26365),
(41446, 'zhCN', '黑化邪能页岩矿脉', '', '', '', '', '', '', '', '', 26365),
(41421, 'zhCN', '突袭守望高塔：守夜人营地', '', '', '', '', '', '', '', '', 26365),
(41411, 'zhCN', '遗失的邮件', '将遗失的邮件交给达拉然下水道的郭雅夫人。', '致：达拉然下水道，郭雅夫人\n\n重要！\n\n特急件！\n\n立即投递！', '', '', '', '', '', '', 26365),
(41397, 'zhCN', '巨大的包裹', '用达拉然的虚灵传送门运送1362块坚固的石头。', '由于我们收到了大量投诉，最近几个月我们都不能邮寄坚……坚……$B$B<邮政长忍住眼泪，眼中闪烁着痛苦>$B$B坚固的石头。这些石头已经堆到我们的胸口了——要是不快点把它送出去，我们很快就会被——$B$B<邮政长眼睛突然亮了起来。>$B$B对了！$B$B离这不远有座陈旧的星界财团传送门，我们可以神不知鬼不觉地把石头放进去！$B$B能帮帮忙吗，$n？这石头非常沉。', '', '', '', '', '', '', 26365),
(41395, 'zhCN', '应得的报酬', '将烁影最爱的玩具放在希尔斯布莱德丘陵药渣农场的坟墓里。', '我们在一起的这几分钟你把我侍奉得不错——我不会马上就把这几分钟抛之脑后的。回报你忠心的奖励已经准备好了。你将有荣幸把烁影最爱的玩具放在他的坟墓里，以此来纪念他。$B$B拜托，拜托——要谢就谢烁影吧；纪念一匹由星星汇成的马可不是每天都有的事情。', '', '', '', '', '', '', 26365),
(41394, 'zhCN', '微笑服务', '为强尼·傲森将无敌的缰绳卖给哥特·韦德斯潘。', '噢，$r啊$r，总是这么单纯。$B$B我没有“忘记”从巫妖王，就是那位步态愚蠢的骑士那找回这些缰绳。我只是觉得麻烦，因为上周我已经在团队副本里拿到了这匹良驹。$B$B<强尼走向他左手边的那匹马。>$B$B不过既然你在这里，又显然被我惊世的才华所吸引，那不如你把那匹多余的马带给镇上的度假地主管助理？我的金库也能多点额外的金币。', '', '', '', '', '', '', 26365),
(41368, 'zhCN', '遗失的邮件', '将遗失的邮件交给达拉然下水道的郭雅夫人。', '致：达拉然下水道，郭雅夫人\n\n重要！\n\n特急件！\n\n立即投递！', '', '', '', '', '', '', 26365),
(41367, 'zhCN', '优先递送', '从巫妖王那里找回遗落的战利品，并交给菲拉斯蒸汽之池的收货人。', '有位来自另一个时空的冒险者忘记拾取一件好东西了……要是不快点交给他的话，他肯定会闷闷不乐。$B$B你得去冰冠堡垒，找到巫妖王的尸体。尽快取回战利品，并将它交给健壮的冒险者。他应该在菲拉斯的蒸汽之池。$B$B我的助手会打开一个传送门送你过去。稍等！', '', '', '', '', '', '', 26365),
(41302, 'zhCN', '产品订单：星光玫瑰', '', '', '', '', '', '', '', '', 26365);

INSERT INTO `quest_template_locale` (`ID`, `locale`, `LogTitle`, `LogDescription`, `QuestDescription`, `AreaDescription`, `PortraitGiverText`, `PortraitGiverName`, `PortraitTurnInText`, `PortraitTurnInName`, `QuestCompletionLog`, `VerifiedBuild`) VALUES
(41297, 'zhCN', '产品订单：夏斯卡格草', '', '', '', '', '', '', '', '', 26365),
(41289, 'zhCN', '茂盛的安瑟瑞尔花', '', '', '', '', '', '', '', '', 26365),
(41282, 'zhCN', '产品订单：符鳞锦鲤', '', '', '', '', '', '', '', '', 26365),
(41274, 'zhCN', '活泼的风暴鳐鱼', '', '', '', '', '', '', '', '', 26365),
(41272, 'zhCN', '产品订单：藓鳃鲈鱼', '', '', '', '', '', '', '', '', 26365),
(41264, 'zhCN', '活泼的诅咒女王鱼', '', '', '', '', '', '', '', '', 26365),
(41242, 'zhCN', '厚切培根', '', '', '', '', '', '', '', '', 26365),
(41239, 'zhCN', '魔皮', '', '', '', '', '', '', '', '', 26365),
(41238, 'zhCN', '钙化虫鳞', '', '', '', '', '', '', '', '', 26365),
(41227, 'zhCN', '突袭守望高塔：科达娜峰', '', '', '', '', '', '', '', '', 26365),
(41225, 'zhCN', '邪能球茎', '', '', '', '', '', '', '', '', 26365),
(41208, 'zhCN', '硫磺毁灭者', '', '', '', '', '', '', '', '', 26365),
(41206, 'zhCN', '产品订单：魔石', '', '', '', '', '', '', '', '', 26365),
(41186, 'zhCN', '至高岭的历史', '在至高岭与莱莎见面。', '让我看看，一……二……三……噢，你好啊，$n。抱歉，我没看到你进来。$b$b这里简直一团乱麻，我真的需要一个助手。$b$b我有件事要麻烦你，有一个叫做莱莎的考古学家同事一直希望有人可以到至高岭去帮她。$b$b我觉得你是这件任务的最佳人选。', '', '', '', '', '', '', 26365),
(41175, 'zhCN', '精灵女王专属', '全力奋战，穿越苏拉玛，进入存放着皇冠的密室。检查皇冠，然后向泰瑟兰汇报你发现的情况。', '夜之子放下了他们的护盾，使我们可以进入他们的城市并探索他们的秘密。$b$b我发现的其中一个秘密和一顶皇冠有关，它拥有难以估量的力量。$b$b我要你去寻找这顶皇冠，然后向我汇报情况。', '', '', '', '', '', '', 26365),
(41174, 'zhCN', '值得一去', '在苏拉玛与泰瑟兰见面。', '$n，如果你是一箱黑色三叶虫的话，你觉得我会把你放在哪里？$b$b<达瑞妮斯开始在店里四下查看。>$b$b噢，我想起一件事。泰瑟兰在找你。他正在苏拉玛进行什么研究，需要你去帮忙。', '', '', '', '', '', '', 26365),
(41168, 'zhCN', '玛凯雷的紫色群山', '找到《玛凯雷的紫色群山》残页，拼成一本书册。完成以后，把书册带回去交给布莱恩。', '现在我们的设备到了，我们又可以开始工作了。$b$b我在这里找到了一件东西，我觉得你应该会感兴趣。这是一张书页，里面记载了阿古斯世界被恶魔摧毁之前的资料。$b$b不管怎么样，以我的经验来说，如果你可以找到某个东西的一部分，那附近肯定还会有其他的部分。$b$b在瓦尔莎拉继续寻找更多的这种书页，然后把它们带回来交给我。带上我找到的这张书页，方便你有个参考。', '', '', '', '', '', '', 26365),
(41158, 'zhCN', '峡湾考古', '在风暴峡湾与布莱恩·铜须见面。', '$n，你在附近看到过我的账本吗？我好像在装填坎努匹克陶罐的时候把它给放到哪里了。$b$b噢，算了。布莱恩·铜须叫你去找他。他正在风暴峡湾继续他的研究。$b$b你快到他那里去吧，顺便帮我捎个话，说我还在等着他发现的那些剥皮编年史呢。', '', '', '', '', '', '', 26365),
(40980, 'zhCN', '疖背瘟疫', '', '', '', '', '', '', '', '', 26365),
(40395, 'zhCN', '时空漫游随机英雄地下城', '', '', '', '', '', '', '', '', 26365),
(40298, 'zhCN', '决斗之夜：加尔维斯顿先生', '', '', '', '', '', '', '', '', 26365),
(40279, 'zhCN', '杜里安的训练', '在宠物战斗中击败杜里安·强果。', '如果你真的获取了伙伴们的信任，那就证明给我看。', '', '', '', '', '', '', 26365),
(39019, 'zhCN', '卡德加的召唤', '在赞加拉的卡德加的法师塔与大法师卡德加谈一谈。', '大法师卡德加已经制定了对抗暗影议会的下一步行动计划。到他的法师塔和他会面吧，就在塔拉多东边的赞加拉沼泽里。', '', '', '', '', '', '在赞加拉的卡德加的法师塔与大法师卡德加谈一谈。', 26365),
(39004, 'zhCN', '黑暗化身', '在地狱火堡垒中追寻并面对古尔丹。', '我们还有最后一项任务要做，$n。我们必须打败古尔丹，为这个世界破解他的阴谋。$b$b我没有什么奖励可以提供给你——我所能给予你的都已经交给你了。$b$b来吧。等你和你的盟友做好准备之后，我们就向地狱火堡垒进军……结束这一切。', '', '', '', '', '', '', 26365),
(38926, 'zhCN', '维护霸权', '在阿什兰的所有事件地点打败部落，并击杀高阶督军沃拉斯。', '正像我们担心的一样，部落打算通过在这座岛上烧杀抢掠巩固他们的位置，和我们担心的一样。去给他们点颜色看看，让他们知道联盟绝不会姑息他们的侵略！', '', '沃拉斯是部落在阿什兰部队的领袖。', '', '', '', '', 26365),
(38287, 'zhCN', '天然兽皮', '', '', '', '', '', '', '', '', 26365),
(38051, 'zhCN', '钢铁前线之战', '', '', '', '', '', '', '', '', 26365),
(38043, 'zhCN', '血环之血', '', '', '', '', '', '', '', '', 26365),
(37968, 'zhCN', '突袭沙纳尔神殿', '突袭塔纳安丛林中沙纳尔神殿的萨格雷军队。', '在塔纳安丛林的丘陵上，萨格雷将一座曾经的神殿变成了召唤恶魔的大本营。\n\n趁他们的仪式还没有完成，我们必须立刻发动攻击。我们耽误得越久，敌人就越强大。', '', '', '', '', '', '', 26365),
(37966, 'zhCN', '突袭沙纳尔神殿', '', '', '', '', '', '', '', '', 26365),
(37868, 'zhCN', '铁人拉力赛！', '跑过起点，先后抵达紫色柱标、绿色柱标和红色柱标，最后返回起点。', '你喜欢这个拉力赛，是吧？我也一样！\n\n比赛分为四个赛段——先后分别抵达紫色柱标、绿色柱标、红色柱标，最后再回到这里。\n\n时间决定着胜负，所以全速前进吧！', '', '', '', '', '', '', 26365),
(37852, 'zhCN', '鲁克玛护符：埃匹希斯装置', '激活埃匹希斯装置并取得鲁克玛护符。', '既然已经激活了所有钥匙，可以使用埃匹希斯装置找到护符了。\n\n鸦人的研究表明，它很可能在失落的安苏鸦巢——“乌鸦之神的祭坛内”。', '', '', '', '', '', '', 26365),
(37851, 'zhCN', '鲁克玛护符：最后一把钥匙', '找到并激活埃匹希斯装置的最后一把钥匙。', '必须找到最后一把钥匙才能使用埃匹希斯装置。关于钥匙下落的文字如下：\n\n“最后一把钥匙藏在河流最终飞流直下的真菌丛生的洞穴深处。虽然盘踞在那里的白鬼兽人很邪恶，但他们会是很好的威慑。”', '', '', '', '', '', '', 26365),
(37850, 'zhCN', '鲁克玛护符：第二把钥匙', '找到并激活埃匹希斯装置的第二把钥匙。', '第一把钥匙已经激活了，还剩两把。关于第二把钥匙的位置，在流亡者的古代文稿中是这样记述的：\n\n“在伟大的斯克提斯河的第三座瀑布下，躺着第二把钥匙。愿奔流不息的河水冲走那些企图染指它的人。”', '', '', '', '', '', '', 26365),
(37849, 'zhCN', '鲁克玛护符：第一把钥匙', '找到并激活埃匹希斯装置的第一把钥匙。', '鸦人的研究指向了三把“钥匙”，必须激活它们才能使用埃匹希斯装置。第一把钥匙在斯克提斯。相关文字如下：\n\n“第一把钥匙收藏在上斯克提斯的高处。在那里，亡者能保护它不被敌人攫取。”', '', '', '', '', '', '', 26365),
(37848, 'zhCN', '寻宝合同：鲁克玛护符', '在上斯克提斯里寻找鸦人关于鲁克玛护符的研究成果。', '看来鲁克玛的信徒偶然发现了一些关于某个古老护符的情报，据说那护符带有他们神灵的力量，并能将这股力量传递到佩戴者身上。我们决不能让那些家伙找到它。\n\n前往斯克提斯，看看他们都知道些什么。但愿我们能抢先一步。', '', '', '', '', '', '', 26365),
(37814, 'zhCN', '戈图尔必须死！', '在阿兰卡峰林的血鬃领地里消灭戈图尔。', '我们听说在阿兰卡峰林里出现了一种邪恶无比的巫术，指挥官。$B$B就在虎人鬼魂攻击我们的补给车队和鸦人盟友的消息出现时，碎手氏族的萨满祭司戈图尔也开始在峰林里出没了。$B$B我想最好还是不要抱有侥幸心理。你应该去亲自解决掉那个萨满祭司，别让局面变得无法控制。', '', '', '戈图尔', '', '', '', 26365),
(37813, 'zhCN', '艾默松必须死！', '从塔拉多库洛的领地上方的艾默松身上取得一根嗡鸣的德拉诺晶刺。', '你在塔拉多岗哨的工头格罗巴什认为自己已经找到了近来地震活动频发的原因。$B$B在库洛的领地上方的洞穴里有个名叫艾默松的大地之怒，浑身上下覆满了这些力量强大的水晶。水晶轰鸣着巨响，应该就是这声响把那大地之怒给弄疯了！$B$B我们想找块样本，看看能不能研究出那些水晶怎么会有如此强大的力量。要是有其他合适的人选，我是不会麻烦你去做的，指挥官。', '', '', '艾默松', '', '', '', 26365),
(37811, 'zhCN', '古特里克的杀生刀：灵魂熔炉', '在震地峡谷里找到灵魂熔炉，并重铸古特里克的杀生刀。', '有了这些部件，现在只要重铸古特里克的杀生刀就行了。金铲在日记里暗示说，只有在它当时被拆解的地方才能将它重铸。\n\n日记提到了一个用来拆解这把利刃的“灵魂熔炉”，可能就在附近峡谷里的某个地方。找到熔炉，用它将你收集到的所有部件拼合起来。', '', '', '', '', '', '', 26365),
(37799, 'zhCN', '古特里克的杀生刀：最后一个部件', '根据日记留下的线索找到古特里克的刀刃。', '只剩下一个部件了。日记写道：\n\n“最后一部分，古特里克的刀刃，被放在了永远俯视鲜血竞技场的荣耀圣地。我好像没有发现有这么一个地方，但据说那是一个能看清所有战斗的位置。”', '', '', '', '', '', '', 26365),
(37798, 'zhCN', '古特里克的杀生刀：第二个部件', '根据日记留下的线索找到古特里克的刀柄。', '你还在继续寻找着古特里克的杀生刀的剩余部件。日记写道：\n\n“刀柄被埋在沼泽里，就是那里的毒蛇夺走了古特里克的性命。刀柄被一块螺旋状的岩石压着，它能困住古特里克的灵魂。”', '', '', '', '', '', '', 26365),
(37797, 'zhCN', '古特里克的杀生刀：第一个部件', '根据日记留下的线索找到古特里克的柄头。', '日记写明了古特里克的杀生刀部件的位置。记述如下：\n\n“柄头被带去了破碎悬崖，放在古特里克干掉的第一个对手的头骨里。那似乎是某种巨兽，他在巨大的兽骨深坑中搏杀了它。”', '', '', '', '', '', '', 26365),
(37792, 'zhCN', '影月墓地', '在影月墓地中击败耐奥祖。', '耐奥祖本不是邪恶的人——他原来是影月氏族睿智的酋长和萨满长者。因为急于加入钢铁部落，他抛弃了长久以来的所有信念，扭曲先祖的灵魂以换取黑暗的禁忌之力……只为取悦地狱咆哮。$B$B影月氏族已经堕落了，指挥官。进入他们先祖的墓地，终结耐奥祖的疯狂行径，别让他把整个德拉诺全都送进吞噬一切的虚空巨口里。', '', '', '耐奥祖', '', '', '', 26365),
(37790, 'zhCN', '永茂林地', '在永茂林地里击败雅努。', '肯瑞托在戈尔隆德建造了一处哨站，那里有通往暴风城的传送门，这本是为了能在攻打黑石铸造厂时快速补充援军。可惜他们将它建造在了永茂林地的中心地带，那里是木精和最强大原祖荆兽——雅努的家园。$B$B如今哨站已经被攻陷，过不了多久，那些蔓生植物就会侵入暴风城……继而吞噬整个艾泽拉斯。', '', '', '雅努', '', '', '', 26365),
(37786, 'zhCN', '永茂林地', '在永茂林地里击败雅努。', '肯瑞托在戈尔隆德建造了一处哨站，那里有通往暴风城的传送门，这本是为了能在攻打黑石铸造厂时快速补充援军。可他们凭借着“无穷”的智慧，将它建造在了永茂林地的中心地带，那里是木精和最强大原祖荆兽——雅努的家园。$B$B如今哨站已经被攻陷，过不了多久，那些蔓生植物就会侵入暴风城……继而吞噬整个艾泽拉斯。', '', '', '雅努', '', '', '', 26365),
(37778, 'zhCN', '领巢者伊里克斯必须死！', '从霜火岭南风崖的领巢者伊里克斯身上取得碎冰甲壳。', '我们想出了一个激进的新法子，试着把寒冰掠食者的甲壳用到护甲和武器的淬火工艺中来。这可算得上是我们一直孜孜以求的开拓性新技术啊，指挥官！$B$B唯一的问题在于，掠食者显然很不愿意任由我们把它们身上的甲壳给剥下来。在霜火岭的南风崖有个特别的掠食者，名叫领巢者伊里克斯，如果你能得手的话，那它身上的甲壳足够我们用上个把月了！', '', '', '领巢者伊里克斯', '', '', '', 26365),
(37774, 'zhCN', '戈图尔必须死！', '在阿兰卡峰林的血鬃领地里消灭戈图尔。', '刃牙虎人鬼魂大军。我可不是要拖你后腿，指挥官，可如果我们不尽快采取行动的话，它们可真要攻过来了。$B$B就在刃牙虎人鬼魂突袭我们的补给车队的报告刚出现时，有人在阿兰卡峰林的血鬃领地里发现了碎手萨满戈图尔。$B$B我可不想冒任何险，指挥官。我想你应该亲自去那儿调查一下，在事态恶化前抢先阻止它。', '', '', '戈图尔', '', '', '', 26365),
(37773, 'zhCN', '艾默松必须死！', '从塔拉多库洛的领地上方的艾默松身上取得一根嗡鸣的德拉诺晶刺。', '你在塔拉多岗哨中的监工艾克索斯认为自己已经找到了近来地震活动频发的原因。$B$B听着，在库洛的领地上方的洞穴里有个巨大的，啊……我想他们管它叫“大地之怒”，浑身上下覆满了这些力量强大的水晶。水晶共鸣时发出巨响，我们认为应该就是这声响把那大地之怒给弄疯了！$B$B问题是，没人有本事干掉那家伙，好让我们弄块样本仔细检查一番。你能帮我们一把吗，指挥官？', '', '', '艾默松', '', '', '', 26365),
(37102, 'zhCN', '塔布羊训练：铁钻', '骑着你的训练中的塔布羊去击败铁钻。', '你解决掉了陆地和天空的敌人，甚至还有雷雨。接下来你将面对你脚底下的动物。$B$B岩虫是一种狡猾的捕食者，它们喜欢从沙土底下钻出来袭击敌人。在纳格兰，很多野兽都学会了注意脚底下的动静。带你的座狼去那边的沙滩，尝试干掉那里的老岩虫：铁钻。', '', '', '', '', '', '', 26365),
(37068, 'zhCN', '雷象训练：兽人猎手', '骑着你的训练中的草地践踏者去击败狩猎大师卡拉克。', '纳格兰的战歌氏族可跻身德拉诺最优秀的猎人的行列，他们的狩猎者可以帮我们为这批坐骑提供试炼。$B$B你能在纳格兰找到一位名叫狩猎大师卡拉克的兽人，死在他手上的凶残动物的数量是他们整个氏族里最多的。骑上你的坐骑去干掉他，为那些被杀害的动物报仇。', '', '', '', '', '', '', 26365),
(37039, 'zhCN', '野猪训练：铁钻', '骑着你的训练中的石牙野猪去击败铁钻。', '你解决掉了陆地和天空的敌人，甚至还有雷雨。接下来你将面对你脚底下的动物。$B$B岩虫是一种狡猾的捕食者，它们喜欢从沙土底下钻出来袭击敌人。在纳格兰，很多野兽都学会了注意脚底下的动静。带你的座狼去那边的沙滩，尝试干掉那里的老岩虫：铁钻。', '', '', '', '', '', '', 26365),
(37026, 'zhCN', '座狼训练：铁钻', '骑着你的训练中的啸狼去击败铁钻。', '很好，我们解决掉了陆地和天空的敌人，甚至还有雷雨。接下来试试你脚底下的动物如何？答案即将揭晓！$B$B岩虫是一种狡猾的捕食者，它们喜欢从沙土底下钻出来袭击敌人。在纳格兰，很多野兽都学会了注意脚底下的动静。骑上你的座狼去那边的沙滩试试，看看你们能不能干掉那里最古老的一只岩虫：铁钻。', '', '', '', '', '', '', 26365),
(37023, 'zhCN', '座狼训练：暗翼大鹏', '骑着你的训练中的啸狼去击败暗翼大鹏。', '纳格兰的风鹏是一种非常聪明的捕食者，它们经常成群结队地突袭猎物。要是你的坐骑不时刻注意着天空的话，就可得跟它这双眼睛说再见了。$B$B去纳格兰干掉那里最凶猛的风鹏——暗翼大鹏。这对你们俩来说都是个试炼。', '', '', '', '', '', '', 26365),
(37004, 'zhCN', '野猪训练：铁颚狼', '骑着你的训练中的石牙野猪去击败残爪。', '指挥官，我还有最后一项挑战要给你，这次可没那么简单。$B$B在德拉诺有一种狼，他们的皮肤像夜晚一样漆黑，他们体型比一般的狼要大上一倍，人们称他们为铁颚狼。它们转眼间就能把一个大活人撕成两半，任何脑子正常的动物遇到它们都会吓得腿软。$B$B有一头孤独的铁颚狼离开了它们世代居住的霜火岭跑到了纳格兰定居。骑上你的野猪去干掉它，如果你们两个能够生还，你的野猪才能成为一头真正的战兽。', '', '', '', '', '', '', 26365),
(36749, 'zhCN', '古朴的元素风箱', '将神器进行展览。', '这件古物已经被修复得美轮美奂，放在你的要塞里展示再合适不过了。', '', '', '', '', '', '', 26365),
(36699, 'zhCN', '突袭沙塔斯市中心', '突袭塔拉多沙塔斯城的萨格雷军队。', '沙塔斯城中的萨格雷军力每天都在增强，而且变得越来越大胆。我们决不能再对他们的威胁置之不理了。\n\n如果你想到城市深处去对抗萨格雷的话，记得叫上几个同伴。', '', '', '', '', '', '', 26365),
(36681, 'zhCN', '突袭失落的安苏鸦巢', '攻击阿兰卡峰林失落的安苏鸦巢附近的敌对生物。', '我们有一些最出色的斥候，在失落的安苏鸦巢遗迹附近失踪了。\n\n伯德里克·格雷要求派遣任何可用的人手去查明威胁，并看看遗迹间还有没有我们的幸存者。', '', '', '', '', '', '', 26365),
(36491, 'zhCN', '突袭命运之柱', '', '', '', '', '', '', '', '', 26365),
(36296, 'zhCN', '长青的菲拉克', '接受剑圣纳什拉的血誓。', '[PHYLARCH ACQUISITION TEXT GOES HERE]', '', '作为一名新晋的剑圣，纳什拉无疑是一位强大的战士和武器大师。', '剑圣纳什拉', '', '', '', 26365),
(36290, 'zhCN', '杀出暗影', '到你的要塞与洛坎谈一谈。', '恭喜你，鲜血勇士。我从没见过像你这么骁勇善战的人。$B$B当你在竞技场里对决时，你有位兄弟跑来捎话给你，让你回基地一趟。他说自己叫伯德里克·格雷。', '', '', '', '', '', '', 26365),
(36162, 'zhCN', '被偷走的高格里克之心', '消灭阿祖卡·刃怒。', '别让阿祖卡把高格里克之心抢走，指挥官。别让她得逞。', '', '', '', '', '', '', 26365),
(36161, 'zhCN', '硝烟弥漫之处……', '消灭拉格斯勒·响刃、阿卡萨·炽焰和召火者德雷克。', '火刃刺客渗透进了要塞。决不能让高格里克之心落在他们手里，指挥官。', '', '', '', '', '', '', 26365),
(35993, 'zhCN', '追踪塔隆戈尔', '从奥金顿的塔隆戈尔身上取得塔隆戈尔的腐蚀之血[仅限英雄模式]。', '我刚刚从大主教玛拉达尔那里收到一条坏消息，但也许对我们有用。暗影议会的间谍们渗入了奥金顿！我敢担保，幕后主使一定是古尔丹的爪牙——很有可能就是他身边的得力助手塔隆戈尔。$b$b让我们把他从棋盘上抹除吧，$n。去除掉塔隆戈尔！$b$b给我带一瓶他的腐化之血来，我要用它追踪其他的暗影议会好事者……包括古尔丹本人。我要让我们的猎物找不到藏身之地。', '', '', '', '', '', '', 26365),
(35888, 'zhCN', '玛拉顿（所有首领）奖励任务', '', '', '', '', '', '', '', '', 26365),
(35841, 'zhCN', '消灭兽群领袖', '消灭兽群领袖沃戈什', '莫高尔岗哨的所有行动都被交托给了一名人称兽群领袖沃戈什的强大战士。$B$B假如我们能除掉这名凶残的领袖，就能短暂地中断他们的情报联络。$B$B沃戈什在东北边的院子里巡逻。$B$B干掉他。', '', '', '兽群领袖沃戈什', '', '', '', 26365),
(35840, 'zhCN', '拦截指令', '找到霜火岭任务指令、影月谷任务指令和阿兰卡峰林任务指令。', '情报是重中之重，朋友。我们对地狱咆哮的计划了解得越多，想要击败他们就会更加容易。$B$B那些莫高尔兽人总是充当地狱咆哮的信使，将他下达的任务指令从这里传送到德拉诺的各个哨站。$B$B去干掉这些骑兵，然后把你找到的任务指令全都带回来。', '', '', '', '', '', '', 26365),
(35839, 'zhCN', '战斗计划', '找到高格里克的缩放模型、小型战争机器和塔纳安丛林地图。', '我设法拿到了珍妮的笔记本。她提到在附近的建筑中有几样关键物品需要调查，但还没写清楚就死去了。$B$B我们至少能跟着她留下的线索，继续调查下去。$B$B在营地里搜索情报。我会负责引开兽人的注意力。', '', '', '', '', '', '', 26365),
(35449, 'zhCN', '乌特加德之巅奖励任务', '', '', '', '', '', '', '', '', 26365),
(35316, 'zhCN', '残阳关奖励任务', '', '', '', '', '', '', '', '', 26365),
(35315, 'zhCN', '残阳关奖励任务', '', '', '', '', '', '', '', '', 26365),
(35312, 'zhCN', '围攻砮皂寺奖励任务', '', '', '', '', '', '', '', '', 26365),
(35311, 'zhCN', '指挥官斯普林瓦尔奖励任务', '', '', '', '', '', '', '', '', 26365),
(35309, 'zhCN', '影牙城堡奖励任务', '', '', '', '', '', '', '', '', 26365),
(34953, 'zhCN', '火刃之血', '在哈瓦洛消灭$1oa名火刃兽人。', '哈瓦洛是我们火刃氏族古老的家园。自从新督军一家上位以后，我就因为混血儿的身份被逐出了氏族。$B$B我要寻求公正的待遇。$B$B我想你应该不介意为此杀戮，再说你也没有其它选择。', '', '', '', '', '', '', 26365),
(32854, 'zhCN', '陈旧的眼罩', '前往你所在阵营的搏击俱乐部，把陈旧的眼罩交给那里的某个人。', '一块依据人类头型剪裁的布。这块布显得朴素简洁，只在最下边有个小标签，上面写着：$b$b归还搏击俱乐部', '', '', '', '', '', '', 26365),
(32843, 'zhCN', '锋齿', '购买锋齿的挑战卡牌，并在搏击俱乐部里向他发起挑战。', '你今天赢得的挑战卡牌属于南海最危险的生物之一：锋齿。只要被他的利齿咬到一口，你就会变得血肉模糊、内脏横流。$b$b祝你玩得开心！', '', '', '', '', '', '', 26365),
(32712, 'zhCN', '邪恶的曹卓', '击败曹卓。', '从远处传来电流的轰鸣声，撩拨你的听觉神经，神经冲动袭遍了你的整根脊椎。随着你越发靠近前方的那道门，你感到手指僵硬，心跳加快。$b$b曹卓傲慢地站在你面前的台阶上，指尖有闪电在涌动，神经质般地对着你假笑。', '', '径直凝视曹卓眼中的闪电，令你感到眼睛刺痛。', '', '', '', '', 26365),
(32710, 'zhCN', '酝酿中的腐化', '找到并消灭感染者弗赖什鲁克。', '你留意到有一股异常难闻的恶臭在头顶上方弥漫开来。随着这股浓郁的臭气钻入鼻孔，你感到五脏六腑都在翻腾。$b$b你熟悉这股气味，是从蜥蜴人身上发出来的。腐烂废弃的蜥蜴人肉块与下水道的肮脏秽物混在了一起。', '', '弗赖什鲁克在远处怪笑并呻吟着。', '', '', '', '', 26365),
(32692, 'zhCN', '古朴的花粉采集器', '将神器进行展览。', '这件遗物的恢复状况极为良好。或许你该把它放在闻道之座进行展览，好让那些游学者和考古学家们进行研究。', '', '', '', '', '', '', 26365),
(32639, 'zhCN', '解体', '在寻晨者海角外摧毁3个夺日者构造体。', '据斥候回报，有大批构造体在寻晨者海角外面巡逻。$b$b如果不加抑制，一旦夺日者发起攻击，这些构造体会对我们形成重大威胁。$b$b唯一的办法就是先发制人。我们要在夺日者发起攻击之前摧毁它们！', '', '', '', '', '', '', 26365),
(32635, 'zhCN', '终止爆炸！', '在紫罗兰高地卸除联盟舰船、构造体仪式和补给品附近的战术魔法炸弹。', '夺日者在我们的营地四周布满了战术魔法炸弹。必须在这些炸弹爆破前将其卸除。$b$b在重要区域搜寻这些炸弹，比如我们的补给品附近。一定要找到并把它们全都卸除。我们决不能再失去任何阵地了。', '', '', '', '', '', '', 26365),
(32633, 'zhCN', '魔法束缚', '从寻晨者海角找回罗曼斯的咒术之书。', '大法师罗曼斯手里有件令我向往的东西。$b$b他随身带着一本非常强大的书卷。要是能把它从夺日者手中抢过来，就会对我们大有益处。$b$b找到罗曼斯的咒术之书，把它交给我。', '', '', '', '', '', '', 26365),
(32631, 'zhCN', '高度评价', '', '', '', '', '', '', '', '', 26365),
(32558, 'zhCN', '不得外传', '从征服者平台的缚灵者图切克和魔术士拉古尔处夺取黑暗秘法面具和唤魂者面具。\n', '缚灵者图切克和魔术士拉古尔这两兄弟看守着征服者平台。他们会使用强大的魔法，绝对不容小觑。$b$b他们的力量似乎是来源于他们的面具，那是代代相传的圣物。每位拥有者在将面具传世之前，都会将自己的法力灌注在面具上。$b$b我们必须解决掉这两兄弟，然后摧毁面具，以免让其落入恶人手中。', '', '', '', '', '', '', 26365),
(32548, 'zhCN', '任其腐烂', '摧毁3堆恶臭肉堆。', '邪刃蜥蜴人并不会将他们打到的肉全吃光。他们会将大部分的肉堆在房子附近，任由其腐烂，以吸引害虫并散播病毒。$b$b我们不能让蜥蜴人将病毒散播到伊瓜鲁克峭壁以外的地方。快去处理掉那些剩余的肉类吧。', '', '', '', '', '', '', 26365),
(32545, 'zhCN', '伊瓜鲁克的住民', '击败1个邪刃蛮兵、1个邪刃蜥首牧师和1个邪刃海龙战士。', '邪刃部族威胁到了我们的人，可报之以毫不留情的消灭未免也太反应过度了。$b$b去干掉他们的部族首领或许是更加理性的回应方式。这样不仅能少一些流血冲突，也可以让他们尊重我们划下的边界。', '', '', '', '', '', '', 26365),
(32541, 'zhCN', '防患未然', '在$1oa只啸天雏龙身边奔跑以惊吓它们。', '一想到这些可怜的啸天龙在被巨魔训练成战争工具的过程中需要遭受何种折磨，我就感到无比难过。\n\n雏龙相当胆小，只要你一靠近就会吓得飞走。拜托了，在赞达拉巨魔腐化它们之前，把它们吓走吧。', '', '', '', '', '', '', 26365),
(32532, 'zhCN', '别再回来了！', '击败15个复生的先祖。', '你看见那些在坟场中徘徊的鬼魂了吗？$B$B他们是复生的先祖，是被重新召唤到这个世界上来的，魔古族死者的灵魂。$B$B当被激怒时，他们会迅捷无声地发起攻击，他们的数量也在日增夜长。$B$B他们不属于这里。去消灭他们，把他们送回坟墓里去。', '', '', '', '', '', '', 26365),
(32526, 'zhCN', '失魂者', '解救6名银色盟约斥候或夺日者斥候。', '我们攻击了白骨庭院的魔古族，可恐怕只是在给他们那邪恶的仪式输送牺牲品而已。$B$B魔古族不仅会消灭他们的俘虏，还会偷走他们的灵魂，将其注入石头里，图谋不轨，或者将牺牲者铸成幽魂战争武器。$B$B联盟也好，部落也罢，身份并不重要。我们决不能让魔古族扩充军力。$B$B快到墓穴去，救出所有一息尚存的俘虏。', '', '', '', '', '', '', 26365),
(32521, 'zhCN', '渗透力量', '消灭赞达拉战争首领奴卡拉。', '我的探子们在北部海滩上发现了一支赞达拉作战小队。我需要有人解决掉他们。你能完成这项任务吗？', '', '', '', '', '', '', 26365),
(32517, 'zhCN', '征服岩石', '阻止在白骨庭院主殿中举行的古代岩石征服者仪式。', '在白骨庭院中，雷电之王麾下的巫师们正在举行黑暗的仪式。$B$B为扩充军力，山泽夺魂者们将从生者身上偷取的灵魂，注入古老的石头雕像里。$B$B当这些岩石征服者被赋予生命后，他们就会成为战场上可怕的敌手。$B$B我们必须在这些雕像被复活前，阻止他们的仪式。', '', '', '', '', '', '', 26365),
(32489, 'zhCN', '伊瓜鲁克的恐怖地毯', '踩死75只伊瓜鲁克蟑螂。', '啊，蟑螂！我曾在幽暗城买过一只宠物蟑螂。$b$b蟑螂会像海绵一样吸收病菌，然后将它们散播到自己所经之处。而它们的活动范围偏偏又很广。$b$b伊瓜鲁克峭壁上爬满了这种东西，将邪刃部族的秽物传播到岛上的每一个角落。当你去那里时，记得尽可能多踩死几只蟑螂。', '', '', '', '', '', '', 26365),
(32485, 'zhCN', '加强防御', '在紫罗兰高地附近强化6个肯瑞托监视结界。', '这座岛屿十分危险，$n。我们要提防来自赞达拉巨魔、魔古族、蜥蜴人的攻击，最要命的是，还有夺日者。$b$b我在我们营地外围布满了监视结界，以提供额外保护。在当前状态下，它们只会对一名攻击者造成伤害，可我已经厌倦警告了！$b$b在你的帮助下，我们可以强化这些结界，把它们变成更具致命杀伤力的防御系统。', '', '', '', '', '', '', 26365),
(32471, 'zhCN', '灯光，镜头，开拍', '在奥格瑞玛内的位置收集一个铁盒子和一条赤色腰带，并从一名工程师处获得一个普通瞄准镜。', '看来你对视觉艺术的眼光还不错，想试试亲手拍照吗？\n\n我可以给你制作一个自拍神器，但我需要几个配件。\n\n带子的话，去附近的护甲商人那里给我找条赤色腰带就好。\n\n我多订了一单外壳，放在了奥格瑞玛后门，你路过时可以顺路给我拿一个。\n\n哦，还有一个普通瞄准镜，只要是工程师应该就会做的。\n\n行动起来吧，小鬼。艺术的巅峰在向你招手！', '', '', '', '', '', '', 26365),
(32470, 'zhCN', '灯光，镜头，开拍', '在暴风城内的位置收集一个铁盒子和一条赤色腰带，并从一名工程师处获得一个普通瞄准镜。', '哦，嗨！这张照片是不是棒极了？我真喜欢我的自拍神器！\n\n你想让我给你也做一个，是吧？我只要几个配件就行！\n\n带子的话，我需要暴风城的护甲商人出售的赤色腰带。\n\n外壳的话，我已经下好单了，你可以直接去拿，只要查到我的货送到哪儿了就好！\n\n哦，还要一个普通瞄准镜，基本上只要是工程师就会做。\n\n那么，你的姿势摆好了吗？！', '', '', '', '', '', '', 26365),
(32469, 'zhCN', '澄澈水晶', '从荆棘谷的尤亚姆巴岛的水晶之脊主母身上收集一个原生水晶碎片。', '又见面了！哦，我忘了告诉你！我设计了简单好用的方法，可以强化你的自拍神器！\n\n只要有合适的宝石，我就可以做出一种万能镜头！\n\n有些探险者同行告诉我说，荆棘谷的尤亚姆巴岛上有只大蜥蜴。她的外皮上满是高级水晶！真是个美丽的巧合！\n\n但她非常，非常厉害！你最好带几个朋友一起去！', '', '', '', '', '', '', 26365),
(32468, 'zhCN', '澄澈水晶', '从荆棘谷的尤亚姆巴岛的水晶之脊主母身上收集一个原生水晶碎片。', '如果你有兴趣的话，有个办法可以强化你的自拍神器。只要拿到合适的聚焦透镜，我就可以给那玩意添加很多功能。\n\n我听说，有人在荆棘谷的尤亚姆巴岛上看到了蜥蜴之母。她的外皮上点缀着许多宝石，是做透镜的完美材料。你只要把宝石交给我，其他就包在我身上。\n\n但她可没那么容易对付，你最好带上几个朋友。', '', '', '', '', '', '', 26365),
(32460, 'zhCN', '追捕窃贼', '帮助吉安娜找出是谁夺走了圣钟，并把它藏在哪里。你可以去找雄狮港的谢默斯·金足，传送去达纳苏斯。', '我们一定要彻查此事。\n\n$n，你跟我来。如果有必要的话，即使搜遍这座城市的每一个角落，我们也要找出他们窃取圣钟的手段……和地点。\n\n我在这里追踪到了魔法的踪迹……我们得跟着线索走！', '', '', '', '', '', '', 26365),
(32451, 'zhCN', '明确的信息', '去卡桑琅丛林的天火号找空军上将罗杰斯。', '是时候让那些部落杂碎看看联盟的实力了！今天我们要将战火烧到他们家门口。$b$b去天火号上找空军上将罗杰斯，她会给你下达进一步的指令。$b$b祝你好运，$c。让联盟为你骄傲吧！', '', '', '', '', '', '', 26365),
(32448, 'zhCN', '旧日的羁绊', '获得瓦拉图的灵魂精华。', '我在锦绣谷时，得到了一份酿造溯源酒的熊猫人古方。我相信这种酒能帮我们从单简那里挖出有用信息。$B$B这里离不开我，所以我只能请你帮我去收集材料了。我们需要一个与我们想看的记忆处在同时代的魔古族灵魂精华。$B$B你可以在东北边的征服者之路找到这样的幽灵。', '', '', '', '', '', '', 26365),
(32423, 'zhCN', '有所必为', '去找温蕾萨·风行者交谈以前往雄狮港，到那以后与瓦里安·乌瑞恩国王谈一谈。', '感谢你今天的帮助，$n。从现在起，整肃工作就由我来负责了。$b$b吉安娜很快就会去雄狮港与瓦里安会谈。她希望你也能在场。', '', '', '', '', '', '', 26365),
(32416, 'zhCN', '吉安娜的决意', '使用传送门从达纳苏斯前往达拉然，然后与另一边的温蕾萨·风行者谈一谈。', '长久以来，我一直在努力修补联盟和部落间的关系。我一次又一次的假定部落是无辜的——可他们却一次又一次的在背后捅我刀子。$b$b我绝不容忍又一次的背叛！如果部落想要将肯瑞托变成对付联盟的武器，那达拉然将不再有他们的位置。$b$b跟我来，$n。', '', '', '', '', '', '', 26365),
(32372, 'zhCN', '反制', '击败10名库卡隆监督者、5名库卡隆征服者和征服者古尔塔。', '库卡隆是酋长麾下最精锐、最忠诚的战士。他们的出现就说明加尔鲁什也害怕会爆发起义。$b$b沃金和他的人民和兽人一样，也是部落的一员。$b$b我们必须赶走占领军，解放巨魔。虽然这让我很心痛，但你必须消灭足够多的库卡隆，好让巨魔夺回他们的城市。然后请到暗矛要塞来找我，我们要直接挑战他们的长官。', '', '', '', '', '', '', 26365),
(32368, 'zhCN', '溯源酒', '喝下溯源酒，查看单简的过去。', '药剂完成了。现在，喝下它。', '', '', '', '', '', '', 26365),
(32352, 'zhCN', '山雨欲来', '对抗6名染煞蛮兵。', '既然纳兹戈林将军派你过来，那我相信你一定有足够的判断能力。$B$B在我抵达这里之后，我发现加尔鲁什正在……试验……他在北边山区里发现的某种古代力量。$B$B他相信这种“煞”能够强化我们的士兵。$B$B不幸的是，目前为止我们得到的结论完全相反。$B$B我们的部队纷纷呈现出难以控制的暴力倾向。我要你去问问他们的情况。如果他们威胁你，你要做好防卫的准备。', '', '', '', '', '', '', 26365),
(32351, 'zhCN', '雷霆的回响', '去双月殿找大酋长贝恩·血蹄。可以与统御岗哨的泰克泰克谈一谈，让他送你一程。', '啊，$n，我们又见面了。我听说了一些好消息。$B$B牛头人的大酋长贝恩·血蹄已经抵达了潘达利亚。$B$B他现在正在锦绣谷的双月殿会见加尔鲁什·地狱咆哮酋长和洛瑟玛·塞隆摄政王。$B$B他向我提出了一个古怪的要求——要我派一名部落的忠实勇士给他，不仅要能战斗……还要有足够的判断能力。$B$B我想不出比你更合适的人选了。如果你有需要，可以让泰克泰克送你一程。', '', '', '', '', '', '', 26365),
(32348, 'zhCN', '踢飞他们', '击败12个雄狮港的军事单位。', '联盟的作战基地离废墟很近，他们肯定以为自己已经稳操胜券了。\n\n我们一定要打消他们的这种念头。去干掉几个联盟守卫吧。', '', '', '', '', '', '', 26365),
(32342, 'zhCN', '灵魂陷阱', '收集3个灵魂陷阱。', '我们在废墟里找到了一些强大的魔古神器。它们能够禁锢灵魂，可能是用来进行某些仪式或施展某些法术用的。\n\n我们对这种装置还不了解，亟待研究——它们或许能揭开更多魔古缚魂术的奥秘。\n\n快去帮我带些样品回来，这样我们的研究才能继续下去。', '', '', '', '', '', '', 26365),
(32320, 'zhCN', '部落即家庭', '护送萨尔前往回音群岛。', '这块炉石是我和沃金在很久以前一次谈话中的一部分。$b$b他认为他的人民正处于危险之中。虽然我不知道在我离开的这段时间究竟出了什么事情，但至少这件事我是能为朋友做的。$b$b来吧，$p，跟我去回音群岛。我们必须确保暗矛部族的安全。', '', '', '', '', '', '', 26365),
(32318, 'zhCN', '争分夺秒', '收集10根坚韧松针。', '要不是身为巨魔，沃金恐怕早已死透了。他的再生能力十分惊人，可这种能力被某种毒药抑制住了。$b$b我们得清除毒素，才能让他的伤口愈合。$b$b快飞去南边，在秘密鹰巢的高峰之后有一群松针林精。把他们身上最硬的松针带回来给我。$b$b有了它们，我就可以试着用针灸疗法来驱散他体内的毒素，并加快再生速度。', '', '', '', '', '', '', 26365),
(32305, 'zhCN', '超强能量', '在紫罗兰高地附近摧毁7个法力焦镜。', '肯瑞托正在用法力焦镜来强化自己的军队。我们决不能让他们继续下去。$b$b你会发现这些焦镜散落在紫罗兰高地的外围各处。用这块法力水晶摧毁尽可能多的焦镜。$b$b每摧毁一个法力焦镜，都意味着我方又取得了一次小小的胜利。', '', '', '', '', '', '', 26365),
(32302, 'zhCN', '解体', '在紫罗兰高地附近摧毁3个肯瑞托构造体。', '肯瑞托构造体充其量不过是原始未开化的玩意儿。可不管怎么说，还是有一定威胁的。$b$b前往紫罗兰高地，卸除吉安娜那不成气候的战争机器。让肯瑞托瞧瞧，他们是多么的不堪一击！$b$b这个信息一定会让肯瑞托阵脚大乱。', '', '', '', '', '', '', 26365),
(32288, 'zhCN', '加强防御', '强化6个夺日者监视结界。', '在这座岛屿上潜伏着各式各样的危险。从四面八方都有威胁在逼近。我们必须不惜一切代价守住这片海滩。$b$b在寻晨者海角周围到处都是监视结界。它们在默认状态下会造成伤害，但却缺乏致命的攻击力。$b$b现在可不是心慈手软的时候，$r。必须要让监视结界具备毁灭性的杀伤力！$b$b去强化我们营地附近的监视结界吧。', '', '', '', '', '', '', 26365),
(32287, 'zhCN', '高塔下的强敌', '在阴惨泥沼消灭7个山泽魔古。', '魔古族正在阴惨泥沼的高塔附近集结雕像大军。洛瑟玛下令将他们全部消灭。我想你正好是执行这项任务的合适人选。', '', '', '', '', '', '', 26365),
(32268, 'zhCN', '战术魔法炸弹', '在联盟舰船、联盟补给品和构造体仪式上放置战术魔法炸弹。', '啊，$p，你正是我要找的$r。我又得到了一批战术魔法炸弹，需要将它们安放在位于东南边紫罗兰高地对面的关键位置。$b$b这些就交给你了。我不放心让我们的常规步兵接触如此强力的军火。噢……切勿在任何时候摇晃它们。$b$b在其中一艘肯瑞托舰船上安放一枚，在他们的补给品附近安放一枚，最后再在他们正在建造的构造体上安放一枚。', '', '', '', '', '', '', 26365),
(32266, 'zhCN', '法力展现', '击败9名肯瑞托嗜魔者。', '嗜魔者是令人讨厌的生物。体型小巧，很容易让敌人放松警惕，但对我们的施法者来说却是致命的对手。肯瑞托使紫罗兰高地各处都爬满了这种害虫。$b$b我们必须小心应对。落单的嗜魔者很好对付，可要是一大群嗜魔者聚在一起就另当别论了。$b$b前往紫罗兰高地，削减它们的数量。', '', '', '', '', '', '', 26365),
(32264, 'zhCN', '魔法束缚', '从紫罗兰高地取回吉安娜的褪色法术书。', '吉安娜手里有不少强大的魔法神器。她一直把这些东西带在身边，从来不曾让它们远离自己的视线。我对其中一样东西很感兴趣。$b$b那是一本充满知识的书册，在大法师间流传已久。而我却只瞥过几眼而已。$b$b既然我们现在各自为战，从她手里把书卷夺过来也没什么不应该的。', '', '', '', '', '', '', 26365),
(32262, 'zhCN', '不情愿的观众', '在紫罗兰高地附近解救5名夺日者俘虏。', '肯瑞托实在太过分了！他们现在竟把我们的夺日者同伴当成了战俘！$b$b不必商讨什么交换俘虏的事。我们会自己解决这个问题。$b$b前往紫罗兰高地，释放尽可能多的囚犯。你可千万别被抓了。我们不能连你也失去了。', '', '', '', '', '', '', 26365),
(32252, 'zhCN', '神灵先驱', '消灭2位神灵先驱。', '你听说过神灵吗？虽然我们一知半解，但那似乎是一种涉及感知力的黑暗魔法。\n\n我们不知道神灵驾驭着何种力量，可我必须派你去中断他们的仪式，$c。', '', '', '', '', '', '', 26365),
(32227, 'zhCN', '防患未然', '在$1oa只啸天雏龙身边奔跑以惊吓它们。', '赞达拉巨魔骑乘的那些生物并非天生如此巨大，也不是生来就如此邪恶和忠诚。\n\n要是你能把一些啸天雏龙吓离海岸，也许它们就有机会享受真正的生活了。', '', '', '', '', '', '', 26365),
(32215, 'zhCN', '可憎的献祭', '摧毁赞达拉祭坛。', '赞达拉巨魔对我们的人民举行了可憎的仪式！必须阻止他们！\n\n深入赞图尔的中心位置，摧毁他们的祭坛。', '', '', '', '', '', '', 26365),
(32200, 'zhCN', '赞图尔的危机', '在赞图尔消灭12名巨魔。', '$n，我要你做的这件事几乎可以说是种族清洗，但我们别无选择。\n\n为了我们所有人的安危，去巨魔的镇中或沙滩上找到他们，然后将其消灭。', '', '', '', '', '', '', 26365),
(32189, 'zhCN', '寒碜的陌生人', '与半山市集的巴纳比·弗莱彻谈一谈。', '今早，一个戴着尖帽子的怪家伙跑来推销一些特别的种子，还声称那是魔法种子。$B$B其实我并不介意有点竞争——毕竟生意就是生意——可这位先生长得……十分寒碜。噢，他还散发着很浓的恶臭。$B$B你能去查查这个人，看看他是否可靠吗？他就在坚·铁掌那边试吃呢。', '', '', '', '', '', '与半山市集的巴纳比·弗莱彻谈一谈。', 26365),
(32145, 'zhCN', '小心你的脑袋', '击败石头守卫鲁克拉、首席炸弹技师斯尼克弗里兹和奥·达克。', '我的探测器在统御岗哨的广场上侦测到三个极度危险的目标。$b$b他们分别是一名食人魔密使、一名库卡隆军官和一个疯狂的地精炸弹工程师。$B$B我的自动攻城器还无法一对一地战胜他们，所以得靠你来消灭这些目标了。$b$b祝你好运！任务完成后，请回天火号来找我。', '', '说话声从某个隐蔽装置中传出。', '工匠大师欧沃斯巴克', '', '', '', 26365),
(32144, 'zhCN', '重压之下', '摧毁8个部落补给箱。', '部落已经被骄傲冲昏了头脑，可以毫不犹豫地慷慨赴死。$b$b我们必须以最小的代价打垮他们的意志。$b$b快到海岸上去找部落的补给，就在他们的舰船附近。把你找到的补给都毁了。$b$b再也没有比眼看着期盼已久的补给化为一阵青烟更打击士气的了。$b$b完成任务后，就到敌人后方去找苏利。他会给你进一步的指示。', '', '', '', '', '', '', 26365),
(32143, 'zhCN', '神奇魔法', '在统御岗哨找到3个探查器。', '欢迎你，$p！我听说过不少有关你的英勇事迹。我想请你帮忙测试一下我最新的“自动攻城器”，这可是一件具有可怕力量的多功能装置。$b$b我保证，它对使用者是绝对无害的。$b$b当你去统御岗哨时，请注意搜寻我的探查器。我先前已经派它们出去搜集攻击目标的情报。当你找到探查器时，就激活它，而我会把自动攻城器投放到你的位置。$b$b老规矩，我们战场见。', '', '', '', '说话声从某个隐蔽装置中传出。', '工匠大师欧沃斯巴克', '', 26365),
(32128, 'zhCN', '又干掉一个', '引爆挑战号和无畏界限号上的爆炸品。', '联盟已经牢牢占据了我们南边的海滩，并不断用炮火袭击我们的地面部队。我倒要看看，没有了火炮支援，他们的围攻还打不打得下去。$b$b我要你登上敌舰，摧毁他们储备的弹药。这一定能让他们变成没牙的老虎。', '', '', '', '', '', '', 26365),
(32127, 'zhCN', '统统干掉', '击败“黑炭”布伦特船长和马尔基船长。', '我们的酋长派我到这片海岸来解决那些联盟可怜虫的威胁。$b$b这些人类和他们的盟友显然非常依赖自己的领袖。他们本身毫无自主性。$b$b你今天上战场时，要注意一下我们南边海岸附近的联盟船只并找出他们的船长。$b$b去干掉他们。$b$b为了部落！', '', '', '', '', '', '', 26365),
(32120, 'zhCN', '敖骨打的遗产', '收集5份古代魔古精华。', '我们占领的这片废墟是由一个古代魔古族统治者——敖骨打建造的。尽管这一地区冒出来的幽灵说明此人或许和缚魂术有关，但我们对他的身份知之甚少。\n\n在你消灭那些幽灵时，它们会留下少量精华。把它带给我——我们会对其进行分析，希望能通过它多了解一些敖骨打的历史——以及力量。', '', '', '', '', '', '', 26365),
(31931, 'zhCN', '毕格·爆索', '在宠物战斗中击败毕格·爆索。', '我发誓，我的一只小鸡昨天竟然飞了一会儿。我们终于要大获成功了！$B$B噢，你想再打一场？', '', '', '', '', '', '', 26365),
(31799, 'zhCN', '古朴的空酒桶', '将神器进行展览。', '这件神器的恢复状况极为良好。或许你该把它放在闻道之座进行展览，好让那些游学者和考古学家们进行研究。', '', '', '', '', '', '', 26365),
(31796, 'zhCN', '古朴的棋盘', '将神器进行展览。', '这件神器的恢复状况极为良好。或许你该把它放在闻道之座进行展览，好让那些游学者和考古学家们进行研究。', '', '', '', '', '', '', 26365),
(31787, 'zhCN', '古朴的魔古符文石', '将神器进行展览。', '这件神器的恢复状况极为良好。或许你该把它放在闻道之座进行展览，好让那些游学者和考古学家们进行研究。', '', '', '', '', '', '', 26365),
(31721, 'zhCN', '训练师的试炼：奎陆·白眉', '和奎陆·白眉谈一谈，然后击败他。', '奎陆·白眉被公认为是骑士团里最优秀的弟子。$B$B他看上去几乎无懈可击。他聪慧过人、身强体健、训练刻苦，且天赋异禀。$B$B当你在训练之环挑战他时，你便是在挑战我们最强的弟子。$B$B和他谈一谈，开始对决。无论结果如何，你都会从中获益良多。', '', '', '', '', '', '', 26365),
(31718, 'zhCN', '训练师的试炼：大宝', '和大宝谈一谈，然后击败他。', '准备好下一轮试炼了吗，$n？$B$B今天，你将挑战大宝。他的决心就和他的体型一样大，除非被彻底击败，否则他绝不会放弃的。$B$B要想击败他，你也得坚持到底。$B$B去训练之环和他谈一谈，开始挑战。祝你好运。', '', '', '', '', '', '', 26365),
(31709, 'zhCN', '疑云密布', '在蛛泣洞穴对煞能干扰使用煞能协调器。沿着海岸线向北可以找到蛛泣洞穴的入口，就在香里拉村的南面。', '我听说北边的蛛泣洞穴近来有些异常。$B$B我和紫兰曾去调查过，我敢肯定那里存在着煞魔出现的迹象。$B$B我造了这个装置，用以测量煞能的感染级别。$B$B如果你打算去那儿的话，你能帮我测量一下煞能干扰吗？$B$B煞能干扰看起来就像是黑白相间的煞能水流，不断从地面喷涌而出。', '', '', '', '', '', '', 26365),
(31706, 'zhCN', '悲泣寡妇蛛', '杀死7只悲泣寡妇蛛。', '香里拉村附近的蜘蛛变得越来越具有攻击性，它们对沿海一带以钓鱼为生的垂钓翁造成了极大的威胁。$B$B为了他们的安全着想，我要你去蛛泣洞穴消灭那些悲泣寡妇蛛。$B$B你可以沿着海岸线向北，找到该洞穴。', '', '', '', '', '', '', 26365),
(31664, 'zhCN', '垂钓客的请求', '阅读纳特的垂钓日志。', '该日志记载了关于纳特·帕格伟大冒险的回忆片段。通过简单的阅读可以使你对钓鱼有更加深刻的了解。', '', '', '', '', '', '', 26365),
(31583, 'zhCN', '治疗宠物', '拜访兽栏管理员贾琳希亚，治疗你的宠物。', '既然你已经赢得了一场战斗，我们就需要治疗你的宠物，这样它们才能继续战斗！拜访一下我们这里的兽栏管理员贾琳希亚，来治疗和复活你的宠物。', '', '这里的兽栏管理员贾琳希亚可以治愈和复活你的宠物。', '贾琳希亚', '', '', '', 26365),
(31238, 'zhCN', '健脑食品', '带4条穆山兽之舌给卡拉克西维斯的操纵者卡兹提克。', '科沃克正在加速生长，但他的大脑似乎跟不上生长的速度。他需要一种特殊的食物来确保大脑跟上身体的生长速度。$B$B穆山兽之舌富含营养，可以促进恐虫的大脑生长，但他们通常吞下整只野兽，迅速填饱肚子。如果我们每隔几天喂科沃克吃穆山兽之舌，应该能平衡他的生长。$B$B大群的穆山兽就在这里东面的山上游荡，距离格尔桑平台不远。', '', '', '', '', '', '', 26365),
(31234, 'zhCN', '完美的信息', '收集1颗泥泞兽信息囊。', '啊！唤醒者！你一定得帮帮我！（你一定要帮我，否则我就拿你做实验品！）$B$B我的试验需要更多的材料，是的是的！（信息信息，试验需要更多的信息！）$B$B在这里的西面，我看到过一些迷雾怪物。他们有着又大、又圆、又好的信息囊！$B$B现在就去，小唤醒者。给我带一颗回来！', '', '', '', '', '', '', 26365),
(31201, 'zhCN', '朋友，不是食物！', '救出北方、中央和南方恐虫饲料洞中的影踪派受训者。', '我们的斥候送来了一条非常不好的消息。\n\n我们丢失了三个学徒，但斥候找到了他们……\n\n他们被螳螂妖抓住了，现在已经送往恐虫洞。\n\n那是他们的恐虫“饲料”洞。幸运的是，恐虫通常不吃他们。\n\n我需要你现在赶赴那里，给他们一些逃生风筝，把他们救出来！', '', '', '', '', '', '', 26365),
(31117, 'zhCN', '乌奴克！', '去螳螂高原的死语者高地击败乌奴克。', '乌奴克是螳螂高原的野牛人中的死语者。打败他之后，你的任务才算真正地完成。快去干掉他吧！', '', '螳螂高原的野牛人中堕落的死语者。', '乌奴克', '', '', '', 26365),
(31083, 'zhCN', '一诺千金', '向恐惧废土的里基屯村的里基屯酋长报到。', '这只生物刚死，一群奇怪的林精就出现了，还把它的珍珠拿走了。$b$b那些林精在附近有个村庄，叫里基屯村。或许你应该去调查一下。', '', '', '', '', '', '', 26365),
(31076, 'zhCN', '风暴烈酒的命运', '向落日酒坊的居民询问风暴烈酒族人的下落。', '你好，$r。我是陈·风暴烈酒。$b$b我在寻找我的家人。我听说有几个风暴烈酒家的人越过了长城，来帮忙抗击螳螂妖了。我想找到并加入他们。$b$b你在这儿见过叫风暴烈酒的人吗？你能帮我四处打听一下吗？', '', '', '', '', '', '', 26365),
(30733, 'zhCN', '图卡图克', '击败图卡图克。', '你已经声名远播了，$n。我收到了一位武艺更高强的竞争者发来的挑战书，他认为你就是个绣花枕头。$b$b他的名字叫图卡图克，是个猢狲。如果你以前跟猢狲战斗过，你应该知道他们表面看起来好像个楞头青，不过打起架来却很犀利。祝你好运。', '', '前十场比赛中，他一场未败。', '图卡图克', '', '', '', 26365),
(30729, 'zhCN', '茱莉亚·贝茨', '击败茱莉亚·贝茨。', '在赤精栖木，只要你认可并接受朱鹤的理念，我们都会热情接纳。我们最近收了一名异族的弟子，她来自于东北方的人类王国。她有着一个相当具有异域风情的名字：茱莉亚·贝茨。$b$b她就是你的下一个挑战者。你可以在岛屿西面的海滩上找到她。', '', '潘达利亚的新访客。', '茱莉亚·贝茨', '', '', '', 26365),
(30726, 'zhCN', '谭命夺', '击败谭命夺。', '你的下一个挑战者也是一位新晋的弟子。他的名字叫谭命夺，在前两场决斗中他都获得了胜利。$b$b他会在南面的仙鹤雕像那里等你。', '', '你的下一个挑战者。', '谭命夺', '', '', '', 26365),
(30465, 'zhCN', '准备进攻', '去卡桑琅丛林的哨兵营地和丽娅拉谈一谈。', '哈！所以我父亲白白浪费了二十年的生命！$b$b从现在起由我指挥。$b$b当泰兰德将我们派来这里时，就非常明确的说过，我们只有找到她在预见中看到的圣光之源之后才能回去。现在很明显，青春之池并不是这个圣光的来源。$b$b我们正向西推进，正好需要你帮忙。$b$b等你准备好了，就到最西边的哨兵营地跟我们碰头吧。', '', '', '', '', '', '去卡桑琅丛林的哨兵营地和丽娅拉谈一谈。', 26365),
(30462, 'zhCN', '深入荒野', '在卡桑琅河最南端的朱鹤寺附近找到科洛·迷雾行者。', '朱鹤寺坐落在丛林深处，那里是伟大的赤精和他最虔诚的信徒们的家园。我认为他们应该对这儿发生的事情有所了解。$B$B寺庙就坐落在丛林南部海岸上，卡桑琅河的入海口处。', '', '', '', '', '', '', 26365),
(30461, 'zhCN', '深入荒野', '在卡桑琅河最南端的朱鹤寺附近找到科洛·迷雾行者。', '朱鹤寺坐落在丛林深处，那里是伟大的赤精和他最虔诚的信徒们的家园。我认为他们应该对这儿发生的事情有所了解。$B$B寺庙就坐落在丛林南部海岸上，卡桑琅河的入海口处。', '', '', '', '', '', '', 26365),
(30382, 'zhCN', '给艾拉的蓝色羽毛', '', '', '', '', '', '', '', '', 26365),
(30376, 'zhCN', '希望永存', '与石犁村的麦龙谈一谈。', '影踪派可能正在潘达利亚的其他地方处理着类似的冲突。$B$B快去四风谷西部边陲的石犁村找影踪派指挥官麦龙吧。告诉他，我们已经控制了这里的局势；不需要影踪派再派援兵来了。$B$B事实上，正相反——我会派出许多前来朝拜的追随者，给有需要的人们带去希望的消息。$B$B再次感谢你，$p。再见。', '', '', '', '', '', '与石犁村的麦龙谈一谈。', 26365),
(30188, 'zhCN', '展翅高飞', '加入云端翔龙骑士团。', '我已经不能再以你的老师自居了，$n。$B$B你已经证明了自己，现在你配得上你的翔龙了。$B$B今天，你将加入我们的行列。准备好了吗?', '', '', '', '', '', '', 26365),
(30106, 'zhCN', '大功告成', '前往希尔斯布莱德丘陵的拉文霍德庄园，将你成功的消息告诉拉希奥王子。', '听到你成功的消息，拉希奥王子一定会很高兴的。你得回拉文霍德庄园去向他报告。$B$B这位殿下对帮助过他的人向来都是十分慷慨的。', '', '', '', '', '', '前往希尔斯布莱德丘陵的拉文霍德庄园，将你成功的消息告诉拉希奥王子。', 26365),
(29847, 'zhCN', '以其人之道', '潜入拉文霍德庄园，找到失踪的黑龙蛋。', '这个洞穴的另一边就是拉文霍德庄园。你必须神不知鬼不觉地潜入那里！$B$B<莫奥斯塔兹对你施放了一个法术。>$B$B这样，我就能在你潜入庄园时监督你的行动，并随时与你沟通了。现在，快潜入那座庄园，找到黑龙蛋，可别被抓住了……', '', '', '', '', '', '', 26365),
(29361, 'zhCN', '壕沟怪物！', '使用联盟诱捕装置，在洛丹伦废墟中召唤来壕沟怪物。然后使用肿胀青蛙喂这只怪物。', '有时候，钓鱼也得把合适的东西扔进水里，$c。$b$b这就是我们塞肥这些青蛙的目的。我们用肥苍蝇塞肥了蜘蛛，又用肥蜘蛛塞肥了青蛙，现在，我们要去喂一喂真正的怪物了。$b$b上面洛丹伦废墟的壕沟里就藏着我们的壕沟怪物。$b$b今天是喂食的日子，不过我们也得好好训练它。这只袋子里有一套诱捕工具和一些肿胀青蛙。当怪物出现的时候，就使用诱捕工具把青蛙扔给那个怪物。', '', '', '', '', '', '', 26365),
(29321, 'zhCN', '快乐挖蚌人', '从鲁瑟兰村附近的海岸上收集10只泰达希尔蚌肉。', '我认识的所有人都喜欢蚌肉，只有我完全受不了它们！它们又腥又黏，而且要找到它们，就一定要在泥巴里挖坑。与其这样，我宁愿用钓竿和鱼饵渡过一天时间。$B$B不过，我还是想用一桶新鲜的蛤蜊给我的兄弟来一个惊喜。如果你愿意为我去收集那些蛤蜊，我会给你奖励的。$B$B通过传送门到鲁瑟兰村去，在那里的岸边浅滩上寻找蚌肉吧。', '', '', '', '', '', '', 26365),
(29316, 'zhCN', '回归基本', '帮助工匠区和贸易区的居民制做米粉。办法是捣击米筐中的东西。', '有一些东西是从家庭厨师到厨艺大师的每一个人都需要的。这座城市最重要的出产物之一就是米粉。大部分家庭都会长期储备至少一筐大米。工匠区和贸易区的居民也都一样。$B$B我经常会要求我的学生们去帮助居民将大米捣成米粉。因为这一工作永远都需要有人去做，而且又是一种很好的练习。为什么你不去试一试？', '', '', '', '', '', '', 26365),
(29237, 'zhCN', '巫毒僵尸', '拯救10名避世乐园幸存者。', '那些人……他们都成了僵尸，还是巫毒僵尸！这看起来可不妙，$n。$b$b你必须杀了他们。$b$b他们被杀死后的那段时间，我可以拯救他们，把他们变回曾经的人形。$b$b我们必须赶快行动，僵尸可不会休息。', '', '', '', '', '', '', 26365),
(29232, 'zhCN', '与靴同葬……', '找到格伦特·恐锤的靴子。', '啊……是你啊，$n。玛乌提……他死了？我终于活到了为我兄弟报仇的这一刻。我对你只有一个请求……这头小豹崽在这里挠我的脚很久了。作为一个矮人，我不该光着脚去死。$b$b求求你，让我穿着靴子下葬。', '', '', '', '', '', '', 26365),
(29149, 'zhCN', '灭火之怒', '在复苏之地或塞西莉亚的栖地中击败任意7名来自火焰之地的入侵者。', '我们在海加尔的任务之中，最紧迫的任务很简单：消灭那些入侵者。火焰的本质就是吞噬一切。如果有片刻松懈，它就会将眼前的一切烧成灰烬。$b$b干掉任何你看见的烈焰入侵者。每一名敌人的倒下，都会为海加尔争取时间。', '', '', '', '', '', '', 26365),
(29148, 'zhCN', '羽翼烈焰', '使用群鸟女王的翎羽来召唤并击败米拉盖佐尔。', '<麦托克劳的声音继续在你的脑海中回响>$b$b米拉盖佐尔是只烈焰生物，但是从很多方面来说，他仍然是一只鸟。故此，艾维娜的神器也许还能把他召唤出来。$b$b他就在西边那座熊熊燃烧的传送门旁边。在传送门入口处使用这根羽毛，然后准备一场恶战吧。', '', '把他从传送门里拉出来，然后消灭他！', '米拉盖佐尔', '', '', '', 26365),
(29137, 'zhCN', '突破防御', '杀死5条熔岩破坏者。', '岩浆虫在我们的后方破土而出，破坏了我们的阵型，让元素能够趁虚而入。现在北边的整条战线上到处都是岩浆虫，连灰烬旷野也无法幸免。$B$B快把它们赶回地洞里去。', '', '', '', '', '', '', 26365),
(29085, 'zhCN', '经典旧世随机 35-39级 （第N次）', '', '', '', '', '', '', '', '', 26365),
(29084, 'zhCN', '经典旧世随机 35-39级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(28874, 'zhCN', '把他们钩下来', '用尖利的肉钩让4名桑德玛尔狮鹫骑手掉下来，然后将他们消灭掉。', '蛮锤训练战斗狮鹫的速度比我们控制幼龙的速度要快。我们不能让他们继续保持这一数量优势！$B$B去捕杀在溅血谷地北边河流上空飞翔的狮鹫骑士。拿上这个钩子，等他们飞过来的时候丢出去。那劲头会把他们从坐骑上甩下来，掉到你的脚下。把那些落下来的狮鹫骑手给杀掉！', '', '', '', '', '', '', 26365),
(28871, 'zhCN', '粉碎蛮锤', '杀死蛮锤烙印战士，收集8个蛮锤徽章。桑德玛尔废墟里有名字的角色也会掉落徽章。', '蛮锤有联盟撑腰，愈发大胆。他们竟敢渡河而过。把他们赶回去！$B$B去找那些在河床以及北岸桑德玛尔废墟里战斗的蛮锤烙印战士，将他们杀掉。他们中的精英携带着徽记——替我把它们收集过来，证明你对龙喉的忠诚。', '', '', '', '', '', '', 26365),
(28665, 'zhCN', '被诅咒的镣铐', '你的任务是从巴拉丁监狱西北边的恶魔监狱取回8条被诅咒的镣铐。', '你去过恶魔监狱了吗，$n？每次我们差不多把那些牢房里的恶魔清理干净的时候，他们都会很快卷土重来。我们发现他们是从散布在该地区的被诅咒的镣铐中钻出来的。这就是我要交给你的任务了，$n。$B$B我要你去尽可能收集那些镣铐，把它们带回来交给我。我们会立即摧毁这些东西。', '', '', '', '', '', '', 26365),
(28664, 'zhCN', '斯瓦诺斯', '你必须杀死恶魔监狱中的斯瓦诺斯，并带回它的诅咒颈环。斯瓦诺斯就在巴拉丁监狱西北边的恶魔监狱中。', '你在占领这座岛的过程中表现得很出色，$c。现在，我们既然已经占领了岛屿，就要用这些牢房关押囚犯。恶魔监狱是个特别难以清理的地方，不幸的是，这里到处都是形形色色的恶魔。$B$B我们成功地削减了恶魔的数量，但是有一只巨大的熔火犬冲出了牢笼，正在那里大肆破坏。我要你去干掉它，把它的颈环拿回来。', '', '我从来都不喜欢绿色。', '斯瓦诺斯', '', '', '', 26365),
(28663, 'zhCN', '恶魔监狱', '你的任务是在巴拉丁监狱西北边的恶魔监狱中杀死任意10个恶魔。', '你听说过恶魔监狱吗，$n？这是岛上的一座旧牢房。问题是，那里到处都是恶魔。我们打算用它来关押岛上的联盟残党，但是以目前的情况来看，这个计划没法实施。$B$B我要你去干掉那些恶魔。搞定之后回来向我报告。', '', '', '', '', '', '', 26365),
(28649, 'zhCN', '一份特殊的惊喜', '赤色烈焰礼拜堂的骑士团指挥官普雷菲斯特希望你去处决牢房里的银色黎明俘虏，哈尔福特勋爵。', '我们来这儿之后，把这个地方夷为了平地，然后我们又向牢房进发。在那里看到的一切完全出乎我们的意料，$n。看来血色十字军真的很忙。那里塞满了银色黎明的俘虏，我们到那儿的时候，大部分俘虏都已经死了，只剩少数几个奄奄一息。$B$B我本来准备去那儿解决剩下的那几个的，但是我想这份荣耀应该让给你。尤其是，里面有一个感染了瘟疫的狼人，我想你一定会在处决中寻找到的极大的快感的。', '', '', '', '', '', '', 26365),
(28476, 'zhCN', '暮光的诡计', '用发光的火炬点燃黑石深渊住宅区的8本暮光教义。', '在黑石深渊，暮光之锤开始说服黑铁矮人巩固他们的盟约，为了山外面的战役准备兵力。$B$B在邪教徒把黑铁矮人及其领导层的嗜血情绪煽动起来之前，我们必须采取行动。也许最好的办法，就是毁掉邪教徒分发给矮人的材料。$B$B我要你到黑石深渊的住宅区去，用这把火炬点燃暮光之锤发放到那里的书籍。', '', '', '', '', '', '', 26365),
(28109, 'zhCN', '前进', '带领小队通过北部龙喉大门，前往格瑞姆巴托入口。$B$B如果你和小队走散，就去找巨龙曲径的找马迪亚斯·肖尔大师。', '目前为止一切顺利。$B$B过了这扇大门，我们就能找到格瑞姆巴托的入口。我收到命令，要占领入口，阻止敌人增援，其他人则穿过小道，通过被我们清理的峡谷。$B$B我们出发前往西南边的峡谷吧——应该很快就能找到下一座大门了。', '', '', '', '', '', '', 26365),
(27955, 'zhCN', '窥视', '凝视暮光之眼。', '这颗宝珠令我不寒而栗。古加尔利用它们操控爪牙的一举一动，现在轮到暮光之眼为我们服务了。$B$B让我瞧瞧……嗯，雾蒙蒙的。我只能看见你。为什么它只让我看到你呢？$B$B<迦罗娜将暮光之眼递到你面前。>$B$B凝视它，告诉我你看到的景象。窥视古加尔的巢穴！他在做什么？是否有重兵把守？告诉我！', '', '', '', '', '', '', 26365),
(27787, 'zhCN', '碎颅者魔山', '存活并杀死碎颅者魔山。', '这是陷阱！古加尔诱使你找到暮光神锤，这样他手下的戈隆就可以趁机除掉你。$B$B活下来并杀死碎颅者魔山。', '', '干掉他！', '碎颅者魔山', '', '', '', 26365),
(27784, 'zhCN', '暮光神锤', '找到暮光神锤。', '在你进入矿洞后，我设法找到了暮光神锤的所在。他们在南面的暮光祭坛打造了这把武器。$B$B更重要的是，暮光教徒们犯了一个严重的错误：古加尔独自监督了武器最终的锻造过程。$B$B军情七处牺牲了不少人手才查明这些信息。', '', '', '', '', '', '', 26365),
(27782, 'zhCN', '马迪亚斯需要你', '跟暮光高地暮光堡垒的马迪亚斯·肖尔大师谈一谈。', '我们相处得非常愉快。我真是舍不得你离开啊。但是马迪亚斯想见你。$B$B他说有要紧事要找你！$B$B等你完事之后要不要回来找我喝一杯什么的，$g伙计:妹子;？', '', '', '', '', '', '', 26365),
(27720, 'zhCN', '“金矿”先生的交通工具', '跟见习萨满“金矿”一起乘坐矿车抵达终点。', '$n，我们要前往洞穴尽头的大地传送门。$B$B我设法“弄到”了交通工具。如果可以乘坐交通工具的话，干嘛要走着去呢？希望你不会介意搭乘矿车。$B$B准备好了的话告诉我一声。', '', '', '', '', '', '', 26365),
(27719, 'zhCN', '生命之水', '使用生命之水从铸炉之主芬雷的尸体上提取信息。', '带上生命之水，将它倒在淹死的矮人尸体上。$B$B生前他与金属为伍，如今湖水浸透他的肉身。你想知道的一切，生命之水都会让他告诉你。$B$B你知晓答案后，请立即离开我的领地。', '', '', '', '', '', '', 26365),
(27711, 'zhCN', '返回源质深渊', '跟暮光高地源质深渊的见习萨满“金矿”谈一谈。', '唤地者的助手，见习萨满“金矿”想见你。$B$B他们大概觉得是时候让你帮忙处理矿洞的事务了。', '', '', '', '', '', '', 26365),
(27702, 'zhCN', '致命一击', '给予5名暮光恐惧飞龙致命一击。', '瞧。莉拉斯塔萨正在激战！$B$B杀死那些被她击落的幼龙，$n。否则暮光之锤的治疗师会帮助他们重返空中。$B$B致命一击的时候到了。', '', '', '', '', '', '', 26365),
(27700, 'zhCN', '释放红龙', '使用源质之斧砍断禁锢莉拉斯塔萨的镣铐。', '莉拉斯塔萨是被暮光之锤俘虏的红龙中最后的一条，也是最强大的一条。他们很快就会杀死她了。$B$B我要你使用源质之斧帮助她重获自由。', '', '使用源质之斧帮她摆脱束缚！', '莉拉斯塔萨', '', '', '', 26365),
(27695, 'zhCN', '源质之斧', '取回源质之斧。', '暮光之锤俘虏并屠杀了很多红龙，但是尚有一只幸存。你还记得莉拉斯塔萨吗？她被囚禁在附近，我们要帮她重获自由。$B$B首先，我们需要一件锋利的器物砍断她的镣铐。$B$B双头怪守护者盲眼负责看守南面的升腾祭坛。$B$B他有一柄精心打造的源质之斧。说不定这就是古加尔的“终极”武器？', '', '他有源质之斧！', '守护者盲眼', '', '', '', 26365),
(27688, 'zhCN', '分散敌人的注意', '杀死阿丽斯·芬森女爵士、克雷穆大师和刺玫米娅', '我们必须铲除三名暮光升腾者的候选人：阿丽斯·芬森女爵士、克雷穆大师和刺玫米娅。$B$B我希望你能分散他们的注意。时机成熟时，我会从背后发动突袭并解决他们。$B$B$n，无论如何，你都不能低估这些家伙。他们是冷酷无情的一流杀手，才会挤上候选者的位子。', '', '', '', '', '', '', 26365),
(27657, 'zhCN', '来自唤地者的帮助', '跟暮光高地源质深渊的唤地者耶法谈一谈。', '古加尔的古器的调查行动进入了死胡同。暮光之锤强迫一批被俘的蛮锤铁匠为他们劳作，并在任务完成后将他们淹死在湖中。$B$B<马迪亚斯啐了一口。>$B$B我们需要帮助。你可以在源质矿洞的西南方找到大地之环的成员唤地者耶法。$B$B她和她的地精助手需要帮助，才能关闭附近的元素传送门。作为交换，我觉得她会帮我们解决问题的。', '', '', '', '', '', '', 26365),
(27654, 'zhCN', '重挫暮光之锤', '杀死10名要塞老兵、堕落的元素师和（或）暮光守备官。', '缺乏行之有效的传统的消灭坏人的计划，任何突袭行动都不可能成功。$B$B你的目标有很多，像是要塞老兵、堕落的元素师还有暮光守备官。$B$B你想怎么除掉他们，随你便。', '', '', '', '', '', '', 26365),
(27652, 'zhCN', '黑暗刺客', '收集5枚黑暗刺客的坠饰。', '即便沦为猎物，那也是我藏身羊群理应承担的风险。$B$B<马蒂亚斯打量着你。>$B$B暮光之锤倒是有所长进，派出了黑暗刺客追杀我。他们还不错，可惜只是几具灌注了最优秀的杀手之魂的行尸走肉。$B$B你可以帮我个忙吗？除掉黑暗刺客，并带回他们的灵魂坠饰。', '', '', '', '', '', '', 26365),
(27636, 'zhCN', '只有你和马迪亚斯', '在暮光高地的暮光堡垒中找到马迪亚斯·肖尔。', '军情七处的人都死了。你得赶快去找到马迪亚斯·肖尔。$B$B好消息是，小队指挥官告诉过你他大概会在哪里。', '', '', '', '', '', '', 26365),
(27627, 'zhCN', '不过是漂亮点的蟑螂', '消灭5只紫水晶圣甲虫、5只蓝宝石圣甲虫、5只绿宝石圣甲虫和5只翡翠圣甲虫。', '显然，远古雕像是各种圣甲虫的家。$b$b为了要尽可能安然无恙地离开这个地方，你决定除掉大厅里的这些虫子。', '', '', '', '', '', '', 26365),
(27500, 'zhCN', '四个总比没有好', '收集扎布鲁克斯和毕布伏德的四枚徽记。', '进攻暮光之门的战斗已经打响，还有最后一点小麻烦要处理：扎布鲁克斯和毕布伏德，古加尔的信徒。$B$B情报显示，他们就在信徒之穴里面，那是暮光之门西南角的一座小型的食人魔洞穴。$B$B你认为卡修斯和库德兰肯定会要求你提供击败他们的证明。', '', '', '', '', '', '', 26365),
(27498, 'zhCN', '发出攻击信号', '到暮光之门中的某座哨塔顶部去，发出攻击信号。', '既然你已经把碎颅者魔山从暮光之门引开了，现在就赶快发信号通知你们部署在胜利者岗哨的部队发起进攻吧！', '', '', '', '', '', '', 26365),
(27494, 'zhCN', '移山', '引爆隐藏的炸药，将碎颅者魔山从暮光之门引开。', '在攻打暮光之门之前，我们必须先把碎颅者魔山引开！$B$B在你们的军情七处特工出发之前，我让他们拿了一些炸药并藏在暮光之锤的箱子里。现在，他们应该已经把炸药安放在通往堡垒顶部的台阶上了。$B$B我要你去引爆炸药，然后等那个怪物跑出去查看的时候给我们发信号。$B$B届时我们就会发动攻击，解决这个食人魔的据点！', '', '', '', '', '', '', 26365),
(27445, 'zhCN', '达基萨斯将军', '杀死达基萨斯将军。', '奈法利安的基地在山脉顶部的黑翼之巢中。虽然我们可以通过上层黑石塔进入那里，但是如果使用旁边的传送宝珠，就可以快速派遣大批部队进去。不过，我们必须先用另一枚宝珠给自己刻上特殊的烙印。$B$B奈法利安的军队由达基萨斯将军统制，他亲自保卫着这第二枚宝珠。除掉他，这样我们就可以使用他的宝珠了。达基萨斯将军在上层黑石塔的塔顶王座里。', '', '我们需要让他到达奈法利安面前。', '达基萨斯将军', '', '', '', 26365),
(27444, 'zhCN', '伪酋长', '杀死雷德·黑手酋长。', '雷德·黑手是一位兽人酋长的儿子。奥格瑞姆·毁灭之锤杀死了雷德的父亲，并取代他成为了酋长。现在，雷德是黑暗部落名义上的领袖，奈法利安和他的黑龙军团在背后支持他。$B$B这个蠢货声称，部落也应归他管辖，而且扬言要凭武力夺取部落的控制权！我们绝对不能容忍这种事情发生。在上层黑石塔找到这个冒牌酋长，把他彻底干掉，$c。', '', '杀死伪酋长！', '大酋长雷德·黑手', '', '', '', 26365),
(26885, 'zhCN', '深渊的知识', '找到洛迦里斯手稿。', '作为一名受训的哨兵，我的责任就是为我的上级搜集文献。古老的、强大的文献。能打开大门，落入敌人之手便能唤醒沉睡之人的文献。$B$B谣传说一份古老的文献，洛迦里斯手稿，就在阿斯卡之池底部的铁箱里。那里是我们死去先祖的往日住所。在城市变为废墟之前，他们掌握着伟大的知识。$B$B我的能力不足以继续前进了。请替我寻回那份手稿。', '', '', '', '', '', '', 26365),
(26090, 'zhCN', '这枚卵交给你', '将巨大的鳗鱼卵交给瓦丝琪尔光渊海峡底部的欧纳柯。', '<这像是光渊海峡中扭曲的巨海鳗的卵。说不定欧纳柯会对此感兴趣呢。>', '', '', '', '', '', '', 26365),
(25157, 'zhCN', '时尚潮流！', '对10名“人型生物目标”测试星尘2号。', '巴恩沃斯教授正在研究新的星尘——这可是本季度奥格瑞玛最热门的玩意，它能令一切都闪闪发光。如果我们将它投放市场的话，肯定要赚翻了！不过珠宝匠协会不允许我们贩卖它，除非我们完成一些“活体实验”——因为他们觉得使用魔法尘可能会导致危险什么的。好吧，看来我们得迎合他们一下。把这袋星尘拿上，找些人来测试星尘2号。', '', '', '', '', '', '', 26365),
(24918, 'zhCN', '希尔瓦娜斯的复仇', '', '', '', '', '', '', '', '', 26365),
(24917, 'zhCN', '穆拉丁的追思', '', '', '', '', '', '', '', '', 26365),
(24916, 'zhCN', '吉安娜的思念', '', '', '', '', '', '', '', '', 26365),
(24915, 'zhCN', '莫格莱尼的团聚', '', '', '', '', '', '', '', '', 26365),
(24894, 'zhCN', '经典旧世随机 56-60 （第N次）', '', '', '', '', '', '', '', '', 26365),
(24893, 'zhCN', '经典旧世随机 46-55级 （第M次）', '', '', '', '', '', '', '', '', 26365),
(24892, 'zhCN', '经典旧世随机 40-45级 （第N次）', '', '', '', '', '', '', '', '', 26365),
(24891, 'zhCN', '经典旧世随机 24-34级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24890, 'zhCN', '经典旧世随机 15-25级 （第N次）', '', '', '', '', '', '', '', '', 26365),
(24889, 'zhCN', '经典旧世随机 5-15级 （第N次）', '', '', '', '', '', '', '', '', 26365),
(24886, 'zhCN', '经典旧世随机 56-60级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24885, 'zhCN', '经典旧世随机 46-55级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24884, 'zhCN', '经典旧世随机 40-45级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24883, 'zhCN', '经典旧世随机 24-34级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24882, 'zhCN', '经典旧世随机 15-25级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24881, 'zhCN', '经典旧世随机 5-15级 （第一次）', '', '', '', '', '', '', '', '', 26365),
(24838, 'zhCN', '心灵的改变', '', '', '', '', '', '', '', '', 26365),
(24833, 'zhCN', '复仇之路', '', '', '', '', '', '', '', '', 26365),
(24832, 'zhCN', '复仇之路', '', '', '', '', '', '', '', '', 26365),
(24826, 'zhCN', '复仇之路', '', '', '', '', '', '', '', '', 26365),
(24820, 'zhCN', '心灵的改变', '', '', '', '', '', '', '', '', 26365),
(24662, 'zhCN', '粉碎皇冠药剂公司', '消灭5个皇冠恶霸，并使用滑栓的氪金炸弹摧毁位于尘泥沼泽的塞拉摩外面的一台药剂车。然后返回暴风城，去见探员斯尼普·滑栓。', '这账本上提到了多处地点，我需要你前去调查并采取相应的行动，伙计。不能再拖下去了。$b$b这是我要你调查的一处地点：就在尘泥沼泽的塞拉摩外面，靠近警戒哨岗一点。别那样看着我，好吗？这我们大家都是个问题。他们肯定不会干什么好事。到那儿去解决掉他们。$b$b噢，对了，如果你发现了某些危险的大玩意儿需要当场销毁的话，就朝它丢这个炸弹。', '', '', '', '', '', '', 26365),
(24659, 'zhCN', '粉碎皇冠药剂公司', '消灭5个皇冠暴徒，并使用滑栓的氪金炸弹摧毁黑海岸古树之林南面的一台药剂车。然后返回暴风城，去见探员斯尼普·滑栓。', '这账本上提到了多处地点，我需要你前去调查并采取相应的行动，伙计。不能再拖下去了。$b$b这是我要你调查的一处地点：就在黑海岸的古树之林的南面。他们肯定不会干什么好事。到那儿去解决掉他们。$b$b噢，对了，如果你发现了某些危险的大玩意儿需要当场销毁的话，就朝它丢这个炸弹。', '', '', '', '', '', '', 26365),
(24652, 'zhCN', '粉碎皇冠药剂公司', '消灭5个皇冠喷水者，并使用滑栓的氪金炸弹摧毁晶歌森林绝望之林中的一台药剂车。然后返回奥格瑞玛，去见侦探斯奈普·滑栓。', '这账本上提到了多处地点，我需要你前去调查并采取相应的行动，伙计。不能再拖下去了。$b$b这是我要你调查的一处地点：就在晶歌森林的绝望之林中，靠暮色之镜北面一点。他们肯定不会干什么好事。到那儿去解决掉他们。$b$b噢，对了，如果你发现了某些危险的大玩意儿需要当场销毁的话，就朝它丢这个炸弹。', '', '', '', '', '', '', 26365),
(24647, 'zhCN', '粉碎皇冠药剂公司', '消灭5个皇冠清洁者，并使用滑栓的氪金炸弹摧毁希尔斯布莱德村镇外面的一台药剂车。然后返回奥格瑞玛，去见侦探斯奈普·滑栓。', '这账本上提到了多处地点，我需要你前去调查并采取相应的行动，伙计。不能再拖下去了。$b$b这是我要你调查的一处地点：就在希尔斯布莱德村镇的外面！他们肯定不会干什么好事。到那儿去解决掉他们。$b$b噢，对了，如果你发现了某些危险的大玩意儿需要当场销毁的话，就朝它丢这个炸弹。', '', '', '', '', '', '', 26365),
(14392, 'zhCN', '再见吾爱，还有米诺鱼', '与锈水港的索纳塔谈谈。', '谢谢你，小家伙。$B$B有时爱真的能蒙蔽真知，即便对巨龙来说亦是如此。我已决定倾我所能，誓保卡雷不会步玛里苟斯的后尘。此乃我至高荣耀。$B$B你该回到港口去，我相信有人在那里等着你。$B$B当心别被路上的什么吃掉或踩扁了。', '', '', '', '', '', '', 26365),
(14372, 'zhCN', '萨加德营地', '卡隆·沼织要你跟萨加德谈一谈。', '$c，你还活着，这令我很高兴。我接到报告称南面的恶魔愈发躁动了。$b$b如果恶魔继续往北扩张的话，位于边界处的那座营地就会陷入与外界隔绝的险境。$b$b或许你可以帮帮他们？$b$b营地的首领叫萨加德。他会给你详细的指示。$b$b谢谢你，朋友。一路保重。', '', '', '', '', '', '', 26365),
(14261, 'zhCN', '冰冰冷', '使用低温装置16号冷冻并杀死8条漆黑幼龙。', '我有个对付龙的好办法了。那就是我的低温装置16号。$B$B本来我设计它是为了冰冻工人，便于运输，还不用管吃管喝，可结果它会有……副作用。不过用来把龙从天上弄下来应该不会错！', '', '', '', '', '', '', 26365),
(14171, 'zhCN', '死者的感激', '弄到悼念糕饼，并把它交给银月城墓地的欢快的血精灵灵魂。$B$B你必须使用一朵橙菊，才能看到那个隐形的灵魂。', '真高兴能再次见到朋友和亲人，不过也许我做得有些太夸张了……我已经吃光了他们为我准备的一切！$B$B能不能帮我一个忙，再给我拿来一些那种美味的悼念糕饼？我会非常感激你的……$B$B我想，那边的查普曼正在出售食谱。', '', '', '', '', '', '', 26365),
(14012, 'zhCN', '腐蚀术', '将等级提升至3级，学习腐蚀术。然后对一个训练假人施放3次腐蚀术。', '$g先生:女士;，我是艾沃·邪指，你的私人训练师。$B$B我听说，你想要学习关于$c的新技能？\n\n你瞧，随着经验的不断增长，你也将学会如何把你所擅长的技巧发扬光大。很带劲，不是吗？$B$B那么去吧，多积累些经验。然后等你学会了新技能，就找这里的训练假人来试一试。', '', '', '', '', '', '', 26365),
(13825, 'zhCN', '蚌肉大餐', '', '', '', '', '', '', '', '', 26365),
(13795, 'zhCN', '科罗克·斩亡者', '与银色比武场的科罗克·斩亡者谈一谈。', '黑锋骑士代表团的领袖要和你谈谈，$c。科罗克·斩亡者是一位令人胆寒的斗士，他肯定有很多话要和你说。$B$B黑锋骑士团在比武场的北部扎了营，就在联盟代表团的大帐西边。', '', '', '', '', '', '', 26365),
(13770, 'zhCN', '冬之利刃', '将冬之利刃交给银色比武场的祖尔托。', '那个天杀的死亡骑士，把我的剑给弄坏了！$B$B前往晶歌森林的南部，你可以在水晶裂痕的出口上方找到恒焰领主。杀死他，拿到他身上的恒焰灰烬。$B$B带着恒焰灰烬前往嚎风峡湾北部的冬息湖中心，解救一位被寒冰困在那里的女士。她守护着一把古代宝剑，能够解救她的人就可以获得那把宝剑作为奖励。$B$B证明你的能力，拿到她守护了许久的宝剑吧，$n。', '', '', '', '', '', '', 26365),
(13763, 'zhCN', '珍贵的武器', '将达克玛尔之剑交给银色比武场的碎颅者莫克拉。', '为什么我的运气总是烂到家了呢？我的比赛用剑无影无踪了！$B$B在吟游诗人的传说里，如果哪位旅人能给一位孤独的女士带去几朵冬水仙，就可以获得她的礼物。那些花只生长在铁墙大坝下游的浮冰上，就在晶歌森林的西北部，与冰冠冰川交界的地方。去摘些这种花，然后把花带到龙骨荒野东北部的达克玛尔湖去，就在该地区与祖达克、灰熊丘陵交界处的灯环中找到那位孤独女士。把花献给她，她会回赠你一把优秀的利剑。', '', '', '', '', '', '', 26365),
(13752, 'zhCN', '冠军的利剑', '找到灰木之剑，把它交给银色比武场的科鲁索斯。', '啊，说实话，光靠锋利的钢剑是不足以获得胜利的。其他参赛者用的都是附有魔法的武器，这对我非常不利，不过这也不是什么大问题。$B$B一个流传于灰熊丘陵的古老传说中提到，那里有位女士为了守护一把剑受到诅咒，变成了一只青蛙。现在她就住在灰木哨站东边的灰木湖岸上，和其它的湖蛙生活在一起。根据传说，唯一能够解除这道诅咒的方法，是有人自愿去亲吻她。不过呢，你要记得先在嘴唇上涂抹这种药膏，然后再去亲吻湖蛙，不然你的嘴上会长疣的。', '', '', '', '', '', '', 26365),
(13741, 'zhCN', '冠军的利剑', '找到灰木之剑，把它交给银色比武场的兰娜·硬锤。', '啊，说实话，光靠锋利的钢剑是不足以获得胜利的。其他参赛者用的都是附有魔法的武器，这对我非常不利，不过这也不是什么大问题。$B$B一个流传于灰熊丘陵的古老传说中提到，那里有位女士为了守护一把剑受到诅咒，变成了一只青蛙。现在她就住在灰木哨站东边的灰木湖岸上，和其它的湖蛙生活在一起。根据传说，唯一能够解除这道诅咒的方法，是有人自愿去亲吻她。不过呢，你要记得先在嘴唇上涂抹这种药膏，然后再去亲吻湖蛙，不然你的嘴上会长疣的。', '', '', '', '', '', '', 26365),
(13733, 'zhCN', '冠军诞生', '与银色比武场的裁决者玛蕾尔·图哈特谈一谈。', '恭喜你，$n。你已经掌握了多种战斗技巧，完成了你遇到的所有挑战。毫无疑问，你已经做好了准备，可以迎战来自各个主城的冠军了。$B$B裁决者玛蕾尔·图哈特要与你谈谈，$n，她会正式批准你参加总冠军的角逐。', '', '', '', '', '', '', 26365),
(13729, 'zhCN', '勇士的挑战', '与侍从丹尼谈一谈，他会为你安排对手。击败银色勇士之后，回到银色比武场，向死亡猎手维瑟里复命。$B$B如果你丢失了长枪，可以在夺日者大帐或者兽栏附近的长枪架上再拿一根。', '你很快就可以完成训练，参加总决赛了。为了证明你有资格拥有这种荣誉，你必须击败银色北伐军的一名冠军。$B$B到大帐外面的兽栏旁去，拿上一把长枪，跨上你的坐骑。然后到场地西侧的银色勇士赛场去找侍从丹尼。当你做好战斗的准备之后，他会为你召来对手。$B$B这场战斗结束之后，我们再好好谈谈。', '', '', '', '', '', '', 26365),
(13709, 'zhCN', '雷霆崖的勇士', '如果你想要成为雷霆崖的勇士，就再找鲁诺克·蛮鬃谈一谈。', '欢迎你，冠军。作为雷霆崖代表团的总冠军，我很荣幸地邀请你加入我们的行列，你是否愿意呢？$B$B你可以像以前一样训练并提升自己的级别，不过如果你获得了雷霆崖冠军的称号，就可以在参赛时让你的侍从打出我们的旗帜。', '', '', '', '', '', '', 26365),
(13684, 'zhCN', '暴风城的勇士', '与银色比武场的雅克布·奥勒留斯元帅谈一谈，成为暴风城的勇士。', '$n，你证明了自己有资格代表暴风城作战。现在你应该去和雅克布·奥勒留斯元帅谈一谈，他是暴风城代表团的领队。作为暴风城的总冠军，他会安排你代表暴风城参加锦标赛，并监督你进行训练，以通过勇士的考验。$B$B和你一起工作是我的荣耀，$n，在今后的战斗中也祝你好运。', '', '', '', '', '', '', 26365),
(13398, 'zhCN', '巨龙的墓地', '辛达苟萨之墓的米斯希尔萨·阿奈尔要你收集6份雏龙的骨灰。', '曾经有一群蓝色的巨龙死在这里。现在，他的仆从正在逐个复活它们。$B$B他亲自复活了其中最大的一条龙。给我从雏龙身上弄一些骨灰下来，我会向你展示他是如何复活那条龙的。', '', '', '', '', '', '', 26365),
(13396, 'zhCN', '徒劳', '返回破天号，向萨萨里安复命。', '现在你明白了吗？派你们的人去对付王子的部队，只会让他们获得更多的士兵。$B$B我也不指望你能明白……你的下场或许会和其他人一样。你还是回到派你来的人身边去吧，他们可能在担心你了。', '', '', '', '', '', '', 26365),
(13394, 'zhCN', '竭尽全力', '使用整修过的攻城车，在失落希望之谷里消灭150只腐朽的食尸鬼、20个霜颅大法师和2个白骨巨人。完成任务之后前往第一军团前线营地，与米斯希尔萨·阿奈尔谈一谈。', '你要用这台机器去对付天灾军团？你这样是无法胜过他们的。$B$B你或许可以消灭几百个敌人……甚至几千个，但你无法取得胜利。这样不行。$B$B等你摆弄够了这台机器，可以到北边来找我。那里有一座旧军营。我会让你认识到，你要面对的是怎样的敌人。', '', '', '', '', '', '', 26365),
(13392, 'zhCN', '返回地面', '返回破天号，向萨萨里安复命。', '现在你该走了。我身后有一道传送门，它可以把你送到地面上去。$B$B我们还会见面的。他会来找你。$B$B他迟早会找到你。', '', '', '', '', '', '', 26365),
(13391, 'zhCN', '藏匿行踪', '米斯希尔萨·阿奈尔要你收集3份无面者之血。', '你不该碰它的。但你已经碰过了，他很快就会来找你。$B$B他一定会找到你，除非你能躲藏起来，不让他发现。$B$B如果你还想活下去，就去弄一些无面者的鲜血回来！', '', '', '', '', '', '', 26365),
(13390, 'zhCN', '黑暗中的声音', '在纳扎纳克：遗忘深渊里调查这个声音的来源。', '这东西根本不是水晶，而是某种被寒冰包裹的器官。$B$B当你碰到它的时候，你的手上传来一阵剧痛。你觉得自己的手仿佛被砍掉了一样，但却看到不任何伤口。$B$B当你再次集中精神时，你听见附近有一个小男孩的声音在飘荡。$B$B“你真的不该那么做的。”', '', '', '', '', '', '', 26365),
(13389, 'zhCN', '引线太短', '在你被杂物砸中的地方寻找线索。', '在你点燃引线的时候，你发现它的燃烧速度比你想象中的要快了许多。$B$B炸弹就要爆炸了，只有马上跳进深坑，并且不被炸下来的杂物砸到，你才有可能活下来。', '', '', '', '', '', '', 26365),
(13388, 'zhCN', '引爆！', '冰冠堡垒下面的肯达尔上尉要你前往附近的萨隆邪铁炸弹堆旁边，点燃引线。', '事情进展得非常顺利，准备引爆炸弹吧。$B$B它们就堆在深坑附近。我这就开始疏散人员。', '', '', '', '', '', '', 26365),
(13368, 'zhCN', '片刻不得安宁', '奥格瑞姆之锤的库尔迪拉希望前往奥尔杜萨，杀死升腾者奥鲁麦斯。', '是奥鲁麦斯……他的力量又开始增强了，我能感觉到。现在他的手下正在把能量导入他的灵魂中。$B$B如果让他继续这样不受干扰地吸收能量，他很快就会变成一个强大的对手。$B$B回到奥尔杜萨的北部，在他的大厅中将他的精华、徽记、节杖和长袍组合起来，然后在那里的水晶上面使用他的残骸。$B$B快一点，$r！在他变得更加强大之前消灭他！', '', '', '', '', '', '', 26365),
(13365, 'zhCN', '活动窃听器', '奥格瑞姆之锤的库尔迪拉希望你去收集5份黑暗物质，然后在奥尔杜萨召唤出一名黑暗信使。', '教徒们已经发现了你上次召唤出来的信使，$r。$B$B虽然我们已经得到了大量的情报，但是能够监控诅咒教派的每一步行动对我们非常重要。$B$B前往奥尔杜萨，用这根魔棒从那些被奴役的爪牙的尸体上吸取一些黑暗物质，然后使用诅咒教派的召唤水晶，再帮我们召唤出一个黑暗信使。$B$B在黑暗信使被发现之前，它将一直作为我们的耳目，小心地观察敌人的行动。', '', '', '', '', '', '', 26365),
(13361, 'zhCN', '猎人与王子', '白骨之庭的米斯希尔萨·阿奈尔要你去寻找一块染血的石头，并目睹王子的命运。', '在王子成为国王之前，他经历过很多战斗……但其中只有一场战斗使他差点丢掉性命。$B$B那场战斗就发生在这里。等你看过我向你展示的场景以后，你就都明白了。$B$B从地上拣起一块染血的石头，然后你就可以看到当时的情景了。', '', '', '', '', '', '', 26365),
(13360, 'zhCN', '寻求答案', '前往白骨之庭，与米斯希尔萨·阿奈尔谈一谈。', '你有很多疑问，$n。你是唯一能看见我的人，因为你碰过那件曾经属于他的东西……你不记得了吗？$B$B你还不知道那是什么吗？嗯……我可不能就这么告诉你……那样会让他变得非常愤怒。他已经不再只是个王子了……他是国王！$B$B到冰冠堡垒北边的白骨之庭来找我吧，你可以自己搞明白这一切。', '', '', '', '', '', '', 26365);

INSERT INTO `quest_template_locale` (`ID`, `locale`, `LogTitle`, `LogDescription`, `QuestDescription`, `AreaDescription`, `PortraitGiverText`, `PortraitGiverName`, `PortraitTurnInText`, `PortraitTurnInName`, `QuestCompletionLog`, `VerifiedBuild`) VALUES
(13359, 'zhCN', '巨龙的墓地', '辛达苟萨之墓的米斯希尔萨·阿奈尔要你收集6份雏龙的骨灰。', '曾经有一群蓝色的巨龙死在这里。现在，他的仆从正在逐个复活它们。$B$B他亲自复活了其中最大的一条龙。给我从雏龙身上弄一些骨灰下来，我会向你展示他是如何复活那条龙的。', '', '', '', '', '', '', 26365),
(13355, 'zhCN', '无法复制', '奥格瑞姆之锤的库尔迪拉希望你前往荒凉之门奥尔杜萨，在那里的3处诅咒教徒的大锅中使用分离的药瓶，然后将其交给首席技师考伯克拉。', '我在这里都闻到了他们的大锅散发出的气味，不过锅里煮的并不是瘟疫病菌。$B$B所有宣誓为诅咒教派效力的人都必须饮下一种可以夺走他们的意愿、使他们永远效忠巫妖王的药剂。$B$B有人说，这种药剂中封存着那些受到残酷折磨、并被无情屠杀的生物的扭曲之魂，不过我从来就没能成功地复制过这种药水……$B$B从荒凉之门西北区域的三处大锅里各采集一些样本，装进这只瓶子里，然后把它交给首席技师考伯克拉。', '', '', '', '', '', '', 26365),
(13354, 'zhCN', '指挥体系', '奥格瑞姆之锤的库尔迪拉要你前往荒凉之门奥尔杜萨，击败工头法埃迪斯、工头沙维尔、工头维拉恩和工头夏克尔。', '根据你的报告以及我对诅咒教派的认识，他们在荒凉之门一带的每座营地中都会有一个工头负责管理各项事务。$B$B虽然干掉他们的首领只会让他们暂时受挫，但至少这样可以拖延他们的工作进度，并让他们应接不暇。而且就目前来说，这也是一个足够有价值的成果了。$B$B去找到那些工头，消灭他们之后回来向我报告。', '', '', '', '', '', '', 26365),
(13353, 'zhCN', '从天而“降”', '奥格瑞姆之锤的库尔迪拉希望你从奥尔杜萨的苦痛新兵身上夺取幻象宝珠，然后对那里的3名黑暗压制者使用。', '看来那些新教徒的数量又增加了。你知道该怎么做吧……$B$B新来的教徒在荒凉之门的南端接受训练。他们之中的绝大部分人应该都持有一件特殊的物品——幻象宝珠。$B$B这种宝珠可以用来伪装诅咒教徒，使他们能够安全地自由行动，渗透或是完全伪装成敌人的模样。$B$B去干掉那些蠢货，从他们身上收集幻象宝珠，然后对黑暗压制者使用它。', '', '', '', '', '', '', 26365),
(13352, 'zhCN', '从天而“降”', '奥格瑞姆之锤的库尔迪拉希望你从奥尔杜萨的苦痛新兵身上夺取幻象宝珠，然后对那里的3名黑暗压制者使用。', '诅咒教派控制着荒凉之门，是吗？一点都不出我的意料。$B$B我们来跟他们玩一个小游戏吧。你之前已经注意到了，新来的教徒在荒凉之门的南端接受训练。他们之中的绝大部分人应该都持有一件特殊的物品——幻象宝珠。$B$B这种宝珠可以用来伪装诅咒教徒，使他们能够安全地自由行动，渗透或是完全伪装成敌人的模样。$B$B去干掉那些蠢货，从他们身上收集幻象宝珠，然后对黑暗压制者使用它。', '', '', '', '', '', '', 26365),
(13348, 'zhCN', '徒劳', '返回奥格瑞姆之锤，向库尔迪拉·织亡者复命。', '现在你明白了吗？派你们的人去对付王子的部队，只会让他们获得更多的士兵。$B$B我也不指望你能明白……你的下场或许会和其他人一样。你还是回到派你来的人身边去吧，他们可能在担心你了。', '', '', '', '', '', '', 26365),
(13332, 'zhCN', '构建路障', '破天号的萨萨里安要你使用路障搭设工具建造8处路障。', '一旦我们的部队开始动身穿越奥尔杜萨，他们就很容易遭到来自铁墙壁垒和广袤的冰川平原地区的攻击。$B$B我们没有时间和资源去建造防御工事，但可以搭建一些临时性的路障，抵御天灾军团的远程火力和突击，以保护我们的士兵。$B$B带着这只工具箱到奥尔杜萨西面的陨落英雄之谷去。按照我在那里做好的记号，用这只工具箱制造一些路障。', '', '', '', '', '', '', 26365),
(13329, 'zhCN', '在恐惧之门前', '奥格瑞姆之锤的库尔迪拉·织亡者要你使用强酸溶解6具冰冠劫掠者的尸体。', '战火平原位于科雷萨的前方，铁墙堡垒的南方。巫妖王在这里布置了精锐部队以守卫冰冠堡垒。$B$B一队死亡骑士率领着大群的冰冠劫掠者守住了道路。我担心就算我们打倒了这些劫掠者，天灾军团也能复活它们，并把它们再次投入战场。$B$B我已经有了一个解决方案，不过尚不知道能否奏效。带着这瓶溶液，用它去溶解那些冰冠劫掠者的残骸。', '', '', '', '', '', '', 26365),
(13328, 'zhCN', '击破碎片', '将破损的绝望碎片、破损的恐惧碎片和破损的苦难碎片交给奥格瑞姆之锤的库尔迪拉·织亡者。', '巫妖王的手下在科雷萨的墙头安装了三种水晶，分别是绝望碎片、恐惧碎片和苦难碎片。一旦我们的部队抵达科雷萨城下，他就会使用这三种水晶进行攻击。$B$B如果让这些水晶完全发动，士兵们的精神就会被痛苦和恐惧压垮。这样一来，天灾军团就可以轻易消灭他们。$B$B去找到那些碎片，摧毁它们，把水晶给我带回来。我们不能让这些武器留在巫妖王手里！', '', '', '', '', '', '', 26365),
(13316, 'zhCN', '科雷萨的守卫者', '奥格瑞姆之锤的库尔迪拉·织亡者要你去杀死5个恐惧先驱和5个科雷萨守卫者。', '科雷萨又被称为恐惧之门，它是挡在我们与冰冠堡垒之间的最后一道屏障。它位于铁墙壁垒的南方，要越过冰川和战火平原才能抵达。当我们的部队开进那里以后，他们可能会遭到严重减员，甚至更糟。$B$B我们一定要削弱科雷萨的防御力量，不然我们的部队只会在它的城墙上撞得头破血流。$B$B科雷萨的城头上布署着巫妖王手下最凶狠、最狂热的仆从。你要尽量消灭这些守卫，希望这么做能有点用。', '', '', '', '', '', '', 26365),
(13314, 'zhCN', '获取情报', '从奥格瑞姆之锤斥候身上截获6份奥格瑞姆之锤急件，把它们交给破天号上的高级指挥官加斯汀·巴雷特。', '部落最近表现得很活跃，我讨厌这样。自从破碎前线的那次行动以后，他们已经开始变得越来越猖狂了。联盟必须阻止他们。$B$B他们在冰冠冰川的上空、奥尔杜萨和铁墙壁垒的西面有频繁的活动，斥候和传令兵骑着龙鹰进进出出，不断传递情报和命令。带上这把镖枪，用它去干掉那些奥格瑞姆之锤斥候。如果你也骑着飞行坐骑的话，这个任务应该更容易完成。', '', '', '', '', '', '', 26365),
(13313, 'zhCN', '遮挡天空', '使用SGM-3摧毁6架破天号侦查机，然后向奥格瑞姆之锤的掠天者考尔姆·黑痕复命。', '联盟已经向位于奥尔杜萨西面的陨落英雄之谷和冰冠冰川上空派出了一支侦察部队。$B$B这场战争绝对不能由他们来主导。首席技师考伯克拉向我提供了一种武器，可以完美解决这个威胁。他管这种新导弹叫做SGM-3。他向我保证，这种导弹肯定能一举打下联盟的飞行器。去用这种新式武器帮我们取得领先吧。', '', '', '', '', '', '', 26365),
(13305, 'zhCN', '竭尽全力', '使用整修过的攻城车，在失落希望之谷里消灭150只腐朽的食尸鬼、20个霜颅大法师和2个白骨巨人。完成任务之后前往第一军团前线营地，与米斯希尔萨·阿奈尔谈一谈。', '你要用这台机器去对付天灾军团？你这样是无法胜过他们的。$B$B你或许可以消灭几百个敌人……甚至几千个，但你无法取得胜利。这样不行。$B$B等你摆弄够了这台机器，可以到北边来找我。那里有一座旧军营。我会让你认识到，你要面对的是怎样的敌人。', '', '', '', '', '', '', 26365),
(13281, 'zhCN', '中和瘟疫', '奥格瑞姆之锤的库尔迪拉·织亡者希望你前往莫德雷萨，将脊骨脓液倒进那里的天灾之锅。$B$B你可以使用从起脓的血肉巨人身上收集而来的脊骨制造脓液。', '没有我的帮助，你也可以中和敌人的天灾之锅了，$r。$B$B去消灭死亡之门一带的血肉巨人，用它们脊骨中的脓液中和瘟疫。$B$B你所打击的是敌军最重要的核心部分。这是一个重要的任务——对我们的事业而言生死攸关的任务。只要时间允许，就应该尽力去完成。$B$B记住，你可以在莫德雷萨找到血肉巨人和天灾之锅。', '', '', '', '', '', '', 26365),
(13263, 'zhCN', '引线太短', '在你被杂物砸中的地方寻找线索。', '在你点燃引线的时候，你发现它的燃烧速度比你想象中的要快了许多。$B$B炸弹就要爆炸了，只有马上跳进深坑，并且不被炸下来的杂物砸到，你才有可能活下来。', '', '', '', '', '', '', 26365),
(13242, 'zhCN', '黑暗的骚动', '在战场上收集萨鲁法尔的战甲，然后前往北风苔原的战歌要塞，将它交给萨鲁法尔大王。', '黑暗的力量在骚动，$n。一场只有时空之王才可能预见的悲剧发生了。很快，悲伤与仇恨将笼罩着你的同胞。战争迫在眉睫。$B$B红龙军团已经尽了最大的努力，接下来就要靠艾泽拉斯的凡人种族了。$B$B很遗憾，你的旅程将由这场悲剧开头。就在今天，一位父亲永远地失去了他心爱的孩子。你必须将这个悲伤的消息告诉他。找回小萨鲁法尔的战甲，将它交给萨鲁法尔吧。', '', '', '', '', '', '', 26365),
(13229, 'zhCN', '我还没死！', '护送卡玛洛斯神父逃离险境，然后向奥格瑞姆之锤的凯尔坦修士报告。', '圣光对我微笑了，我还没死在这个人间地狱中。但是如果我再不逃走的话，天灾军团就会杀了我，把我撕成碎片，用来制作它们的“产品”。$B$B我一个人是没办法逃走的，$c。不过如果有你的帮助，或许我还可以活下来，继续与天灾军团作战。$B$B趁着天灾军团的屠夫还没来杀我，你能帮我逃出去吗？', '护送卡玛洛斯神父逃离险境', '', '', '', '', '去找冰冠冰川奥格瑞姆之锤号上的凯尔坦修士。', 26365),
(13196, 'zhCN', '骨头和箭矢', '冬拥湖的制弓师兰多尔弗要你前往阴影森林，从部落玩家那里抢夺10支龙骨箭。', '龙这种生物真是个奇迹！好吧，至少它们的骨头是个奇迹！我给弓箭手们配备了龙骨制作的箭头。可惜，自从安加萨发生大屠杀以后，就很难从龙骨荒野弄到龙骨了。$B$B不过冬拥湖西边的阴影森林里也有不少龙骨，足够我们用的了。$B$B你现在就到阴影森林去，把你能找到的所有骨片都拿回来！$B$B有人看见部落也在那个地区收集骨片。去杀了那些部落渣滓！', '', '', '', '', '', '', 26365),
(13193, 'zhCN', '骨头和箭矢', '冬拥堡垒的维尔隆·火羽要你前往阴影森林，从联盟玩家那里抢夺10支龙骨箭。', '他们干嘛非要派我来武装弓箭手呢？我是个吟游诗人，不是游侠！唉，抱怨是没有用的。$n，我需要一些制作箭头用的龙骨。$B$B你可以到冬拥湖西边的阴影森林去找。自从上次战斗过后，联盟就在那里搜集龙骨。杀了他们，夺走他们手中的龙骨。$B$B如果这招不管用，你或许可以从那里的幽灵身上得到一些。我听说他们喜欢用龙骨把猎物穿起来。', '', '', '', '', '', '', 26365),
(13190, 'zhCN', '黄金时代', '纳尔苏深渊的拆解者基里克斯希望你弄到一具安卡哈看守者的尸体，将其放在安卡赫特的安卡赫特火盆上焚烧。$B$B这个任务只能在英雄难度下完成。', '安卡赫特，我们的起源之地……$B$B我梦想着有一天可以战胜那些笼罩着我们古老家园的死亡和黑暗的力量。为了让我的梦想变为现实，我想到一个计划，可以动摇敌人的军心。$B$B我们要烧死他们那珍贵的看守者！$B$B在城市深处的火盆上焚烧他们的尸体，让那种味道在空气中弥漫，让我们的敌人知道其实他们是如此的不堪一击。$B$B记住，$c！那些亡灵的尸体非常易碎，而且会很快腐坏。', '', '', '', '', '', '', 26365),
(13174, 'zhCN', '一片狼藉', '将哭泣采掘场文档、哭泣采掘场账目、哭泣采掘场地图和哭泣采掘场进度表交给暗影拱顶的克里托斯·血刃。', '终止他们的运作只是计划的一部分，我们的另一个重要目标是找出萨隆邪铁的去向。我们已经知道了一部分矿石的流向，但其巨大的产量说明，敌人正在酝酿着一个更大的计划。$B$B你进入采掘场以后要注意搜集他们的文件。如果你是坐着狮鹫去进行突袭的，可以在完成任务后降落。', '', '', '', '', '', '', 26365),
(13172, 'zhCN', '混乱之种', '暗影拱顶的克里托斯·血刃要你前往哭泣采掘场，杀死80个亡灵。与他对话就可以获得进攻用的骷髅狮鹫。', '很有用的工具，不是吗？你已经削弱了他们的防御力量，$c。现在我们可以发起总攻了。$B$B计划很简单，我们要摧毁一切会移动的东西，并趁着混乱窃取一些情报。$B$B准备好以后再来找我，我会给你一头骷髅狮鹫。', '', '', '', '', '', '', 26365),
(13171, 'zhCN', '来去无踪', '暗影拱顶的克里托斯·血刃要你去摧毁10枚天灾污染水晶。', '我最关心的是西南方的萨隆邪铁采掘场，他们正从那里源源不断地运出大量矿石。我想知道他们到底想要造出什么东西来。所以呢，我们要从削弱他们的防御力量开始入手。$B$B我注意到采掘场中散布着一些水晶，估计那是某种类似通灵塔的防御装置。你要利用幻象观察者去摧毁那些水晶。', '', '', '', '', '', '', 26365),
(13160, 'zhCN', '壮观的景象', '苦难高地的狡诈者维雷斯要你使用轻盈追迹者的跳跃能力，杀死12只熟睡的冰肤斥候。', '石像鬼既是出色的斥候，也是致命的空中作战单位，但是它们有一个明显的弱点。大部分石像鬼都需要在石头状态下进行长时间的休眠，补充足够的能量，否则就无法拖着沉重的身体飞行。$B$B我曾经通过统御之眼观察过，玛雷卡里斯东面和南面的城墙上栖息着许多冰肤斥候。你可以利用追迹者高高跃起，跳到冰肤斥候身边，趁它们熟睡时干掉它们。', '', '', '', '', '', '', 26365),
(13147, 'zhCN', '煽风点火', '苦难高地的狡诈者维雷斯要你趁阴暗蛮徒靠近低级亡灵时，利用轻盈追迹者向阴暗蛮徒投掷石块。挑起5起争端之后回去复命。', '瓦古和低级亡灵奴仆的最大差别在于，瓦古还保留着一定的自主意识，这表现在它们依然非常蔑视体力劳动，不愿和骷髅或是食尸鬼一起工作。$B$B我们可以利用这种天生的抵触情绪，在玛雷卡里斯的阴暗蛮徒和其它亡灵之间挑起争端。这可以减缓它们的工作进度，让那些死亡骑士下来收拾局面。$B$B很简单——只要在阴暗蛮徒靠近低级亡灵时对蛮徒投掷石块就行了。', '', '', '', '', '', '', 26365),
(13116, 'zhCN', '荠菜热狗！', '在空午餐篮里装入你烹制的4份犀牛热狗，外加你在达拉然草地上找到的4片野芥菜。$B$B将芥菜热狗篮交给达拉然城克拉苏斯平台的大法师伯塔鲁斯。', '大法师伯塔鲁斯正准备去观看疯狂的战球比赛，不过他想要一些观赛时吃的食物。$B$B你要准备4份犀牛热狗，然后从达拉然的草地上摘4片野荠菜，把它们放进他的午餐篮里。$B$B用美食塞满他的午餐篮吧，朋友。', '', '', '', '', '', '', 26365),
(13109, 'zhCN', '势不两立', '丹尼芬雷的约库姆国王要你进入闪电大厅，击败沃尔坎。', '我要坦白告诉你，小$r。自从我们与托里姆的盟约破裂后，我的族人已经变了。$b$b作为他们的首领，我最希望他们心灵的创伤能够愈合，我们与风暴之王的友谊能够恢复。在你击败弗约恩之后，我们已经向这个目标迈进了一大步。我要请你帮助我们更进一步……$b$b有一个比弗约恩更强大的敌人住在闪电大厅里，他威胁到了我们的生存。沃尔坎和我们之间，只有一个能活下来。', '', '', '', '', '', '', 26365),
(13108, 'zhCN', '不惜代价！', '丹尼芬雷的约库姆国王要你进入闪电大厅并击败洛肯，然后将洛肯的信物带回去给他。', '无论如何，洛肯一定要死。$b$b如果我不得不亲手撕碎他，那么他很快就会为自己的恶行付出代价。$b$b若是你碰巧赶在我前面遇到他，击败他的荣耀就全归你了。$b$b把他的信物带给我，我会祝福并感谢你的。', '', '', '', '', '', '', 26365),
(13103, 'zhCN', '兰尼德的奶酪', '把空的奶酪盘、“再来一杯”奶酪店的陈年达拉然干酪、以及在达拉然的桌子上找到的6只半满的达拉然酒杯放在一起。$B$B将美酒和奶酪盘交给魔法商业区制皮店中的兰尼德·怒金。', '达拉然制皮店的兰尼德·怒金突然想要一些酒和奶酪。$B$B从达拉然市中心的“再来一杯”奶酪店的架子上收集一些奶酪，然后在城中的随便什么桌子上找一些半满的酒杯。把酒混在一起倒进瓶子，然后把它和奶酪一起交给兰尼德。$B$B我肯定他不会发现的。', '', '', '', '', '', '', 26365),
(12811, 'zhCN', '绝望的研究', '到沙塔斯城的圣光广场去，与新药剂师营地中的大药剂师普特雷斯谈一谈。', '$n，巫妖王的入侵使我们深受其害。为了将他赶回冰封王座，部落和联盟必须坚定地团结在一起。我们在沙塔斯城的圣光广场结成了联军。$B$B为了帮助我们对抗巫妖王，请你到圣光广场的新药剂师营地去，和大药剂师普特雷斯谈一谈，制止亡灵瘟疫的研究就是由他主持的。只有他的研究成果才能拯救我们。$B$B快去吧，$n。每时每刻都有无辜的生命死去。', '', '', '', '', '', '', 26365),
(12782, 'zhCN', '绝望的研究', '到沙塔斯城的圣光广场去，与新药剂师营地中的大药剂师普特雷斯谈一谈。', '$n，巫妖王的入侵使我们深受其害。为了将他赶回冰封王座，部落和联盟必须坚定地团结在一起。我们在沙塔斯城的圣光广场结成了联军。$B$B为了帮助我们对抗巫妖王，请你到圣光广场的新药剂师营地去，和大药剂师普特雷斯谈一谈，制止亡灵瘟疫的研究就是由他主持的。只有他的研究成果才能拯救我们。$B$B快去吧，$n。每时每刻都有无辜的生命死去。', '', '', '', '', '', '', 26365),
(12761, 'zhCN', '掌握水晶', '拿到灵鳍湾的防御水晶，借助水晶的力量杀死附近的50个狂心狼獾人。完成任务后向灵鳍湾的唤雷者索乌米特复命。', '狗狗人并未停止对灵鳍湾的攻击……如果我们不加阻拦的话，他们是不会罢手的。我们有秘密武器……我们把它交给了索乌米特，让他保护所有的鳄鱼人。$B$B秘密武器是伟大的造物主留下的……我们在神圣的造物主祭坛中找到了这些闪闪发光的水晶。你要当心……别弄碎了。$B$B水晶就放在西南方灵鳍湾神殿附近的箱子里。你要用水晶帮助索乌米特打败狗狗人。', '', '', '', '', '', '', 26365),
(12744, 'zhCN', '特殊的怜悯', '赤色烈焰礼拜堂的骑士团指挥官普雷菲斯特希望你去探视牢房里的银色黎明俘虏，多诺凡·普弗斯特，并结束他的痛苦。', '我们来到这里，将这个地方夷为平地，然后向牢房走去。在那里看到的一切完全出乎我们的意料，$n。看来血色十字军真是很忙碌。那里塞满了银色黎明的俘虏，当我们到达的时候，其中的大部分人都已经感染瘟疫死去了，但少数人还有呼吸。$B$B里面有一个矮人，他感染了瘟疫，已经活不长了。去结束他的痛苦吧。', '', '', '', '', '', '', 26365),
(12732, 'zhCN', '日灼之力', '将一瓶日灼精华交给狂心岭的雷耶克。', '总有一天，雷耶克会强壮起来成为伟大的战士，你很快就会看到这一天。$B$B这个瓶子给你，你带上它去遥远的西方，到日灼之柱的顶端，把那里的水装进瓶子。$B$B接着你要去盆地的北部边境，到埋骨地以北的台地去。找到并击败血爪鹏王。$B$B取得它的精华元素后拿回来给雷耶克。', '', '', '', '', '', '', 26365),
(12481, 'zhCN', '骂阵', '在拜尔海姆对布约恩·哈古德森朗读维库人的脏话，然后把他引到林德尔的伏击点，帮助林德尔杀了他。', '维库人在这事上确实处理得很聪明，幸好我还有其它办法。$B$B他们的首领布约恩非常暴躁。我们用他们的语言拼出了几句脏话，好像提到了他的母亲和大型家畜之类的……我们自己也不是很明白。$B$B把这张纸上内容给他念一念。一旦他追过来，你就把他引到这里来。我们绝对不能让他再活着回去。', '', '', '', '', '', '', 26365),
(12432, 'zhCN', '驾驶红色火箭', '风险湾灯塔的高洛克将军希望你去摧毁联盟的木材运输船。$B$B只有在部落占领灯塔的时候，高洛克将军才会出现。', '就是你，$c！给我滚过来！$b$b联盟已经在这里的东北方装了满满一船的木材，正准备把它们运出去。既然我们没法夺走那些木材，那么就只有一个选择了——摧毁它！$b$b码头尽头的地精已经准备好了一些鱼雷，你可以在停泊在北边的地精船只上搞到开动鱼雷所需的燃料。$B$B去弄些燃料，然后驾驶一枚鱼雷冲向他们的运输船。$B$B出发！', '', '', '', '', '', '', 26365),
(12428, 'zhCN', '征服斗兽场：疯狂的熊怪', '击败征服斗兽场内的托尔格·雷霆图腾，然后找赌徒维尔金领取奖赏。', '你不错嘛。相当不错嘛。$B$B不过，你敢弄翻一头熊怪吗？敢吗？诺森德本地的超大体型熊怪哦？$B$B好，很好，非常好，来，叫上你的伙伴，进竞技场吧。让那些观众们好好高兴高兴……没准我们等下就能赚一笔啦。', '击败托尔格·雷霆图腾', '', '', '', '', '去灰熊丘陵找征服堡的赌徒维尔金。', 26365),
(12338, 'zhCN', '糖罐', '', '', '', '', '', '', '', '', 26365),
(12198, 'zhCN', '……我们没有能源', '用10个闪电斥候身上的能量给你的作战魔像充电，然后向欧尼瓦营地的勘探员罗卡尔复命。', '现在所剩的电量只能以最低标准来启动魔像，根本不能启动任何战斗系统。$B$B不过有个好消息，在丹厄古尔的周围有一些闪电斥候来回巡逻，我们应该可以利用它们的能量来给魔像的武器系统充电。$B$B带着魔像去干掉那些闪电斥候，在斥候被摧毁之后，魔像会吸收它们释放出来的能量。', '', '', '', '', '', '', 26365),
(12073, 'zhCN', '“钢铁之子”', '杀死10名守卫索尔莫丹的铁矮人，然后向欧尼瓦营地的斥候沃塔肯复命。', '在灰熊丘陵，我们要面对的敌人不仅仅是联盟。尽管索尔莫丹几乎已经快被那些石巨人给踏平了，可是铁矮人目前还是牢固地掌握着东海岸一带。$B$B在格斗中，一位富有技巧与经验的战士都知道利用敌人身上的弱点，那么在战略角度上，我们如果忽视了铁矮人在索尔莫丹那边暴露出来的弱点，就显得太愚蠢啦。不要心怀任何仁慈，杀光所有胆敢反抗的家伙。$B$B那些所谓的“钢铁之子”要学会对部落心怀恐惧与敬畏。', '', '', '', '', '', '', 26365),
(11790, 'zhCN', '隐藏的诅咒教徒', '与无畏要塞内的斩雷号战舰上的“左撇子”鲁格塞尔船长谈一谈。', '这座祭坛上画满了诅咒教派的符号。显然这些狂信徒们已经从主大陆渗透到了诺森德。你最好去通知船长。$B$B他也许在甲板上。', '', '', '', '', '', '', 26365),
(11499, 'zhCN', '悬赏：凯尔萨斯王子的徽记之戒', '商人扎雷姆要求你夺得凯尔萨斯王子的徽记之戒。将戒指带回沙塔斯城的贫民窟交给他，就能领取奖赏。$B$B该任务只能在英雄模式的魔导师平台完成。', '$C，今天我要让你执行一件几乎不可能完成的任务。今天，你必须得到血精灵之王凯尔萨斯的徽记之戒。$B$B没错，这是真的，有谣言说他其实没有死在风暴要塞，而是被某些邪恶的手段救活了回来。他上一次再度出现是在奎尔丹纳斯岛上的魔导师平台。至于他在那里做些什么，就让别人来告诉你吧。反正我只知道有无数的收藏家在询问我要多少钱才能买到他的戒指，所以我决定先把戒指搞到手再说。$B$B或者说，我决定让你先帮我把戒指搞到手再说。', '', '', '', '', '', '', 26365),
(11498, 'zhCN', '学习飞翔', '与影月谷影月村的欧尔洛克谈一谈。', '尽管这很可能会影响到我在这里的生意，但你看上去像是那种梦想着能驾驭自己的坐骑在天空翱翔、而不仅仅是坐着商务飞龙之类的玩意儿飞来飞去的家伙。$B$B我完全理解你的这种想法。$B$B我的朋友，你需要去影月谷西北角的影月村。等你到了那里，去和欧尔洛克谈谈关于飞行训练的事。我得提醒你，他的训练并不便宜。不过，我相信你会了解到它的价值。', '', '', '', '', '', '', 26365),
(11416, 'zhCN', '巨鹰之眼', '乌尔芬要你去拿到巨鹰之眼。完成任务后，穿着斗篷回到裂木森林向他复命。$B$B如果你弄丢了座狼伪装，可以去找观察者莉莎·月叶再要一件。', '迦瓦尔用一种奇怪的魔法隐藏了自己的踪迹。除非他自己愿意，没有人能看见或闻到他。但我们也许能有办法。$B$B我的敌人，那头名叫塔隆斯里克的鹰，据说有一双能看穿一切的眼睛。如果你能拿到她的眼珠，就一定能看见迦瓦尔。$B$B塔隆斯里克的巢穴在维库人的据点斯克恩西南方的一条瀑布底下。只要你去翻动鹰巢里的卵，她就会从天空冲下来攻击你。$B$B把她的眼珠给我带回来。', '', '', '', '', '', '', 26365),
(11414, 'zhCN', '兄弟的背叛', '乌尔芬要你去杀死背叛他的座狼，比奥莫弗和瓦尔戈。完成任务后，穿着斗篷回到裂木森林向他复命。$B$B如果你弄丢了座狼伪装，可以去找观察者莉莎·月叶再要一件。', '我梦见过观察者莉莎·月叶！如果你是她的朋友，那么你也是我的朋友。$B$B直到上一次月圆之夜前，我一直都是族群里的头狼。后来，那头奇怪的白狼，迦瓦尔，从北方来到了这里。在我曾经的兄弟们的帮助下，他很快成了新的头狼。他非常奇怪，很不正常。$B$B如果你想帮我，就先去杀掉那些背叛我的家伙。$B$B比奥莫弗到钢铁之门的西北方去捕猎了，瓦尔戈则在东南方的西部长矛塔楼附近。$B$B他们能轻易识破你的伪装。', '', '', '', '', '', '', 26365),
(11384, 'zhCN', '悬赏：扭木碎片', '商人扎雷姆要求你夺得一份扭木碎片。将碎片带回沙塔斯城的贫民窟交给他，就能领取奖赏。$B$B该任务只能在英雄模式下完成。', '不久之前，一位卡多雷德鲁伊曾请求过我，喔，真的很令人同情。当然，开价也不错！$B$B总之，达纳苏斯方面希望能让一株叫作跃迁扭木的古树获得新生。目前，这棵树陷入了精神的混乱或是说污染，我不太确定。总之，你可以在风暴要塞的生态船那边找到。$B$B哦，她还说，她们只需要一小条嫩枝就可以使它重生。', '', '', '', '', '', '', 26365),
(11373, 'zhCN', '悬赏：沙法尔的精致饰物', '商人扎雷姆要求你夺得沙法尔的精致饰物。将饰物带回沙塔斯城的贫民窟交给他，就能领取奖赏。$B$B该任务只能在英雄模式下完成。', '今天，我有一个私人请求想要委托你去处理，当然，难度也会跟酬劳成正比。$B$B怎么说呢，我的家族跟节点亲王沙法尔还有他的那群手下有点“往事”。如果你能把他的饰物带到我这里来，我就可以确认他已经被妥当地“处置”了。$B$B怎么样，如果我开出的赏金对你还算有诱惑的话，就到奥金顿的法力陵墓去找他吧。', '', '', '', '', '', '', 26365),
(11363, 'zhCN', '悬赏：刃拳的印记', '商人扎雷姆要求你夺得刃拳的印记。将印记带回沙塔斯城的贫民窟交给他，就能领取奖赏。$B$B该任务只能在英雄模式下完成。', '今天我接待了一名腰缠万贯的收藏家，这位贵客想要购买某件特殊的器物。$B$B酋长卡加斯·刃拳总是随身携带着一枚印章，用来签署各类官方文件。我要你替我夺回这东西。$B$B卡加斯·刃拳就在破碎大厅深处。毫无疑问，你需要铲除大量兽人杂兵才能到达酋长面前，不过我深信你会凯旋的。', '', '', '', '', '', '', 26365),
(11359, 'zhCN', '击败麦加利斯', '击败麦加利斯，然后返回维德瓦堡垒，向研究员艾德兰复命。', '在缚石者穆迪斯改造出的符文巨人中，拥有强大力量的麦加利斯脱颖而出，成为巨人迁徙行动的领头者。只要击败麦加利斯，巨人就会像无头苍蝇一样丧失方向。远征军赶来后，我们的士兵就能逐个消灭剩余的巨人，将铁矮人驱逐出巨人平原。$B$B前往巨人平原的北部边界，在霜刃峰的丘陵地带搜寻麦加利斯的下落并击败他！', '', '符文巨人首领。', '麦加利斯', '', '', '', 26365),
(11358, 'zhCN', '破碎石板', '维德瓦堡垒的研究员艾德兰要你对符文样本与破碎石板进行比较。', '如果能查明是什么东西诱使巨人朝西北方迁徙，我们或许可以设法阻止他们。$B$B虽然我破译了你取回的样本上的一部分符文，但是我更想了解那些我没看懂的文字的含义。我曾经在巨人平原东北部，与霜刃峰的雪原交界处见过一块巨大的残破石板。带上这份样本，去与那里的石板进行比较，看看能不能有所发现。', '', '', '', '', '', '', 26365),
(11355, 'zhCN', '巨人的迁徙', '维德瓦堡垒的研究员艾德兰要你在4个符文石巨人的尸体上使用符文搜寻之锄。', '东边的巨人平原起了骚动，刻有符文的石巨人开始往北边的霜刃峰迁徙。我不知道他们的目的地是哪儿。$B$B刻在他们身上的符文散发着诡异的光芒，驱使他们前进。如果你能击倒巨人，从他们体表剥下一些符文，符文的效力就会消散，便于我们展开研究。$B$B利用这把锄从巨人身上剥下一些符文石板，然后把它们给我带回来。', '', '', '', '', '', '', 26365),
(11349, 'zhCN', '掌控符文', '将一套铁符文雕刻工具交给维德瓦堡垒的勘测员贝瓦尔。', '我这倒是有锄头、铁锤和凿子什么的，可惜它们不能雕刻符文。铁矮人使用的雕琢工具就不一样啦，他们在铸造工具时向里面灌注了魔法力量。$B$B使用这样的工具进行雕刻，符文就不仅仅是简单的字符了，它们具备了束缚、支配与扭曲的力量。$B$B这些我都了然于心，眼下就缺少雕琢工具进行实践了。前往巨人平原的铁矮人营帐附近寻找工具箱，把它们带回来给我。', '', '', '', '', '', '', 26365),
(11348, 'zhCN', '命令符文', '维德瓦堡垒的勘测员贝瓦尔要你去测试命令符文，并击败缚石者穆迪斯。', '我在这块石板上刻了几行符文，你能感受到它们所散发的能量吗？和铁矮人使用的符文相比，这些符文较为低等。但是我们依然可以利用它们粉碎铁矮人的阴谋。$B$B带上符文前往巨人平原，对一个尚未被改造的石巨人使用符文。$B$B在符文的作用下，石巨人会听从你的指挥并逐渐恢复原有的力量。接下来，你要在他的帮助下击败缚石者穆迪斯，这家伙就是盘踞在巨人平原的铁矮人领袖。', '', '', '', '', '', '', 26365),
(11303, 'zhCN', '伏击', '前往林德尔的伏击点，与林德尔谈一谈。', '拜尔海姆的维库人已经彻底失败了，毫无疑问。可是他们的首领还藏在镇上，拒绝投降。$B$B戈斯已经派林德尔和他的刺客到西北方去埋伏了。你去和林德尔说话，告诉他怎么把维库人指挥官引出来。杀了他。你一定要杀了他。', '', '', '', '', '', '', 26365),
(11302, 'zhCN', '神秘的冰雪树妖', '与冰雪林地的鲁莉尔蕾谈一谈。', '我们第一次到达这附近为要塞选址的时候，曾经在北边的两处林地附近遇到了一些怀有敌意的生物。再后来，我们穿越镇子南边的那块被冰雪覆盖的林地时，又遇到了几只饶有兴趣地观察着我们的树妖。不过，跟北边那些林地里的不同，她们没有攻击我们。$B$B当时，我们被这里的鬼天气折磨得晕头转向，而且又饿又累，她们完全可以不费吹灰之力就把我们杀个精光，可她们没有那么做。$B$B或许我们应该主动和她们接触一下，去争取所有能够争取到的盟友？你愿意前往冰雪林地，向她们表达我们的友善之意吗？', '', '', '', '', '', '', 26365),
(11285, 'zhCN', '拜尔海姆在燃烧！', '戈斯中士要你前往拜尔海姆，使用戈斯的火把烧毁1座蔑冬民房、1座蔑冬瞭望塔、1座蔑冬桥梁和1座蔑冬兵营。', '光杀死这些维库人还不够。我们应该烧毁他们的房子！嗯……还有桥梁。为了安全起见，还是烧掉整个镇子比较妥当！$B$B带上火把前往西边的拜尔海姆，点燃所有建筑物！狠狠地教训他们。', '', '', '', '', '', '', 26365),
(11283, 'zhCN', '血战拜尔海姆', '戈斯中士要你前往拜尔海姆，杀死16名蔑冬维库人。', '那些维库人源源不断地从西边的镇子里涌来！$B$B戈斯有个法子。你进入那个镇子，杀死那些蔑冬维库人。这样就能阻止他们了！', '', '', '', '', '', '', 26365),
(11220, 'zhCN', '无头骑士', '找到无头骑士的南瓜神龛。', '除非消灭了无头骑士的脑袋，否则他的残暴永远都不会结束。$B$B无头骑士栖息在提瑞斯法林地的血色修道院深处。去那里念出这些句子：$B$B　　骑士啊，醒来吧$B　　末日正向你迈开脚步$B　　死亡没有令你安息$B　　湮灭才是你的归宿！$B$B恶魔将会被唤醒，消灭无头骑士的脑袋，这样他就不会再困扰我们了。', '', '', '', '', '', '', 26365),
(11114, 'zhCN', '佐亚，绿色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11113, 'zhCN', '沃兰纳库，红色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11112, 'zhCN', '苏拉库，青色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11111, 'zhCN', '奥尼克森，黑色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11110, 'zhCN', '玛尔法斯，紫色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11109, 'zhCN', '约鲁斯，蓝色灵翼幼龙', '', '', '', '', '', '', '', '', 26365),
(11108, 'zhCN', '伊利丹·怒风大人', '与伊利丹·怒风会面。如果你有幸活下来，就前往沙塔斯城的贫民窟寻找巴萨姆斯。', '来吧，大领主$n。伊利丹大人正等着你呢！', '与伊利丹·怒风会面', '', '', '', '', '去泰罗卡森林的沙塔斯城找巴萨姆斯。', 26365),
(11107, 'zhCN', '莫格霍尔大王', '与影月谷龙喉营地的莫格霍尔大王谈一谈。', '我知道我身份低微，根本没有资格直接带口信给您。请您原谅我的无礼。莫格霍尔大王要您立刻前往他的房间接受觐见。', '', '', '', '', '', '', 26365),
(11100, 'zhCN', '指挥官阿库斯', '将龙喉信号枪交给影月谷沙塔尔祭坛的指挥官阿库斯。', '龙喉氏族也就只敢趁我们不备时发动攻击。要是我们有所准备的话，他们肯定没有取胜的机会。$B$B$n，我要你引他们来战。$B$B<希拉点了点头。>$B$B对，没错……这是陷阱。莫格霍尔大王不是给了你一把信号枪吗？将信号枪交给这座建筑物外面的指挥官阿库斯。', '', '', '', '', '', '', 26365),
(11099, 'zhCN', '把他们都干掉！', '将任务的相关情报和龙喉信号枪一起交给沙塔尔祭坛的学者希拉。', '指挥官$n，立正！现在，你将立刻领导一队碎天者前往攻击黑暗神殿西北方的奥尔多哨站——沙塔尔祭坛。只要摧毁了沙塔尔祭坛，我们与库斯卡岗哨之间的补给线就可以重新运作起来了。$B$B快去吧，用这个信号枪指引碎天者展开攻击！', '', '', '', '', '', '', 26365),
(11092, 'zhCN', '你好，指挥官！', '与影月谷龙喉营地的莫格霍尔大王谈一谈。', '$n队长！$B$B<工头瓦尔库勒对你敬了个礼。>$B$B莫格霍尔大王请你立刻前往他的房间接受觐见！', '', '', '', '', '', '', 26365),
(11026, 'zhCN', '放逐恶魔', '前往刀锋山的铸魔营地：天罚或是铸魔营地：恐怖，利用放逐水晶放逐15个恶魔。', '朋友，你来的真是时候！我们需要帮助。做为回报，你会得到某件珍奇的器物，这对你我都有好处。$B$B我们早已摒弃残暴的陋习，但是附近的恶魔对奥格瑞拉和天空卫队的安全造成了威胁。这些恶魔能反复以新的形体重生，简直杀之不尽！$B$B利用这颗水晶打开放逐之门。如果你在传送门附近杀死恶魔，他们的精华就会被卷入传送门中，永远地从这个世界上消失！', '', '', '', '', '', '', 26365),
(11010, 'zhCN', '轰炸任务', '使用天空卫队炸弹炸毁15堆邪能炮弹。', '你有飞行坐骑……这也值得炫耀？你以为自己能熟练驾驭飞行坐骑？$B$B北面的铸魔营地：天罚和南面的铸魔营地：恐怖是我的心腹之患，同样它们也对爱好和平的奥格瑞拉构成了威胁。在邪能火炮的攻击下，天空卫士伤亡惨重，根本无法侦察敌情。$B$B想要证明自己的实力吗？带上这些炸弹，瞄准铸魔营地的邪能炮弹堆投掷吧！当心别被炮弹击中！', '', '', '', '', '', '', 26365),
(10827, 'zhCN', '更多萨格拉斯印记', '', '', '', '', '', '', '', '', 26365),
(10823, 'zhCN', '更多日怒徽记', '', '', '', '', '', '', '', '', 26365),
(10822, 'zhCN', '单枚日怒徽记', '', '', '', '', '', '', '', '', 26365),
(10681, 'zhCN', '古尔丹之手', '与影月谷诅咒祭坛的大地治愈者托洛克谈一谈。', '元素需要你的帮助，$r！影月谷曾遭受过一场难以言喻的灾难。元素之灵至今仍在痛苦中挣扎，现在，这些被激怒的元素之灵已经不愿再继续与大地之环沟通了。$B$B朋友，帮助影月谷恢复原貌吧。$B$B蛮锤要塞东北方便是诅咒祭坛，到那里去，与大地治愈者托洛克谈谈。', '', '', '', '', '', '', 26365),
(10679, 'zhCN', '淬火', '前往古尔丹之手顶部寻找滚烫熔池，将铸成的伊利达雷斩除之刃放入熔岩池中淬火。然后将淬火的伊利达雷斩除之刃交给韦恩的避难所的戴维·韦恩。', '武器就快锻造成功了！$B$B你几乎能感受到钢刃中的魔法力量在慢慢凝聚，只差最后一步了。$B$B前往影月谷内古尔丹之手顶部的滚烫熔池，将铸成的伊利达雷斩除之刃放入熔岩池中淬火，然后再将淬火的伊利达雷斩除之刃带回来给我。', '', '', '', '', '', '', 26365),
(10652, 'zhCN', '深入敌后', '当你准备启程前往法力熔炉：库鲁恩时，就告知维罗妮娅。抵达法力熔炉：库鲁恩后，跟卡勒迪斯·晨光谈一谈。$B$B为占星者完成任务将降低你在奥尔多阵营中的声望等级。', '我已经安排好了，这头双足飞龙会载你飞往密探的藏身之处。准备就绪后立即出发吧。', '', '', '', '', '', '', 26365),
(10603, 'zhCN', '击败战争使者！', '击败战争使者拉索恩，取回拉索恩的命令，然后返回影月村向血卫士古尔穆克复命。', '我们成功地阻止了暗影议会在死亡熔炉的军事扩张行动，现在是彻底肃清这帮家伙的时候了。$B$B我在卡格罗什的背包中找到一把钥匙。看来卡格罗什还是有所收获的。$B$B这把钥匙应该能帮你找到军团要塞的战争使者拉索恩的行踪。$B$B搜寻并击败战争使者拉索恩，然后直接向血卫士古尔穆克复命。可别让他等太久。', '', '', '', '', '', '', 26365),
(10599, 'zhCN', '死亡熔炉', '前往熔渣哨塔向斥候萨格兰报到。', '在你前往军团要塞执行消灭地狱火的任务时，我一直在研究你查探到的情报。要知道，我们没有理由只注意军团要塞，却忽视死亡熔炉那帮蠢蠢欲动的燃烧军团，他们的确在那儿制造地狱火大军。我已经派出侦察小队注意死亡熔炉的动向。$B$B如果我们不采取行动的话，他们很快将重新纠集起新的地狱火大军，数量堪比你在军团要塞炸掉的兵团。$B$B前往东南方的熔渣哨塔，向奉命在那儿监视死亡熔炉的斥候萨格兰报到。', '', '', '', '', '', '', 26365),
(10380, 'zhCN', '黑暗的契约', '图鲁曼的营地中的凯兰恩要你杀死6名甘尔葛迁跃修理师、3名命运之女和3名莫尔葛空间主宰。$B$B为奥尔多完成任务将降低你在占星者阵营中的声望等级。', '$n，两个最危险的敌人已经结为同盟，而我们竟然一无所知！$B$B如果是占星者故意隐瞒这个消息的话，我并不会为此感到惊讶。但是，我们必须面对现实。燃烧军团已经和凯尔萨斯的日怒军团站到了同一阵线上。$B$B凯尔萨斯能够利用风暴要塞的科技，肯定和燃烧军团的恶魔有关。根据欧雷里斯的指示，我命令你立即消灭他们。', '', '', '', '', '', '', 26365),
(10330, 'zhCN', '关闭法力熔炉：库鲁恩', '从工头希兰娜手中夺得库鲁恩控制水晶。对法力熔炉：库鲁恩的控制台使用水晶关闭法力熔炉，然后向卡勒迪斯·晨光复命。$B$B为占星者完成任务将降低你在奥尔多阵营中的声望等级。', '萨罗迪恩告诉我说，你成功地关闭了法力熔炉：布纳尔。他希望能如法炮制地关闭法力熔炉：库鲁恩，因此下令寻找拥有控制水晶的人。我们已经查明工头希兰娜掌管着控制水晶。$B$B去关闭法力熔炉：库鲁恩吧。这次别偷偷摸摸的。直接夺得水晶，关掉法力熔炉，杀死企图阻止你的技师，然后撤退。$B$B快，凯尔的走狗很快就能查到我们的下落。', '', '', '', '', '', '', 26365),
(10323, 'zhCN', '关闭法力熔炉：艾拉', '前往法力熔炉：艾拉，从工头阿扎拉德手中夺得艾拉控制水晶。对法力熔炉：艾拉的控制台使用水晶关闭法力熔炉。$B$B为奥尔多完成任务将降低你在占星者阵营中的声望等级。', '现在仅剩一座法力熔炉来维持整个风暴要塞的能源供给了。如果我们能摧毁法力熔炉：艾拉，凯尔就不得不启用他之前储存的能量。$B$B关闭西北方的法力熔炉：艾拉，给予凯尔萨斯最沉重的一击。$B$B最后一块控制水晶由工头阿扎拉德保管。注意，这是凯尔最后一座仍在运行中的法力熔炉，恐怕你会遭到非常顽强的抵抗。你可能会需要可靠的朋友帮忙。', '', '', '', '', '', '', 26365),
(10322, 'zhCN', '关闭法力熔炉：杜隆', '学者卡尔亚要你前往法力熔炉：杜隆，从工头安萨奈尔手中夺得杜隆控制水晶。对法力熔炉：杜隆的控制台使用水晶关闭法力熔炉。$B$B为奥尔多完成任务将降低你在占星者阵营中的声望等级。', '我们收到消息说，仍在运行的两座熔炉中，日怒血精灵突然失去了对法力熔炉：杜隆的控制。$B$B大群狂乱的法力生物被高速增长的能量流所吸引，冲入了法力熔炉。$B$B如果杜隆发生爆炸的话，很可能引发波及整个外域的大规模连锁反应。你必须从工头安萨奈尔手中夺得控制水晶，并安全关闭法力熔炉：杜隆。', '', '', '', '', '', '', 26365),
(10321, 'zhCN', '关闭法力熔炉：库鲁恩', '前往52区以东的法力熔炉：库鲁恩，从工头希兰娜手中夺得库鲁恩控制水晶。对法力熔炉：库鲁恩的控制台使用水晶关闭法力熔炉，然后向学者卡尔亚复命。$B$B为奥尔多完成任务将降低你在占星者阵营中的声望等级。', '你在布纳尔的成功为我们燃起了新的希望，$n。$B$B我们和占星者分享了最新的发现；作为回报，他们将剩下几座法力熔炉的情况告诉了我们。$B$B目前，仍有三座法力熔炉在运作中，而且都在日怒血精灵的掌控之下。$B$B前往东边的法力熔炉：库鲁恩，从工头希兰娜手中夺得库鲁恩控制水晶。对法力熔炉：库鲁恩的控制台使用水晶，启动紧急关闭装置。$B$B$n，我们都指望你了。', '', '', '', '', '', '', 26365),
(10263, 'zhCN', '协助星界财团', '到虚空风暴去，与52区的虚空猎手卡尔伊谈一谈。', '沙塔斯城的纳鲁一直在寻找着某种能够改变星界财团审事态度的方式。$B$B走运的是，最近这些虚灵和虚空风暴的血精灵们在生意场日益敌对起来，于是我们就有了机会。$B$B星界财团在镇上有一名代表，名叫虚空猎手卡尔伊，他最近惹上了一群变节的虚灵。作为奥尔多的代表，我希望你能去向他提供帮助，让他成为我们的朋友。', '', '', '', '', '', '', 26365),
(10246, 'zhCN', '攻击法力熔炉：库鲁恩', '前往法力熔炉：库鲁恩，杀死8名日怒奥术师和5名日怒研究员，完成任务后向大主教欧雷里斯复命。$B$B为奥尔多完成任务将降低你在占星者阵营中的声望等级。', '你在法力熔炉：布纳尔获得了令人侧目的成就。我敢肯定学者卡尔亚一定希望你在法力熔炉：库鲁恩也有同样优秀的表现。$B$B最近我们得到消息，一大群地位显赫的日怒奥术师和研究者被派驻到了法力熔炉：库鲁恩，我要你以他们为作战目标。如果你能成功的话，这将是对敌人的一次沉重打击。', '', '', '', '', '', '', 26365),
(9838, 'zhCN', '紫罗兰之眼', '与卡拉赞外的大法师奥图鲁斯谈一谈。', '$n，命运已经将重要的使命赋予了你。如果紫罗兰之眼的调查结果确实可信，那么你就必须向他们伸出援手。$B$B尽管我与大法师塞德瑞克有许多不睦，可是像奥图鲁斯这样的人，他们所从事的研究工作还是至关重要的。总之，帮助他们的同时，你也要提防被紫罗兰之眼所利用。话说回来，如果卡拉赞真是面临危机，甚至成为了危机本身，恐怕也只有紫罗兰之眼能为你指引方向，帮助你消灭其中的邪恶力量。回到奥图鲁斯那儿吧，竭尽全力帮助他。', '', '', '', '', '', '', 26365),
(9299, 'zhCN', '潦草的便笺', '将潦草的便笺交给东瘟疫之地圣光之愿礼拜堂的名单登记员。', '你在某个天灾士兵的尸体上找到了这封信。破旧发黄的信纸散发着霉臭，看来它在亡灵手里已经有些日子了。或许圣光之愿礼拜堂的家伙会对此感兴趣的……', '', '', '', '', '', '', 26365),
(9268, 'zhCN', '海上的战争', '', '', '', '', '', '', '', '', 26365),
(9267, 'zhCN', '抚平旧伤', '', '', '', '', '', '', '', '', 26365),
(9266, 'zhCN', '痛改前非', '', '', '', '', '', '', '', '', 26365),
(9259, 'zhCN', '血帆海盗的叛徒', '', '', '', '', '', '', '', '', 26365),
(9257, 'zhCN', '埃提耶什，守护者的传说之杖', '塔纳利斯时光之穴的阿纳克洛斯要你前往斯坦索姆，在神圣之地上使用埃提耶什，守护者的传说之杖。击败被驱赶出法杖的生物，然后回到阿纳克洛斯那里去。', '艰巨的任务总在最后，$n。你已经击败了一位上古之神和一位巫妖王的大将，现在是面对萨格拉斯的时候了。$B$B带上这根杖子前往斯坦索姆。你会在那儿发现一处神圣之地：洛丹伦最伟大的骑士们的埋骨之处。将这柄被玷污的传说之杖放在神圣之地中，准备好挑战被驱赶出法杖的可怕生物……击败控制着法杖的恶魔，然后再回来找我。', '', '', '', '', '', '', 26365),
(8983, 'zhCN', '追查货源', '与幽暗城法师区裁缝店里的玛拉·雷尼克谈一谈。', '我的货有问题？好吧好吧，我从来没见过别人对我的货物这么热衷痴迷。$b$b我是从一个叫玛拉·雷尼克的商人那里进到这批货的。她是新来的。$b$b她提到过说要有些货物得送到法师区的裁缝店那边去。', '', '', '', '', '', '', 26365),
(8902, 'zhCN', '亲爱的艾琳娜', '将充满感情的信件交给幽暗城银行附近的艾琳娜·海东。', '很久很久以前，我就跟青梅竹马的艾琳娜订婚了。虽然我对她的爱恋在多年之前就消退了，但她依然时常闯入我的内心。$B$B也许，即使在经历了那么多事情之后，我们的心中还是为爱情留下了空间。$B$B我相信她也变了许多。你能帮我把这封信交给她吗？我自己去的话肯定会很紧张的。', '', '', '', '', '', '', 26365),
(8872, 'zhCN', '春节将至！', '与达纳苏斯塞纳里奥区的春节预告者交谈。当然，你也可以到其他主城中去寻找当地的春节预告者。', '春节将至，$n！塞纳里奥议会邀请所有艾泽拉斯的居民参加我们的新年庆典活动。你可以在这座城市中寻找一个有神圣的月光之环标记的地方，我们的春节预告者就在那里！她可以告诉你更多关于这个节日的细节信息。', '', '', '', '', '', '', 26365),
(8547, 'zhCN', '欢迎！', '将鹰翼广场礼品券交给鹰翼广场的玛希尔拉·晨星。', '欢迎来到魔兽世界！$B$B为了感谢您购买魔兽世界典藏版，请将这张礼券交给鹰翼广场的玛希尔拉·晨星。您将得到一份特别的礼物：陪伴您踏上冒险旅途的小宠物！$B$B再次感谢您的支持，请尽情享受魔兽世界的乐趣吧！', '', '', '', '', '', '', 26365),
(7937, 'zhCN', '财富在等着你……', '到艾尔文森林的东谷伐木场去寻找你的财宝吧。', '“东谷的财宝正等着你。”$B$B你抚摸着手中的塔罗牌，感到一丝暖意。你紧紧地握住它，眼前浮现出艾尔文森林东谷伐木场的影像。你专注地观察着，发现马厩附近有一堆干草。', '', '', '', '', '', '', 26365),
(7493, 'zhCN', '一切才刚刚开始', '', '', '', '', '', '', '', '', 26365),
(7241, 'zhCN', '保卫霜狼氏族', '到希尔斯布莱德丘陵地区的奥特兰克山谷去。找到拉格隆德并和他谈谈，然后成为霜狼氏族的士兵。', '战鼓的轰鸣再次回响在遥远的土地上，$c。与酋长血脉相连的氏族正在被穷凶极恶的铁炉堡雷矛部族围攻。$B$B我可以看出你很渴望战斗，并且愿意帮助霜狼氏族。$B$B你必须马上证明你的决心。$B$B你可以在希尔斯布莱德丘陵找到奥特兰克山谷的入口。进入其中，找到拉格隆德。快点出发吧，$c，我们马上要展开战斗了！', '', '', '', '', '', '', 26365),
(6862, 'zhCN', '斯菲莱克斯的便携式伐木机', '首席技师斯菲莱克斯要你给他拿去下列物品：$B$B30块瑟银锭。$B$B50块秘银锭。$B$B75块铁锭。$B$B1个蒸汽锯。', '我和你一样焦急地想要试一下我的便携式伐木机，$c，但是我必须要弄到一些材料——我是说很多材料——才能制作出配套的工具！$B$B实际上，我需要像山那么大的一堆瑟银、秘银和铁，另外每一台伐木机还需要有一个蒸汽锯才能完工，你最好到伐木场去找找看。$B$B我在这里游荡的时候（在我被抓住之前），曾在雷矛伐木场里看到很多的蒸汽锯。', '', '', '', '', '', '', 26365),
(6609, 'zhCN', '青出于蓝！', '到卡利姆多大陆的塞拉摩去。从那里向南方出发，找到一座岛屿。纳特·帕格就在岛上等待着你的到来！', '我是个大嗓门的矮人，我亲爱的$g小伙子:小姑娘;！我可不是为了钓鱼而生出来的！我的意思是，看看我！我是用石头刻出来的。$B$B我没有什么可保留的了——你已经把我知道的全都学会啦！$B$B你还不明白吗？啊，好吧。我在卡利姆多大陆有一个朋友，他也许可以帮你。他的名字叫纳特·帕格，是一个很友善的人。你可以在塞拉摩南边的岛上找到他。快出发吧！', '', '', '', '', '', '', 26365),
(4763, 'zhCN', '黑木熊怪的堕落', '在空的净化碗里盛满奥伯丁月亮井的井水。$B$B在黑木熊怪的北部营地里收集水果、坚果和谷物各一份。$B$B将水和三种食物混合起来，放置在壁泉河附近的营火边，这样就会召来唤引诱熊怪堕落的萨特。$B$B取回堕落护符，将它交给奥伯丁的桑迪斯·织风。', '我们已经知道熊怪的堕落与萨特有很大的关系，他们使用魔法护符控制熊怪。如果我们要尝试拯救熊怪的话，就必须击败引诱熊怪的萨特，取回他的护符！$B$B到我们的月亮井里去，在碗里盛满水，然后从北面的熊怪营帐中取回一些食物。把水和食物混合并放在河水边的营火旁，只要熊怪吃下食物，它就会得到净化，稍等片刻，那个引诱熊怪的萨特就会出现……这时你就要出手杀掉它！', '', '', '', '', '', '', 26365),
(4604, 'zhCN', '再次使用超级清洁器', '', '', '', '', '', '', '', '', 26365),
(2952, 'zhCN', '超级清洁器5200型！', '', '', '', '', '', '', '', '', 26365),
(2770, 'zhCN', '加兹瑞拉', '把加兹瑞拉的鳞片交给闪光平原的维兹尔·铜栓。', '在塔纳利斯沙漠的巨魔古城祖尔法拉克深处，有一个神圣的池塘。巨魔可以从那个池塘里召唤一头巨大的野兽——加兹瑞拉！它凶猛异常，甚至连它的鳞片都会因为巨大的能量而发出声响。我要用它的能量来给我的赛车增加动力！$B$B把加兹瑞拉的鳞片给我弄来！$B$B不过，召唤加兹瑞拉的方法是巨魔的秘密。如果你想要面对加兹瑞拉的话，首先就要从巨魔那里弄到召唤它的方法。', '', '', '', '', '', '', 26365),
(1701, 'zhCN', '弗伦的铠甲', '收集必需的材料，将它们交给暴风城的弗伦·长须。', '我已经给了你一面精致的盾牌，不过我们的合作决不会就此结束。我知道如何铸造异常坚固的铠甲，但是铸造起来并不容易，我需要一些稀有的材料，只要你愿意跑跑腿，我保证会为你打造一件。$B$B你觉得怎么样，$n？如果你愿意接受挑战的话，我会给你一份列表，上面记载着我需要的材料和到可以找到这些材料的地点。', '', '', '', '', '', '', 26365),
(1655, 'zhCN', '白洛尔的矿石', '把乔丹的矿石带给洛克莫丹的白洛尔·石手。', '啊！你吓了我一跳，$G先生:小姐;！你没看到我在思考吗？$B$B那是什么？乔丹的矿石…送去铁炉堡的……啊，这样啊，我知道你说的是什么了。那群莫格罗什食人魔抢走了我朋友的矿石，商队从这里前往湿地的路上遭到了埋伏。唯一从袭击中逃出的守卫也在前几天死掉了——医师没能及时赶到。$B$B你想找到那些矿石，就往东北方向去，在洛克湖的另一边。矿石一定就在那里的某个地方。', '', '', '', '', '', '', 26365),
(1442, 'zhCN', '寻找科尔宝石', '给黑海岸的桑迪斯·织风带去一块科尔宝石。', '你好，$n。我能为你这位追寻神圣之道的人做点什么呢？$B$B哦，铁匠斯迪威尔……很久以前的事了，不过我还记得他，有一段时间没听到他的消息了。$B$B我知道他决不是那种卑鄙的人，他想要一块科尔宝石一定也是为了某种高尚的目的。$B$B如果你真想要科尔宝石，就到灰谷的西北方去。你会在古老的废墟里看到黑暗深渊，而那些仍然在使用科尔宝石纳迦就聚集在那里。你一定要小心，不要单独行动。', '', '', '', '', '', '', 26365),
(1368, 'zhCN', '吉尔吉斯部族', '和吉尔吉斯部族建立良好的关系，然后和智者乌泰克谈一谈。', '要想打败半人马，我们就必须以毒攻毒。我们要先笼络一支半人马部族，利用他们打败其他的半人马。$B$B如果你准备和吉尔吉斯结盟，那么就去攻击他们最憎恨的对手——玛格拉姆部族。在你赢得了吉尔吉斯部族足够的尊重以后，就可以去见他们的萨满祭司，智者乌泰克，他就住在凄凉之地西南的吉尔吉斯村外面。', '', '', '', '', '', '', 26365),
(1275, 'zhCN', '研究堕落', '奥伯丁的戈沙拉·夜语需要8块堕落者的脑干。', '愚蠢的血精灵们已经彻底陷入了对魔法的狂热之中了，难道他们没有见到卡利姆多大陆上的萨特与纳迦们身上发生了些什么吗？$b$b我总觉得血精灵们也将会踏上这样一条不归之路，但是艾泽拉斯已经无法再承受多一种被魔法扭曲了心智的怪物了。$b$b我希望能够研究一下萨特和纳迦的脑干组织，这样也许就能了解那些精灵们的命运将会走向何方。在灰谷海岸边的黑暗深渊中有许多萨特和纳迦，你去那里找一找吧。$b$b这将会是一段漫长的旅程，一路小心，$n。', '', '', '', '', '', '', 26365),
(1144, 'zhCN', '进口商威利克斯', '护送进口商威利克斯到达剃刀沼泽的出口。', '总算有人来帮忙了！$b$b你肯定不知道我被关在这鬼地方有多久，我已经不记得外边的世界是什么样子了。$b$b你看，我好歹还是个大商人来着。照他们的说法我这叫“见钱眼开”，前一阵子看到这里有利可图我就来了！麦伯克·米希瑞克斯愿意为在这个猪圈一样的地方生长的红叶薯付个好价钱，我还以为这是个有利可图的营生哪，结果……如你看到的一样，我犯了个小错误！$b$b总之，如果你这大善人愿意帮我逃出这儿的话，我是不会吝啬的。', '帮助进口商威利克斯逃离剃刀沼泽。', '', '', '', '', '去剃刀沼泽的出口找进口商威利克斯。', 26365),
(986, 'zhCN', '失踪的主人', '收集5张优质月夜猛虎毛皮，把它们交给奥伯丁的特伦希斯。', '$n，你帮了我很多忙，我能不能再请求你帮助一下锐爪和他的主人沃科尔？我可以帮你精心制作一件有魔力的斗篷，它能够让你在寻找沃科尔时畅通无阻，免受黑海岸上任何猛兽的阻挠。$B$B不过要制作这件斗篷，我需要从月夜雄虎或者月夜雌虎身上获取几张上等毛皮。你可以在急弯河以南找到那些月夜猛虎。', '', '', '', '', '', '', 26365),
(982, 'zhCN', '深不可测的海洋', '找到银色清晨号的保险箱和迷雾之纱号的保险箱，把它们交给奥伯丁的高尔博德·钢手。你可以在村庄北部遇难的船只里找到这两只箱子。', '从我们现在所在位置沿着海岸一直往北可以看到两艘沉船——银色清晨号和迷雾之纱号。这两艘船在穿越茫茫大海，最终将要达到奥伯丁的时候遇到了那些可恶的鱼人，它们现在只能躺在海底作为那些恶棍的战利品了。$B$B这两艘船的船长都没有能幸免于难，他们的日志以及其它有价值的东西还锁在船里的箱子中。我希望你能帮我找到这些东西，这对于那些生还的船员也是颇有意义的。', '', '', '', '', '', '', 26365),
(967, 'zhCN', '奥萨拉克斯之塔', '把巴苏尔的信送给灰谷森林中的净化者德尔格伦。', '我的主人，净化者德尔格伦，是一位伟大的圣骑士。为了保护森林不受恶魔和亡灵的袭扰，德尔格伦一直在尽全力帮助我们。他向我传授了圣光术和各种其它的战斗技巧。$b$b你必须尽快把这个教派的消息告诉德尔格伦。$b$b他就驻扎在南方的灰谷森林里的梅伊瑟娜岗哨。请快一点，我非常担心这个暗滩教派带来的威胁会越来越大。', '', '', '', '', '', '', 26365),
(948, 'zhCN', '安努', '和古树之林的安努谈一谈。', '古树之林里的一棵知识古树安努得知了你到壁泉河瀑布去的这次旅行，他希望和你谈谈。古树之林就在南方的山麓附近。$B$B这些古树耐心而充满睿智，$n，不过，如果是安努找你是为了向你询问瀑布一带的情况，我想事情一定非常紧急。', '', '', '', '', '', '', 26365),
(729, 'zhCN', '健忘的勘察员', '到南边去一趟，看看勘察员雷姆塔维尔现在处境如何。', '首席考古学家杜瑟·灰胡派我在伟大的勘察员雷姆塔维尔的指导下进行工作，这对我来说是无上的荣誉。在铁炉堡学院时，每个人都知道雷姆塔维尔有许多伟大的发现。$b$b不过这位伟大的勘察员实在是……嗯……有些健忘……他常常对周围的一切都浑然不觉。$b$b我们刚刚发现了一座大型的古代城镇，但是突然间，可怕的傀儡从地下蜂拥而出，占据了那里。不过雷姆塔维尔似乎还没有发现这一点，我跑回奥伯丁就是为了找人去救他。$b$b请到南边去一趟，看看伟大勘察员是否还一切安好！', '', '', '', '', '', '', 26365),
(484, 'zhCN', '小鳄鱼皮', '为米奈希尔港口的詹姆斯·哈洛兰带回4张小鳄鱼皮。', '我是皮匠詹姆斯·哈洛兰。我用鳄鱼皮做东西的手艺可是艾泽拉斯第一流的，每天都有大船把我的产品一箱一箱地运到世界各地的港口去。$b$b你见过埃纳尔了吧？他也是专门为我提供新鲜鳄鱼皮的诸多猎人之一。$b$b最近我这里的小鳄鱼皮供应量在直线下降，鉴于目前我真的很缺货，如果你能帮我弄些小鳄鱼皮回来，我会给你开出一个非常不错的价码。你可以在镇外的沼泽里找到那种小鳄鱼。', '', '', '', '', '', '', 26365),
(458, 'zhCN', '森林守护者', '找到树妖塔琳德拉。', '谢天谢地你在这儿，$c。森林中的小精灵们告诉了我一些奇怪的消息。$b$b神秘的森林守护者塔琳德拉又回到了幽影谷。这位树妖的身影已经许多年都没有在卡利姆多大陆上的森林中出现过了。她既然回到了这里，就意味着这里一定出了什么事情。$b$b找到了塔琳德拉，并且问问她我们的森林到底怎么了。有个哨兵向我报告过，塔林德拉曾在奥达希尔的西边出现过。', '', '', '', '', '', '', 26365),
(391, 'zhCN', '监狱暴动', '杀死巴基尔·斯瑞德，把他的徽记带给监狱的典狱官塞尔沃特。', '让我们把话挑明了说吧，$n：我不信任你。但是，现在的情况紧急，我也管不了那么多了。$b$b你到下面去干掉那个该死的斯瑞德，把他的徽记带给我。$b$b还有，如果你胆敢跟他合计什么把戏，或者你不上来了的话……只要被我抓到你，就准备跟那群蛆死在一块吧。', '', '', '', '', '', '', 26365),
(171, 'zhCN', '联盟孤儿的看护者', '从克拉格·摇塞那里购买泡沫塑料剑架，然后将你的孤儿送回暴风城孤儿院，同教堂区的孤儿监护员奈丁加尔交谈，送你的孤儿回家。', '你对我真好，$n。我从来没有想过会在儿童周得到如此多的乐趣，谢谢你。$B$B真希望所有孤儿都会像我这样幸运，体验和我们一样的精彩经历。你觉得我们能不能再找到克拉格·摇塞，从他那里弄到一副泡沫塑料的剑架？我想，他应该还在贸易区外面的运河边上推他的小车子。这样，孤儿院的孩子们也能和我一起分享乐趣了！$B$B然后，我就要回家了。', '', '', '', '', '', '', 26365),
(126, 'zhCN', '群山中的嚎叫', '将犹勒的爪子带回给湖畔镇的弗纳·奥斯古。', '$n，那些豺狼人居然还没死绝！我还能听见他们在湖畔镇周围的山区里打猎时发出的嚎叫声。其中有一个声音喊得最响——那是犹勒，他们的头儿。$B$B干掉犹勒，把他的手下都给轰走！把这个混蛋的爪子给我带回来。$B$B不过你得小心点，这家伙能当上他们的头儿自然是有两把刷子的。犹勒可不是个低能的混血豺狼人，他是纯种的……', '', '', '', '', '', '', 26365),
(115, 'zhCN', '暗影魔法', '给湖畔镇的治安官马瑞斯带回3颗午夜宝珠。', '黑石氏族的兽人在赤脊山脉的侵略行动得到了暗影法师的支援，他们带来了一种具有强大黑暗力量的器具——午夜宝珠。这些宝珠给赤脊山脉的保卫者们造成了巨大的伤亡，并迫使我们放弃所有在战斗中被这种宝珠污染了的器物,因为它们已经沾染了恶魔的力量。$B$B猎杀这些黑石暗影法师，并给我带回他们的午夜宝珠来。我将会把这些东西妥善地处理掉，还这世界一片清净！', '', '', '', '', '', '', 26365),
(19, 'zhCN', '萨瑞尔祖恩', '将萨瑞尔祖恩的徽记带给湖畔镇的治安官马瑞斯。', '黑石前锋和黑石叛节者经常在这里和石堡要塞之间伏击我们，这群前锋的指挥官是个名叫萨瑞尔祖恩的兽人。把他的徽记给我带来。', '', '', '', '', '', '', 26365);

UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：阿古斯之心', `VerifiedBuild`=26365 WHERE (`ID`=49135 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：阿古斯之心', `VerifiedBuild`=26365 WHERE (`ID`=49134 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：阿古斯之心', `VerifiedBuild`=26365 WHERE (`ID`=49133 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：黑暗通道', `VerifiedBuild`=26365 WHERE (`ID`=49076 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：黑暗通道', `VerifiedBuild`=26365 WHERE (`ID`=49075 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：黑暗通道', `VerifiedBuild`=26365 WHERE (`ID`=49032 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='安托鲁斯，燃烧王座：泰坦陨落', `VerifiedBuild`=26365 WHERE (`ID`=49015 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='执政团之座：执政团护甲', `VerifiedBuild`=26365 WHERE (`ID`=48231 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：艾格文之路', `VerifiedBuild`=26365 WHERE (`ID`=47727 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：艾格文之路', `VerifiedBuild`=26365 WHERE (`ID`=47726 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：艾格文之路', `VerifiedBuild`=26365 WHERE (`ID`=47725 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：欺诈者', `VerifiedBuild`=26365 WHERE (`ID`=47129 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：欺诈者', `VerifiedBuild`=26365 WHERE (`ID`=47128 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：欺诈者', `VerifiedBuild`=26365 WHERE (`ID`=47127 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：欺诈者', `VerifiedBuild`=26365 WHERE (`ID`=47126 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：堕落的化身', `VerifiedBuild`=26365 WHERE (`ID`=47125 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：堕落的化身', `VerifiedBuild`=26365 WHERE (`ID`=47124 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：堕落的化身', `VerifiedBuild`=26365 WHERE (`ID`=47123 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：堕落的化身', `VerifiedBuild`=26365 WHERE (`ID`=47122 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：解放灵魂', `VerifiedBuild`=26365 WHERE (`ID`=47121 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：解放灵魂', `VerifiedBuild`=26365 WHERE (`ID`=47120 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：解放灵魂', `VerifiedBuild`=26365 WHERE (`ID`=47119 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：解放灵魂', `VerifiedBuild`=26365 WHERE (`ID`=47118 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：古墓主母', `VerifiedBuild`=26365 WHERE (`ID`=47117 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：古墓主母', `VerifiedBuild`=26365 WHERE (`ID`=47116 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：古墓主母', `VerifiedBuild`=26365 WHERE (`ID`=47115 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='萨格拉斯之墓：古墓主母', `VerifiedBuild`=26365 WHERE (`ID`=47114 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='永夜大教堂：圣盾祭坛', `VerifiedBuild`=26365 WHERE (`ID`=46244 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `QuestDescription`='我可是经历千难万险才来到这里的，侍从。这里充满了危险，有风暴、恶魔，还有风暴恶魔……我光是回想一下就不寒而栗了。当然，我征服了所有这些危险，但是我本人付出了高昂的代价。所以我需要你的帮助。\n\n你必须冒险前进——不，狂奔前进，找回我的护甲，我的武器，当然，还有我的骏马。只要你成功完成这三项任务，你就可以晋升为一等侍从！', `VerifiedBuild`=26365 WHERE (`ID`=45565 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='暗夜要塞：阿曼苏尔之眼', `VerifiedBuild`=26365 WHERE (`ID`=45420 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='暗夜要塞：夏多雷护符', `VerifiedBuild`=26365 WHERE (`ID`=45383 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='暗夜要塞：夏多雷护符', `VerifiedBuild`=26365 WHERE (`ID`=45382 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='暗夜要塞：夏多雷护符', `VerifiedBuild`=26365 WHERE (`ID`=45381 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='从《军团再临》的地下城的最终首领身上获得$1oa个徘徊之魂碎片。$b$b地下城难度越高，获得徘徊之魂碎片的几率越高，数量越多。', `VerifiedBuild`=26365 WHERE (`ID`=45175 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='在宠物对战中击败观察者奥尔加隆。', `VerifiedBuild`=26365 WHERE (`ID`=44767 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑鸦堡垒：黑鸦堡垒领主', `VerifiedBuild`=26365 WHERE (`ID`=44277 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑鸦堡垒：黑鸦堡垒领主', `VerifiedBuild`=26365 WHERE (`ID`=44276 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='群星庭院：进入群星庭院', `VerifiedBuild`=26365 WHERE (`ID`=44275 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑心林地：进入黑心林地', `VerifiedBuild`=26365 WHERE (`ID`=44273 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑心林地：进入黑心林地', `VerifiedBuild`=26365 WHERE (`ID`=44272 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='艾萨拉之眼： 进入艾萨拉之眼', `VerifiedBuild`=26365 WHERE (`ID`=44271 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='艾萨拉之眼： 进入艾萨拉之眼', `VerifiedBuild`=26365 WHERE (`ID`=44270 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英灵殿：奥丁的挑战', `VerifiedBuild`=26365 WHERE (`ID`=44269 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英灵殿：奥丁的挑战', `VerifiedBuild`=26365 WHERE (`ID`=44268 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='噬魂之喉：进入噬魂之喉', `VerifiedBuild`=26365 WHERE (`ID`=44267 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='噬魂之喉：进入噬魂之喉', `VerifiedBuild`=26365 WHERE (`ID`=44266 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='奈萨里奥的巢穴：进入奈萨里奥的巢穴', `VerifiedBuild`=26365 WHERE (`ID`=44265 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='奈萨里奥的巢穴：进入奈萨里奥的巢穴', `VerifiedBuild`=26365 WHERE (`ID`=44264 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='魔法回廊：进入魔法回廊', `VerifiedBuild`=26365 WHERE (`ID`=44263 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='守望者地窟：进入守望者地窟', `VerifiedBuild`=26365 WHERE (`ID`=44261 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='守望者地窟：进入守望者地窟', `VerifiedBuild`=26365 WHERE (`ID`=44260 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='紫罗兰监狱：进入紫罗兰监狱', `VerifiedBuild`=26365 WHERE (`ID`=44259 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='紫罗兰监狱：进入紫罗兰监狱', `VerifiedBuild`=26365 WHERE (`ID`=44258 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：萨维斯', `VerifiedBuild`=26365 WHERE (`ID`=43909 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：塞纳留斯的堕落', `VerifiedBuild`=26365 WHERE (`ID`=43908 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：萨维斯', `VerifiedBuild`=26365 WHERE (`ID`=43907 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：塞纳留斯的堕落', `VerifiedBuild`=26365 WHERE (`ID`=43906 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：萨维斯', `VerifiedBuild`=26365 WHERE (`ID`=43905 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：塞纳留斯的堕落', `VerifiedBuild`=26365 WHERE (`ID`=43904 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：萨维斯', `VerifiedBuild`=26365 WHERE (`ID`=43903 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：塞纳留斯的堕落', `VerifiedBuild`=26365 WHERE (`ID`=43902 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='噬魂之喉：刺破迷雾', `VerifiedBuild`=26365 WHERE (`ID`=43596 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `QuestDescription`='我们需要的导管在魔法回廊里。自从你上次去过之后，魔法回廊的保安力量已经翻倍。\n\n我们唯一的合理选择就是将你的突击队直接传送进去。\n\n这是一次前往未锚定目的地的远程传送。也就是说，这将会是一项艰巨的任务。\n\n带上这个道标，然后调查苏拉玛城中的平民，之后再把信标交还给我。这样我就能对结果进行分析。\n\n这会让我更加精确地将你传送到导管附近！', `VerifiedBuild`=26365 WHERE (`ID`=43565 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='紫罗兰监狱：进入紫罗兰监狱', `VerifiedBuild`=26365 WHERE (`ID`=43557 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='守望者地窟：进入守望者地窟', `VerifiedBuild`=26365 WHERE (`ID`=43556 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='奈萨里奥的巢穴：进入奈萨里奥的巢穴', `VerifiedBuild`=26365 WHERE (`ID`=43554 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='噬魂之喉：进入噬魂之喉', `VerifiedBuild`=26365 WHERE (`ID`=43553 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='艾萨拉之眼： 进入艾萨拉之眼', `VerifiedBuild`=26365 WHERE (`ID`=43552 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑心林地：进入黑心林地', `VerifiedBuild`=26365 WHERE (`ID`=43551 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：伊格诺斯', `VerifiedBuild`=26365 WHERE (`ID`=43549 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：伊格诺斯', `VerifiedBuild`=26365 WHERE (`ID`=43548 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：伊格诺斯', `VerifiedBuild`=26365 WHERE (`ID`=43547 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：伊格诺斯', `VerifiedBuild`=26365 WHERE (`ID`=43546 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='黑鸦堡垒：黑鸦堡垒领主', `VerifiedBuild`=26365 WHERE (`ID`=43545 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='暗夜要塞：深入暗夜要塞', `VerifiedBuild`=26365 WHERE (`ID`=43531 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='翡翠梦魇：力量精华', `VerifiedBuild`=26365 WHERE (`ID`=43521 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英灵殿：奥丁的挑战', `VerifiedBuild`=26365 WHERE (`ID`=43509 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的接见', `VerifiedBuild`=26365 WHERE (`ID`=40976 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `QuestDescription`='<这张书页像是从一本书里撕掉的。上面写着：>$b$b”……海之石冢，自古以来的众神钟爱之地。$b$b他把夏斯卡格草作为祭品放在石冢边，口中念道\‘圣草复始，生生不息\’，然后接受他所需的祝福。”$b$b这可能与你带给草药学训练师的那本书有关。', `VerifiedBuild`=26365 WHERE (`ID`=40032 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='奈萨里奥的巢穴：地底之王之死', `VerifiedBuild`=26365 WHERE (`ID`=39781 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='守望者地窟：柔韧玻璃软管', `VerifiedBuild`=26365 WHERE (`ID`=39343 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：灰熊丘陵！', `VerifiedBuild`=26365 WHERE (`ID`=39207 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：灰熊丘陵！', `VerifiedBuild`=26365 WHERE (`ID`=39206 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：龙骨荒野！', `VerifiedBuild`=26365 WHERE (`ID`=39204 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：龙骨荒野！', `VerifiedBuild`=26365 WHERE (`ID`=39203 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：虚空风暴！', `VerifiedBuild`=26365 WHERE (`ID`=39202 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：虚空风暴！', `VerifiedBuild`=26365 WHERE (`ID`=39201 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：刀锋山！', `LogDescription`='前往刀锋山的希尔瓦纳与莉娜·月泉谈一谈。', `QuestCompletionLog`='前往刀锋山的希尔瓦纳与莉娜·月泉谈一谈。', `VerifiedBuild`=26365 WHERE (`ID`=39199 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：刀锋山！', `LogDescription`='前往刀锋山的雷神要塞，与高德雷克谈一谈。', `QuestDescription`='大酋长正在召集勇士终结刀锋山的食人魔威胁。即刻前往北方的兽人要塞：雷神要塞，向高德雷克告知我们的境况。我们需要他所能提供的一切协助。', `QuestCompletionLog`='前往刀锋山的雷神要塞，与高德雷克谈一谈。', `VerifiedBuild`=26365 WHERE (`ID`=39198 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：纳格兰！', `LogDescription`='前往外域的纳格兰，与塔拉的监护者莫布吉尔谈一谈。', `QuestCompletionLog`='前往外域的纳格兰，与塔拉的监护者莫布吉尔谈一谈。', `VerifiedBuild`=26365 WHERE (`ID`=39197 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：纳格兰！', `VerifiedBuild`=26365 WHERE (`ID`=39196 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：泰罗卡森林！', `VerifiedBuild`=26365 WHERE (`ID`=39188 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：泰罗卡森林！', `VerifiedBuild`=26365 WHERE (`ID`=39182 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：赞加沼泽！', `VerifiedBuild`=26365 WHERE (`ID`=39181 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：赞加沼泽！', `VerifiedBuild`=26365 WHERE (`ID`=39180 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='击败瑞莱·克雷斯弗', `VerifiedBuild`=26365 WHERE (`ID`=37295 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='在一场宠物对战中击败克里斯托弗·冯·费舍尔。', `QuestDescription`='看看我，再看看我的马，再看看我，我难道不是你所见过最令人难忘的宠物战将吗？$B$B你仔细瞧瞧那边那位我的同胞。他骑在马背上吗？当然没有！他的帽子是由焰火制成的吗？简直做梦！我所拥有的一切都更为显赫，从我外衣的颜色到我伟大的姓氏，都是我亲力亲为给自己打造的。$B$B你胆敢走上前来挑战头号选手克里斯托弗·维利肯斯·丹尼斯·拉格纳罗斯·冯·费舍尔的力量吗？$B$B我看你已经吓得瑟瑟发抖了！', `VerifiedBuild`=26365 WHERE (`ID`=36471 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `QuestDescription`='奥格瑞玛有了一家全新的冰激凌店，而且里面卖的也不是那种老式冰激凌了。它的冰激凌是一位疯狂的地精魔法师做的！你根本不会想到，如果我在十五分钟内没有吃光它，它就会消失！$B$B我打赌，那一定非常好吃。我们赶快去试试吧！$B$B其他小孩都在和我说这个呢。他们说那家店叫冰锥甜筒，就在奥格瑞玛大使馆里。', `VerifiedBuild`=26365 WHERE (`ID`=29191 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：暮光高地！', `VerifiedBuild`=26365 WHERE (`ID`=28717 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：北风苔原！', `VerifiedBuild`=26365 WHERE (`ID`=28711 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='英雄的召唤：北风苔原！', `VerifiedBuild`=26365 WHERE (`ID`=28709 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：外域！', `VerifiedBuild`=26365 WHERE (`ID`=28705 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：荆棘谷海角！', `VerifiedBuild`=26365 WHERE (`ID`=28704 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：北荆棘谷！', `LogDescription`='前往北荆棘谷，向格罗姆高营地的指挥官阿格罗戈什报到。', `VerifiedBuild`=26365 WHERE (`ID`=28688 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：悲伤沼泽！', `VerifiedBuild`=26365 WHERE (`ID`=28677 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：诅咒之地！', `VerifiedBuild`=26365 WHERE (`ID`=28671 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：燃烧平原！', `VerifiedBuild`=26365 WHERE (`ID`=28667 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：阿拉希高地！', `VerifiedBuild`=26365 WHERE (`ID`=28619 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：灼热峡谷！', `VerifiedBuild`=26365 WHERE (`ID`=28581 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：荒芜之地！', `VerifiedBuild`=26365 WHERE (`ID`=28580 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：东瘟疫之地！', `VerifiedBuild`=26365 WHERE (`ID`=28577 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：西瘟疫之地！', `QuestDescription`='所有身强力壮的部落成员，从此刻起都要向安多哈尔的库尔迪拉·织亡者报到。$B$B联盟部队正在进犯安多哈尔的废墟，妄图将其占为己有。我们必须在他们站稳脚跟之前，向他们发起反击！$B$B穿过提瑞斯法林地东部边境的亡灵壁垒，沿着路向东南进发，到安多哈尔与我们的部队会合。$B$B命运在召唤！', `VerifiedBuild`=26365 WHERE (`ID`=28575 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：辛特兰！', `VerifiedBuild`=26365 WHERE (`ID`=28574 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：阿拉希高地！', `VerifiedBuild`=26365 WHERE (`ID`=28572 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：希尔斯布莱德丘陵！', `VerifiedBuild`=26365 WHERE (`ID`=28571 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：银松森林！', `VerifiedBuild`=26365 WHERE (`ID`=28568 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：幽魂之地！', `VerifiedBuild`=26365 WHERE (`ID`=28560 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：奥丹姆！', `VerifiedBuild`=26365 WHERE (`ID`=28557 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：尘泥沼泽！', `VerifiedBuild`=26365 WHERE (`ID`=28554 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：南贫瘠之地！', `VerifiedBuild`=26365 WHERE (`ID`=28549 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：凄凉之地！', `VerifiedBuild`=26365 WHERE (`ID`=28548 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：冬泉谷！', `VerifiedBuild`=26365 WHERE (`ID`=28545 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：费伍德！', `VerifiedBuild`=26365 WHERE (`ID`=28542 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：石爪山！', `VerifiedBuild`=26365 WHERE (`ID`=28532 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：希利苏斯！', `VerifiedBuild`=26365 WHERE (`ID`=28527 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：安戈洛环形山！', `VerifiedBuild`=26365 WHERE (`ID`=28526 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：菲拉斯！', `VerifiedBuild`=26365 WHERE (`ID`=28510 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：塔纳利斯！', `VerifiedBuild`=26365 WHERE (`ID`=28509 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：千针石林！', `VerifiedBuild`=26365 WHERE (`ID`=28504 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：艾萨拉！', `VerifiedBuild`=26365 WHERE (`ID`=28496 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：北贫瘠之地！', `VerifiedBuild`=26365 WHERE (`ID`=28494 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：灰谷！', `VerifiedBuild`=26365 WHERE (`ID`=28493 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：希尔斯布莱德丘陵！', `VerifiedBuild`=26365 WHERE (`ID`=28089 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：深岩之洲！', `VerifiedBuild`=26365 WHERE (`ID`=27722 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：海加尔山！', `VerifiedBuild`=26365 WHERE (`ID`=27721 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogTitle`='大酋长的命令：瓦丝琪尔！', `VerifiedBuild`=26365 WHERE (`ID`=27718 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `AreaDescription`='', `VerifiedBuild`=26365 WHERE (`ID`=13913 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `QuestDescription`='冰虫是一种讨厌的生物，繁殖非常快。只要给它们一点喘息之机，它们就会像兔子一样飞快地繁殖，像野火一样蔓延开来。$b$b西南方的冬眠洞穴里已经出现了冰虫的踪迹。如果不尽快杀掉那条冰虫女王，它们就会在我们的地盘上扎根了。$b$b它绝对无法抵抗食物的诱惑。带上这把刀，在它们的洞穴里随便找一头熊的尸体，割一块腰肉下来。把肉放在冰虫女王的巢穴附近，趁它进食的时候除掉它。', `VerifiedBuild`=26365 WHERE (`ID`=13011 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='使用强化过的奥术牢笼，召唤克莉斯塔萨并与她谈一谈。', `VerifiedBuild`=26365 WHERE (`ID`=11946 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `AreaDescription`='', `VerifiedBuild`=26365 WHERE (`ID`=10409 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='收集8个巨魔的邪符，然后向幽魂之地远行者营地的药剂师温努图斯复命。', `VerifiedBuild`=26365 WHERE (`ID`=9199 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='调查阿曼尼墓穴并烧毁10具巨魔木乃伊残骸，然后向幽魂之地远行者营地的游侠维恩娜复命。', `QuestDescription`='$C，我们的线人报告说，被埋葬在阳痕峰阿曼尼墓穴内的巨魔尸体竟然重新站立了起来。我需要你去调查这些墓穴，并烧掉那些还没有活化的尸体，这样就可以避免它们为亡灵生物所利用。$B$B去那里最快的路就是出了营地后往西北方走，然后你就会到达墓穴的西部入口。', `VerifiedBuild`=26365 WHERE (`ID`=9193 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `LogDescription`='前往塔奎林，从药剂师雷兹特恩那儿拿到亚尼达的疗伤药膏，然后前往戴索姆，救治学徒瓦尼斯、药剂师恩尼斯和游侠维多兰。完成任务之后返回太阳圣殿找奥术师亚尼达领取奖励。', `QuestDescription`='啊，当然。我有种药膏可以解除多种形式的药物控制效果。$B$B副作用可能包括昏迷、呕吐或者暂时性的失明。这些显然都比天灾军团对俘虏所采用的手段要舒服得多……$B$B祝你好运，勇敢的$c。', `VerifiedBuild`=26365 WHERE (`ID`=9164 AND `locale`='zhCN');
UPDATE `quest_template_locale` SET `AreaDescription`='护送梅丽萨。', `VerifiedBuild`=26365 WHERE (`ID`=6132 AND `locale`='zhCN');
