DELETE FROM `gameobject_template_addon` WHERE `entry` IN (241680 /*Small Treasure Chest*/, 255344 /*Felslate Seam*/, 233912 /*Cylinder Collision (6.0 scale)*/, 243571 /*Shieldmaiden Idol*/, 243574 /*Shieldmaiden Idol*/, 251853 /*Small Treasure Chest*/, 243700 /*Forsaken Battle Plans*/, 240681 /*Oiled Cloak*/, 240677 /*Climbing Treads*/, 241155 /*Treasure Chest*/, 253280 /*Leystone Seam*/, 251738 /*Treasure Chest*/, 241280 /*Treasure Chest*/, 240286 /*Crystal Oscillator*/);
INSERT INTO `gameobject_template_addon` (`entry`, `faction`, `flags`) VALUES
(241680, 0, 2113568), -- Small Treasure Chest
(255344, 94, 278528), -- Felslate Seam
(233912, 0, 32), -- Cylinder Collision (6.0 scale)
(243571, 0, 1), -- Shieldmaiden Idol
(243574, 0, 1), -- Shieldmaiden Idol
(251853, 0, 2113536), -- Small Treasure Chest
(243700, 0, 4), -- Forsaken Battle Plans
(240681, 0, 2113540), -- Oiled Cloak
(240677, 0, 2113540), -- Climbing Treads
(241155, 0, 2113536), -- Treasure Chest
(253280, 94, 278528), -- Leystone Seam
(251738, 0, 2113536), -- Treasure Chest
(241280, 0, 2113536), -- Treasure Chest
(240286, 0, 2113540); -- Crystal Oscillator

UPDATE `gameobject_template_addon` SET `flags`=4 WHERE `entry`=244565; -- Kvaldir Spoils
UPDATE `gameobject_template_addon` SET `flags`=5 WHERE `entry`=245671; -- Whelp Cage
UPDATE `gameobject_template_addon` SET `flags`=5 WHERE `entry`=245669; -- Whelp Cage
UPDATE `gameobject_template_addon` SET `flags`=5 WHERE `entry`=245667; -- Whelp Cage
UPDATE `gameobject_template_addon` SET `flags`=5 WHERE `entry`=245668; -- Whelp Cage
UPDATE `gameobject_template_addon` SET `flags`=5 WHERE `entry`=243840; -- Mightstone Banner

DELETE FROM `quest_template_locale` WHERE (`locale`='ruRU' AND `ID` IN (43324,42076));
INSERT INTO `quest_template_locale` (`ID`, `locale`, `LogTitle`, `LogDescription`, `QuestDescription`, `AreaDescription`, `PortraitGiverText`, `PortraitGiverName`, `PortraitTurnInText`, `PortraitTurnInName`, `QuestCompletionLog`, `VerifiedBuild`) VALUES
(43324, 'ruRU', 'Ярость совухов', '', '', '', '', '', '', '', '', 23420),
(42076, 'ruRU', 'Деревня в Темнотопи', '', '', '', '', '', '', '', '', 23420);

DELETE FROM `quest_offer_reward_locale` WHERE (`locale`='ruRU' AND `ID` IN (39789,39122,39092,39405,39063,40005,40004,40003,39062,39472,39061,39060,39059,40002,40001,40078,39855,39853,39851,39850,39849,39857,39848,38347,38324,38339,39837,38818,38815,38823,38816,38817,39791,38811,38808,38810,39788,38778,39796,39804,39803,38624,39652,38413,40568,38414,38412,38342,38410,38337,38405,38318,38312,38473,39597,39594,39593,39592,39591,39595,39590,38331,38210,39775,38059,38057,38060,38058,38558,38053,38036,38052,39800));
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(39789, 'ruRU', 'О, привет! Ты, наверно, ищешь тауренов, которые стояли здесь лагерем. Они ненадолго отошли, но мы с Пронырой здесь, и мы о тебе позаботимся! $B$BГоворишь, тебе обещали заплатить за убийство воргов? Без проблем!$B$BЗолота у меня немного, зато есть другие ценные штуки. Выбирай!', 23420),
(39122, 'ruRU', 'Ты $gочнулся:очнулась;! Мы уж думали, что тебе конец... $B$BТебе очень повезло, что мы успели вовремя вытащить вас с Седогривом. Еще немного, и яд Сильваны тебя бы доконал. Жаль, конечно, что ей удалось улизнуть, но теперь ее планы в Скольд-Ашиле пошли прахом, и это целиком и полностью твоя заслуга. $B$BВне всякого сомнения, Седогрив захочет объявить тебе личную благодарность, когда малость поправится. Ты очень $gпомог:помогла; нашему делу, $n. $B$BГилнеас в огромном долгу перед тобой.', 23420),
(39092, 'ruRU', 'Рад видеть тебя, $n. $B$BШтурм лагеря Дредвейка не задался, и я уж было решил, что наше дело дрянь, но тут Краули сообщила мне о твоих успехах.$B$BПора закончить наше дело!', 23420),
(39405, 'ruRU', 'В этой поэме рассказывается о том, как Ашильдир основала орден дев щита и привела их в Скольд-Ашиль.$B$BЕсли девы щита и впрямь почитают королеву валь\'кир, то услуги, которые вы ей оказали в Хельхейме, поднимут вас в их глазах.', 23420),
(39063, 'ruRU', 'Валь\'киры, говоришь? Выходит, все гораздо печальнее, чем я думала. Если Сильвана получит возможность создавать новых валь\'кир, ее армия станет непобедимой.$B$BОчень похоже, что ее конечной целью является склеп. Мы должны остановить ее!', 23420),
(40005, 'ruRU', 'Прискорбно, что Король-бог спасся бегством, но его поражение остановило натиск Легиона на Штормхейм.$B$BА сейчас тебя ждут Чертоги Доблести.', 23420),
(40004, 'ruRU', 'Повелители Скверны повержены, и теперь войска Короля-бога будут рассеяны. $B$BНо мы еще не закончили. Пока демоны штурмуют Врата, Штормхейм все еще в опасности.', 23420),
(40003, 'ruRU', 'Ничего не понимаю. Порталы закрыты, но демоны Сковальда продолжают штурмовать Врата! $B$BМы должны выяснить, откуда они прибывают!', 23420),
(39062, 'ruRU', 'Значит, подкрепление прибыло? $B$BОтлично. Нам нужно поспешить, если мы хотим узнать о планах Сильваны прежде, чем она осуществит их.', 23420),
(39472, 'ruRU', 'Эти Отрекшиеся мутили свою чуму прямо у нас под носом. Какая наглость! Но ничего – покончив с аптекарем, мы вырвали у них ядовитые зубы. $B$BТы хорошо $gпоработал:поработала;, $n.', 23420),
(39061, 'ruRU', 'Прекрасно. Наконец-то части головоломки начинают складываться в цельную картину. $B$BМожет, мы пока и не знаем, что здесь делают силы Сильваны, но зато, похоже, теперь нам известно их местонахождение.', 23420),
(39060, 'ruRU', 'Дело сделано. $B$BТы $gоказал:оказала; воргенам огромную услугу, $n.', 23420),
(39059, 'ruRU', 'Ты очень вовремя, $n.', 23420),
(40002, 'ruRU', 'Ты не перестаешь удивлять меня, $gиноземец:чужестранка;. Твои испытания пройдены – но впереди ждут другие. $B$BСилы Короля-бога велики, но в твоем оружии заключена сила самого Штормхейма! Когда ты приблизишься к Вратам, она повергнет врагов нашего края!$B$BПришло время дать Королю-богу решительный бой и очистить Врата Доблести от скверны!', 23420),
(40001, 'ruRU', 'Кого это... я вижу? $B$BДруга?.. Среди моря врагов?', 23420),
(40078, 'ruRU', 'С твоими кулинарными талантами может сравниться разве что твоя доблесть! $B$BНу а теперь, когда мы наелись, – пора в Чертоги Доблести!', 23420),
(39855, 'ruRU', 'Итак, $gмертвый побывал в Хельхейме и сумел:мертвая побывала в Хельхейме и сумела; вернуться обратно? Впечатляюще. $B$BТвои испытания пройдены, и то, что ты $gдостоин:достойна;, теперь не подлежит сомнению. $B$BСтупай же навстречу своей судьбе. В Чертоги Доблести!', 23420),
(39853, 'ruRU', 'Итак, мы победили. Время получить заслуженную награду. $B$BБудем надеяться, что Хелия не отменит сделку.', 23420),
(39851, 'ruRU', 'Очень удачно, что мои девы щита вернулись ко мне. $B$BСегодня ты не только $gобрел:обрела; новых союзников, но и $gзаслужил:заслужила; мою благодарность.', 23420),
(39850, 'ruRU', 'Да, я чувствую, что твоя сила полностью вернулась к тебе. $B$BХелия проклянет тот день, когда связалась с тобой.', 23420),
(39849, 'ruRU', 'Похоже, это как раз то, что нам нужно. $B$BТеперь мы можем начать подготовку к предстоящей битве.', 23420),
(39857, 'ruRU', 'Выглядишь просто ужасно. $B$BЯ так понимаю, Хелия не проявила к тебе снисхождения?', 23420),
(39848, 'ruRU', '<Голос Хелии, кажется, звучит отовсюду.>$B$BНикто не смеет покинуть Хельхейм без моего разрешения! Но если ты развлечешь меня, я подумаю о твоем освобождении.', 23420),
(38347, 'ruRU', 'Это было отвратительно, $gиноземец:чужестранка;. Даже в смерти я не нюхала ничего более гнусного.', 23420),
(38324, 'ruRU', 'Да, они отлично подойдут.$B$BНу что, посмотрим, удастся ли нам провести старину Гарма?', 23420),
(38339, 'ruRU', 'СКОЛЬКО-СКОЛЬКО ты $gубил:убила; квалдиров?! Ну ничего себе! Ты куда храбрее, чем кажешься, $gиноземец:чужестранка;!$B$BДумаю, Хелия теперь точно отпустит отсюда нас обоих – после того, как мы обдурим ее цербера.', 23420),
(39837, 'ruRU', 'Наконец-то свобода! $B$BМеня поймали квалдиры, когда я обмозговывал, как бы проскользнуть мимо этой отвратительной псины Гарма. Вот с тех пор я здесь и сижу! $B$BЯ уж думал, что никогда отсюда не выберусь.', 23420),
(38818, 'ruRU', 'Я содрогаюсь от одной мысли о своей судьбе... $B$BЯ недооценила силу Фальяра и жестоко поплатилась за это.$B$BТо, что он имел власть изгнать нас сюда... это просто немыслимо.', 23420),
(38815, 'ruRU', 'Где... где я? $B$BЯ... тебя знаю...', 23420),
(38823, 'ruRU', 'Эти мистики не пожалели стараний, чтобы ослабить дух Ашильдир. $B$BБудем надеяться, что теперь ее дух достаточно силен, чтобы откликнуться на призыв и пробудиться.', 23420),
(38816, 'ruRU', 'Это была славная битва. Королева валь\'кир отмщена.', 23420),
(38817, 'ruRU', 'Коварство Говорящих с костями не знает границ. $B$BС помощью своих гнусных ритуалов они пытаются расколоть саму душу нашей королевы – но мы теперь воспользуемся этой же самой магией, чтобы вернуть ее в мир живых!', 23420),
(39791, 'ruRU', 'Я вижу в твоей руке ветвь Рунного леса. Стало быть, это ты $gупокоил:упокоила; потревоженных духов? $B$BХоть я и не знаю, какие цели ты преследуешь, $gиноземец:чужестранка;, я все равно очень благодарна тебе за то, что ты $gсделал:сделала; для нашего народа.', 23420),
(38811, 'ruRU', 'Могила Ашильдир потревожена, $gиноземец:чужестранка;. $B$BТебе что-нибудь известно об этом?', 23420),
(38808, 'ruRU', 'Эти сердца выглядят очень аппетитно. $B$BДремлющие короли не смогут от них отказаться.', 23420),
(38810, 'ruRU', 'Да, этот душевик прекрасно подойдет для твоего ритуала. $B$BСкажи, когда будешь $gготов:готова; начать, и я дам тебе дальнейшие инструкции.', 23420),
(39788, 'ruRU', 'Теперь, когда Говорящих с костями в Рунном лесу больше нет, в нем снова воцарится мир и покой. $B$BЭто доброе начало.', 23420),
(38778, 'ruRU', 'Так это звуки твоих шагов донеслись до меня, когда рунные камни утратили свою власть надо мной? $B$BБлагодарю тебя, $gиноземец:чужестранка;.', 23420),
(39796, 'ruRU', 'Порча... Безумие... $B$BГоворящие с костями...', 23420),
(39804, 'ruRU', 'Разделано просто отлично. Тебе бы в мясники пойти! $B$BДумаю, Говорящие с костями не доставят тебе особых хлопот.', 23420),
(39803, 'ruRU', 'О, $gгерой:героиня; дня! Нельзя терять время! $B$BНужно завершить начатое дело, если ты хочешь преуспеть в своих испытаниях!', 23420),
(38624, 'ruRU', '<Ворон громко каркает, и в вашей голове звучит голос Хави.>$B$BТы $gсилен:сильна; – испытание ясно показало это. $B$BНо доблесть – иной попутчик. Следует ли она за тобой?', 23420),
(39652, 'ruRU', 'Ты $gнастоящий герой:настоящая героиня;, и моя стая в огромном долгу перед тобой. $B$BСегодня ты $gобрел:обрела; могущественных союзников, $gиноземец:чужестранка;. Король-бог не зря боится тебя.', 23420),
(38413, 'ruRU', 'За то, что ты $gсделал:сделала;, я в огромном долгу перед тобой. Мои собратья не смогли сами защитить себя от скверноскорнских врайкулов и закончили бы свою жизнь у них в рабстве, если бы не ты. $B$BТы настоящий друг торигниров.', 23420),
(40568, 'ruRU', 'Сегодня сквернскорнские врайкулы узнали, что такое настоящая боевая мощь. $B$BТеперь они сто раз подумают, прежде чем обращать против тебя оружие.', 23420),
(38414, 'ruRU', 'Весть о спасении нашей родительницы стала для меня огромным облегчением. $B$BДумаю, она лично захочет выразить тебе свою благодарность.', 23420),
(38412, 'ruRU', 'Ты хочешь пройти испытание? Боюсь, что ты $gопоздал:опоздала;.$B$BЭта битва со сквернскорнскими врайкулами окончательно нас вымотала. Я слишком слаб, чтобы дать тебе ту силу, которую ты ищешь...$B$BВпрочем, ты еще можешь нам помочь...', 23420),
(38342, 'ruRU', 'Я смотрю, тебя ничто не остановит!', 23420),
(38410, 'ruRU', 'Хе-хе! Похоже, они совсем не ждали такого поворота событий!$B$BОднако на этом наши неприятности не заканчиваются.', 23420),
(38337, 'ruRU', 'Набрать этой чешуи было отличной идеей. $B$BСделать из нее приличные доспехи проще простого.', 23420),
(38405, 'ruRU', 'Прекрасно. Теперь тебе не страшны ни дождь, ни молния.', 23420),
(38318, 'ruRU', 'Ловко ты $gперелетел:перелетела; через стену! Врайкулы, что видели тебя, аж остолбенели! $B$BВообще-то этот гарпун – очень полезная штука и наверняка не раз еще пригодится. Оставь пока его у себя.', 23420),
(38312, 'ruRU', 'Похоже, это как раз то, что нужно. $B$BПошли скорее, пока нас не засекли.', 23420),
(38473, 'ruRU', 'Отрадно видеть тебя, $n. Седогрив отправил меня искать в этой деревне сведения об Эгиде. $B$BПока ничего выяснить не удалось – кроме того, что местные жители настроены весьма враждебно. Впрочем, когда бывало иначе?$B$BНадеюсь, тебе больше повезет в поисках.', 23420),
(39597, 'ruRU', 'Испытание пройдено, и ты все еще $gжив:жива;. Воистину, пути нашего мира неисповедимы.$B$BПохоже, Король-бог хочет осложнить твою задачу, подкидывая тебе дополнительные испытания. Но отдыхать пока некогда – следующее испытание уже ждет!', 23420),
(39594, 'ruRU', 'Испытание пройдено! Слава $gпобедителю:победительнице;! $B$BЭто большое достижение, но тебе предстоит сделать еще немало. На пути к Эгиде тебя будет ожидать множество других испытаний и опасностей.', 23420),
(39593, 'ruRU', 'Великолепно! $B$BКак же здорово снова ощущать себя целым!', 23420),
(39592, 'ruRU', 'Обретенное тобой знание станет мощным оружием, которое ты обратишь против своих врагов. $B$BПомни об этом.', 23420),
(39591, 'ruRU', 'Теперь ты знаешь, с чем тебе предстоит столкнуться. Ты еще не $gпередумал:передумала;?', 23420),
(39595, 'ruRU', 'Твои дары пришлись мне по нраву, $gиноземец:чужестранка;. Вижу, ты с большим почтением относишься к испытаниям. $B$BУважение к нашим традициям поможет тебе добиться успеха.', 23420),
(39590, 'ruRU', 'Жаль, что первый достойный претендент с таким пренебрежением отнесся к испытаниям. С такой самоуверенностью ему не видать Эгиды, как своих ушей, ибо боги, несомненно, покарают его за гордыню.\n\nНо ты, похоже, другого склада. Ты $gдоказал, что достоин:доказала, что достойна; пройти испытания. $B$BПоэтому я допущу тебя до них.', 23420),
(38331, 'ruRU', 'О, да ты бросаешь прямо как дева щита!$B$BЧего зыркаешь? Это комплимент! $B$BПопробуй лучше похлебку. Насладись вкусом хорошо выполненной задачи.', 23420),
(38210, 'ruRU', 'Понимаю, у тебя много вопросов. Ты получишь ответы на них в свое время.$B$BЯ Хави, и через меня с тобой говорят валарьяры – славные хранители Чертогов Доблести. $B$BЕсли ты ищешь Эгиду, тебе понадобится моя помощь. О да, я знаю, зачем ты $gпришел, чужестранец:пришла, чужестранка;. Мне многое ведомо...', 23420),
(39775, 'ruRU', 'Это похоже на гарпун – с помощью таких местные врайкулы поднимаются по крутым склонам Штормхейма.$B$BМожет пригодиться.', 23420),
(38059, 'ruRU', '<Лампочки передатчика загораются. Вы слышите встревоженный голос.>$B$BЕсть кто на связи? Слышно меня? (Свет мне свидетель, как же я ненавижу эти штуки.)$B$BГоворит Мишка. Пропавшие солдаты 7-го легиона вернулись в лагерь. Вроде все на месте.$B$BЭ-э... у меня все. Конец связи.$B$BВсего доброго.$B$BКонец сооб... <Связь внезапно прерывается.>', 23420),
(38057, 'ruRU', '<Солдат никак не реагирует на вас, хотя его глаза открыты. Он окружен электрическим полем, издающим слабое гудение.>', 23420),
(38060, 'ruRU', 'Наш сигнал бедствия приняли. В ближайшее время нас эвакуируют на заставу Седогрива.$B$BБоюсь, что дальше тебе придется справляться уже без нас. Как только мы туда доберемся, я отправлю разведывательные патрули выяснять местоположение Эгиды.$B$BТы $gдолжен:должна; добыть Эгиду Агграмара, чтобы отразить угрозу Легиона!', 23420),
(38058, 'ruRU', 'Так... Батарея зарядилась полностью. Отлично.$B$BДальше нам понадобится антенна...', 23420),
(38558, 'ruRU', '<Замыкалец внимательно осматривает кристалл.>$B$BВроде порядок. Блестит, как новенький!', 23420),
(38053, 'ruRU', 'ВИНТ-ПЕРЕБОЛТ!$B$BПрошу прощения.$B$BБатарейка-то дохлая, совсем как тот упырь, у которого ты ее $gзабрал:забрала;. Нужно ее зарядить заново – но вот как?.. О, у меня есть идея...', 23420),
(38036, 'ruRU', 'Ты очень вовремя! Я чуть не начала перевязывать раненых листьями.', 23420),
(38052, 'ruRU', 'За корабль не переживай – в конце концов, это всего лишь металл да дерево.$B$BПока мы сражаемся, \"Небесный огонь\" будет жить.', 23420),
(39800, 'ruRU', 'Вижу, тебе удалось избежать взрыва. Увы, Седогриву не так повезло...$B$BСоберись! Надо шевелиться, пока нас не добили Отрекшиеся!', 23420);

DELETE FROM `quest_objectives_locale` WHERE (`locale`='ruRU' AND `ID` IN (285171,285173,288525,283519));
INSERT INTO `quest_objectives_locale` (`ID`, `locale`, `QuestId`, `StorageIndex`, `Description`, `VerifiedBuild`) VALUES
(285171, 'ruRU', 43324, 1, 'Совухи убиты', 23420),
(285173, 'ruRU', 43324, 4, 'Сестра Луны освобождена', 23420),
(288525, 'ruRU', 43324, -1, 'Спасти Грот Потерянного Света', 23420),
(283519, 'ruRU', 42076, 7, 'Гарпий из племени Червивого Когтя убито', 23420);

DELETE FROM `quest_greeting_locale` WHERE (`ID`=94318 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=97480 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=91531 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=97270 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=93446 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=91249 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=91519 AND `Type`=0 AND `locale`='ruRU') OR (`ID`=243836 AND `Type`=1 AND `locale`='ruRU') OR (`ID`=90866 AND `Type`=0 AND `locale`='ruRU');
INSERT INTO `quest_greeting_locale` (`ID`, `Type`, `locale`, `Greeting`, `VerifiedBuild`) VALUES
(94318, 0, 'ruRU', 'Если мы хотим задержать королеву банши, нужно действовать быстро. $B$BТы $gготов:готова; исполнить свой долг, |3-6($c)?', 23420),
(97480, 0, 'ruRU', 'Хелия – могучий враг, но мы непременно должны ее одолеть.', 23420),
(91531, 0, 'ruRU', 'Наверняка тебе, как и мне, не место в Хельхейме. $B$BНадеюсь, Хелия возражать не будет.', 23420),
(97270, 0, 'ruRU', 'Что ты $gнашел:нашла; в Хауствальде?', 23420),
(93446, 0, 'ruRU', 'Мистики совершили здесь страшное злодеяние. Валь\'киры не забудут этого.', 23420),
(91249, 0, 'ruRU', 'Ты... $B$BТы не $gпохож:похожа; на остальных.', 23420),
(91519, 0, 'ruRU', 'Мы почти у цели, но есть одна маленькая проблема...', 23420),
(243836, 1, 'ruRU', 'Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!', 23420),
(90866, 0, 'ruRU', 'Этим негодяям удалось взорвать наши ящики с боеприпасами. Это просто чудо, что корабль продержался так долго!', 23420);

DELETE FROM `quest_request_items_locale` WHERE (`locale`='ruRU' AND `ID` IN (39405,39061,40002,39849,39848,38324,38339,38817,38808,38810,38413,38337,38405,39593,39595,39590,38558,38053,38036));
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(39405, 'ruRU', 'Это, похоже, последняя строфа.', 23420),
(39061, 'ruRU', 'Что тебе удалось выяснить?', 23420),
(40002, 'ruRU', 'Ключ... у тюремщика...', 23420),
(39849, 'ruRU', 'Тебе удалось достать светильник?', 23420),
(39848, 'ruRU', '<При вашем приближении в воздухе повисает мертвая тишина.>', 23420),
(38324, 'ruRU', 'Прежде чем двигаться дальше, надо набрать побольше костей.', 23420),
(38339, 'ruRU', 'Ну что, хватает тебе водорослей для маскировки?', 23420),
(38817, 'ruRU', 'Тебе удалось вернуть останки Ашильдир?', 23420),
(38808, 'ruRU', 'Как твоя охота, $gиноземец:чужестранка;?', 23420),
(38810, 'ruRU', 'Что ты мне $gпринес:принесла;?', 23420),
(38413, 'ruRU', 'Какие новости ты несешь о моих братьях и сестрах?', 23420),
(38337, 'ruRU', 'Ну, что у тебя там?', 23420),
(38405, 'ruRU', 'Все $gнашел:нашла;?', 23420),
(39593, 'ruRU', 'Тебе удалось найти их все?', 23420),
(39595, 'ruRU', 'Что ты $gпринес:принесла;, $n?$B$BТы оказываешь мне честь, $gиноземец:чужестранка;.', 23420),
(39590, 'ruRU', 'Странные дары ты мне $gпринес, претендент:принесла, претендентка;...', 23420),
(38558, 'ruRU', 'Ты $gнашел:нашла; осциллятор?', 23420),
(38053, 'ruRU', 'Без этой батареи я не смогу сконструировать новый передатчик!', 23420),
(38036, 'ruRU', 'Удалось что-нибудь отыскать?', 23420);

DELETE FROM `quest_offer_reward` WHERE `ID`=38337;
INSERT INTO `quest_offer_reward` (`ID`, `Emote1`, `Emote2`, `Emote3`, `Emote4`, `EmoteDelay1`, `EmoteDelay2`, `EmoteDelay3`, `EmoteDelay4`, `RewardText`, `VerifiedBuild`) VALUES
(38337, 1, 0, 0, 0, 0, 0, 0, 0, 'Набрать этой чешуи было отличной идеей. $B$BСделать из нее приличные доспехи проще простого.', 23420); -- Built to Scale

UPDATE `quest_offer_reward` SET `RewardText`='О, привет! Ты, наверно, ищешь тауренов, которые стояли здесь лагерем. Они ненадолго отошли, но мы с Пронырой здесь, и мы о тебе позаботимся! $B$BГоворишь, тебе обещали заплатить за убийство воргов? Без проблем!$B$BЗолота у меня немного, зато есть другие ценные штуки. Выбирай!' WHERE `ID`=39789; -- Eating Into Our Business
UPDATE `quest_offer_reward` SET `RewardText`='Ты $gочнулся:очнулась;! Мы уж думали, что тебе конец... $B$BТебе очень повезло, что мы успели вовремя вытащить вас с Седогривом. Еще немного, и яд Сильваны тебя бы доконал. Жаль, конечно, что ей удалось улизнуть, но теперь ее планы в Скольд-Ашиле пошли прахом, и это целиком и полностью твоя заслуга. $B$BВне всякого сомнения, Седогрив захочет объявить тебе личную благодарность, когда малость поправится. Ты очень $gпомог:помогла; нашему делу, $n. $B$BГилнеас в огромном долгу перед тобой.', `VerifiedBuild`=23420 WHERE `ID`=39122; -- Ending the New Beginning
UPDATE `quest_offer_reward` SET `RewardText`='Ты $gочнулся:очнулась;! Мы уж думали, что тебе конец... $B$BТебе очень повезло, что мы успели вовремя вытащить вас с Седогривом. Еще немного, и яд Сильваны тебя бы доконал. Жаль, конечно, что ей удалось улизнуть, но теперь ее планы в Скольд-Ашиле пошли прахом, и это целиком и полностью твоя заслуга. $B$BВне всякого сомнения, Седогрив захочет объявить тебе личную благодарность, когда малость поправится. Ты очень $gпомог:помогла; нашему делу, $n. $B$BГилнеас в огромном долгу перед тобой.', `VerifiedBuild`=23420 WHERE `ID`=39122; -- Ending the New Beginning
UPDATE `quest_offer_reward` SET `RewardText`='Рад видеть тебя, $n. $B$BШтурм лагеря Дредвейка не задался, и я уж было решил, что наше дело дрянь, но тут Краули сообщила мне о твоих успехах.$B$BПора закончить наше дело!', `VerifiedBuild`=23420 WHERE `ID`=39092; -- Becoming the Ascendant
UPDATE `quest_offer_reward` SET `RewardText`='В этой поэме рассказывается о том, как Ашильдир основала орден дев щита и привела их в Скольд-Ашиль.$B$BЕсли девы щита и впрямь почитают королеву валь\'кир, то услуги, которые вы ей оказали в Хельхейме, поднимут вас в их глазах.', `VerifiedBuild`=23420 WHERE `ID`=39405; -- Stories of Battle
UPDATE `quest_offer_reward` SET `RewardText`='Валь\'киры, говоришь? Выходит, все гораздо печальнее, чем я думала. Если Сильвана получит возможность создавать новых валь\'кир, ее армия станет непобедимой.$B$BОчень похоже, что ее конечной целью является склеп. Мы должны остановить ее!', `VerifiedBuild`=23420 WHERE `ID`=39063; -- Shielded Secrets
UPDATE `quest_offer_reward` SET `RewardText`='Прискорбно, что Король-бог спасся бегством, но его поражение остановило натиск Легиона на Штормхейм.$B$BА сейчас тебя ждут Чертоги Доблести.', `VerifiedBuild`=23420 WHERE `ID`=40005; -- Stormheim's Salvation
UPDATE `quest_offer_reward` SET `RewardText`='Повелители Скверны повержены, и теперь войска Короля-бога будут рассеяны. $B$BНо мы еще не закончили. Пока демоны штурмуют Врата, Штормхейм все еще в опасности.', `VerifiedBuild`=23420 WHERE `ID`=40004; -- Break the Spine
UPDATE `quest_offer_reward` SET `RewardText`='Ничего не понимаю. Порталы закрыты, но демоны Сковальда продолжают штурмовать Врата! $B$BМы должны выяснить, откуда они прибывают!', `VerifiedBuild`=23420 WHERE `ID`=40003; -- Stem the Tide
UPDATE `quest_offer_reward` SET `RewardText`='Значит, подкрепление прибыло? $B$BОтлично. Нам нужно поспешить, если мы хотим узнать о планах Сильваны прежде, чем она осуществит их.', `VerifiedBuild`=23420 WHERE `ID`=39062; -- To Skold-Ashil
UPDATE `quest_offer_reward` SET `RewardText`='Эти Отрекшиеся мутили свою чуму прямо у нас под носом. Какая наглость! Но ничего – покончив с аптекарем, мы вырвали у них ядовитые зубы. $B$BТы хорошо $gпоработал:поработала;, $n.', `VerifiedBuild`=23420 WHERE `ID`=39472; -- Cut Out the Heart
UPDATE `quest_offer_reward` SET `RewardText`='Прекрасно. Наконец-то части головоломки начинают складываться в цельную картину. $B$BМожет, мы пока и не знаем, что здесь делают силы Сильваны, но зато, похоже, теперь нам известно их местонахождение.', `VerifiedBuild`=23420 WHERE `ID`=39061; -- Whispers from the Dark
UPDATE `quest_offer_reward` SET `RewardText`='Дело сделано. $B$BТы $gоказал:оказала; воргенам огромную услугу, $n.', `VerifiedBuild`=23420 WHERE `ID`=39060; -- Combustible Contagion
UPDATE `quest_offer_reward` SET `RewardText`='Ты очень вовремя, $n.', `VerifiedBuild`=23420 WHERE `ID`=39059; -- To Catch a Banshee
UPDATE `quest_offer_reward` SET `RewardText`='Ты не перестаешь удивлять меня, $gиноземец:чужестранка;. Твои испытания пройдены – но впереди ждут другие. $B$BСилы Короля-бога велики, но в твоем оружии заключена сила самого Штормхейма! Когда ты приблизишься к Вратам, она повергнет врагов нашего края!$B$BПришло время дать Королю-богу решительный бой и очистить Врата Доблести от скверны!', `VerifiedBuild`=23420 WHERE `ID`=40002; -- A Familiar Fate
UPDATE `quest_offer_reward` SET `RewardText`='Кого это... я вижу? $B$BДруга?.. Среди моря врагов?', `VerifiedBuild`=23420 WHERE `ID`=40001; -- Knocking on Valor's Door
UPDATE `quest_offer_reward` SET `RewardText`='С твоими кулинарными талантами может сравниться разве что твоя доблесть! $B$BНу а теперь, когда мы наелись, – пора в Чертоги Доблести!', `VerifiedBuild`=23420 WHERE `ID`=40078; -- A Heavy Burden
UPDATE `quest_offer_reward` SET `RewardText`='Итак, $gмертвый побывал в Хельхейме и сумел:мертвая побывала в Хельхейме и сумела; вернуться обратно? Впечатляюще. $B$BТвои испытания пройдены, и то, что ты $gдостоин:достойна;, теперь не подлежит сомнению. $B$BСтупай же навстречу своей судьбе. В Чертоги Доблести!', `VerifiedBuild`=23420 WHERE `ID`=39855; -- Paid in Lifeblood
UPDATE `quest_offer_reward` SET `RewardText`='Итак, мы победили. Время получить заслуженную награду. $B$BБудем надеяться, что Хелия не отменит сделку.', `VerifiedBuild`=23420 WHERE `ID`=39853; -- Victory is Eternal
UPDATE `quest_offer_reward` SET `RewardText`='Очень удачно, что мои девы щита вернулись ко мне. $B$BСегодня ты не только $gобрел:обрела; новых союзников, но и $gзаслужил:заслужила; мою благодарность.', `VerifiedBuild`=23420 WHERE `ID`=39851; -- Allies in Death
UPDATE `quest_offer_reward` SET `RewardText`='Да, я чувствую, что твоя сила полностью вернулась к тебе. $B$BХелия проклянет тот день, когда связалась с тобой.', `VerifiedBuild`=23420 WHERE `ID`=39850; -- Sundered
UPDATE `quest_offer_reward` SET `RewardText`='Похоже, это как раз то, что нам нужно. $B$BТеперь мы можем начать подготовку к предстоящей битве.', `VerifiedBuild`=23420 WHERE `ID`=39849; -- To Light the Way
UPDATE `quest_offer_reward` SET `RewardText`='Выглядишь просто ужасно. $B$BЯ так понимаю, Хелия не проявила к тебе снисхождения?', `VerifiedBuild`=23420 WHERE `ID`=39857; -- The Eternal Nemesis
UPDATE `quest_offer_reward` SET `RewardText`='<Голос Хелии, кажется, звучит отовсюду.>$B$BНикто не смеет покинуть Хельхейм без моего разрешения! Но если ты развлечешь меня, я подумаю о твоем освобождении.', `VerifiedBuild`=23420 WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_offer_reward` SET `RewardText`='Это было отвратительно, $gиноземец:чужестранка;. Даже в смерти я не нюхала ничего более гнусного.', `VerifiedBuild`=23420 WHERE `ID`=38347; -- Stealth by Seaweed
UPDATE `quest_offer_reward` SET `RewardText`='Да, они отлично подойдут.$B$BНу что, посмотрим, удастся ли нам провести старину Гарма?', `VerifiedBuild`=23420 WHERE `ID`=38324; -- Accessories of the Cursed
UPDATE `quest_offer_reward` SET `RewardText`='СКОЛЬКО-СКОЛЬКО ты $gубил:убила; квалдиров?! Ну ничего себе! Ты куда храбрее, чем кажешься, $gиноземец:чужестранка;!$B$BДумаю, Хелия теперь точно отпустит отсюда нас обоих – после того, как мы обдурим ее цербера.', `VerifiedBuild`=23420 WHERE `ID`=38339; -- A Little Kelp From My Foes
UPDATE `quest_offer_reward` SET `RewardText`='Наконец-то свобода! $B$BМеня поймали квалдиры, когда я обмозговывал, как бы проскользнуть мимо этой отвратительной псины Гарма. Вот с тех пор я здесь и сижу! $B$BЯ уж думал, что никогда отсюда не выберусь.', `VerifiedBuild`=23420 WHERE `ID`=39837; -- An Unworthy Task
UPDATE `quest_offer_reward` SET `RewardText`='Наконец-то свобода! $B$BМеня поймали квалдиры, когда я обмозговывал, как бы проскользнуть мимо этой отвратительной псины Гарма. Вот с тех пор я здесь и сижу! $B$BЯ уж думал, что никогда отсюда не выберусь.', `VerifiedBuild`=23420 WHERE `ID`=39837; -- An Unworthy Task
UPDATE `quest_offer_reward` SET `RewardText`='Я содрогаюсь от одной мысли о своей судьбе... $B$BЯ недооценила силу Фальяра и жестоко поплатилась за это.$B$BТо, что он имел власть изгнать нас сюда... это просто немыслимо.', `VerifiedBuild`=23420 WHERE `ID`=38818; -- The Final Judgment
UPDATE `quest_offer_reward` SET `RewardText`='Где... где я? $B$BЯ... тебя знаю...', `VerifiedBuild`=23420 WHERE `ID`=38815; -- Waking the Shieldmaiden
UPDATE `quest_offer_reward` SET `RewardText`='Эти мистики не пожалели стараний, чтобы ослабить дух Ашильдир. $B$BБудем надеяться, что теперь ее дух достаточно силен, чтобы откликнуться на призыв и пробудиться.', `VerifiedBuild`=23420 WHERE `ID`=38823; -- The Runes that Bind
UPDATE `quest_offer_reward` SET `RewardText`='Это была славная битва. Королева валь\'кир отмщена.', `VerifiedBuild`=23420 WHERE `ID`=38816; -- Breaking the Bonespeakers
UPDATE `quest_offer_reward` SET `RewardText`='Коварство Говорящих с костями не знает границ. $B$BС помощью своих гнусных ритуалов они пытаются расколоть саму душу нашей королевы – но мы теперь воспользуемся этой же самой магией, чтобы вернуть ее в мир живых!', `VerifiedBuild`=23420 WHERE `ID`=38817; -- Regal Remains
UPDATE `quest_offer_reward` SET `RewardText`='Я вижу в твоей руке ветвь Рунного леса. Стало быть, это ты $gупокоил:упокоила; потревоженных духов? $B$BХоть я и не знаю, какие цели ты преследуешь, $gиноземец:чужестранка;, я все равно очень благодарна тебе за то, что ты $gсделал:сделала; для нашего народа.', `VerifiedBuild`=23420 WHERE `ID`=39791; -- Lay Them to Rest
UPDATE `quest_offer_reward` SET `RewardText`='Могила Ашильдир потревожена, $gиноземец:чужестранка;. $B$BТебе что-нибудь известно об этом?', `VerifiedBuild`=23420 WHERE `ID`=38811; -- Judgment Day
UPDATE `quest_offer_reward` SET `RewardText`='Эти сердца выглядят очень аппетитно. $B$BДремлющие короли не смогут от них отказаться.', `VerifiedBuild`=23420 WHERE `ID`=38808; -- Bjornharta
UPDATE `quest_offer_reward` SET `RewardText`='Да, этот душевик прекрасно подойдет для твоего ритуала. $B$BСкажи, когда будешь $gготов:готова; начать, и я дам тебе дальнейшие инструкции.', `VerifiedBuild`=23420 WHERE `ID`=38810; -- The Dreaming Fungus
UPDATE `quest_offer_reward` SET `RewardText`='Теперь, когда Говорящих с костями в Рунном лесу больше нет, в нем снова воцарится мир и покой. $B$BЭто доброе начало.', `VerifiedBuild`=23420 WHERE `ID`=39788; -- The Runewood's Revenge
UPDATE `quest_offer_reward` SET `RewardText`='Так это звуки твоих шагов донеслись до меня, когда рунные камни утратили свою власть надо мной? $B$BБлагодарю тебя, $gиноземец:чужестранка;.', `VerifiedBuild`=23420 WHERE `ID`=38778; -- Turn the Keys
UPDATE `quest_offer_reward` SET `RewardText`='Порча... Безумие... $B$BГоворящие с костями...', `VerifiedBuild`=23420 WHERE `ID`=39796; -- To Haustvald
UPDATE `quest_offer_reward` SET `RewardText`='Разделано просто отлично. Тебе бы в мясники пойти! $B$BДумаю, Говорящие с костями не доставят тебе особых хлопот.', `VerifiedBuild`=23420 WHERE `ID`=39804; -- Speaking of Bones
UPDATE `quest_offer_reward` SET `RewardText`='О, $gгерой:героиня; дня! Нельзя терять время! $B$BНужно завершить начатое дело, если ты хочешь преуспеть в своих испытаниях!', `VerifiedBuild`=23420 WHERE `ID`=39803; -- The Trials Continue
UPDATE `quest_offer_reward` SET `RewardText`='<Ворон громко каркает, и в вашей голове звучит голос Хави.>$B$BТы $gсилен:сильна; – испытание ясно показало это. $B$BНо доблесть – иной попутчик. Следует ли она за тобой?', `VerifiedBuild`=23420 WHERE `ID`=38624; -- Cry Thunder!
UPDATE `quest_offer_reward` SET `RewardText`='Ты $gнастоящий герой:настоящая героиня;, и моя стая в огромном долгу перед тобой. $B$BСегодня ты $gобрел:обрела; могущественных союзников, $gиноземец:чужестранка;. Король-бог не зря боится тебя.', `VerifiedBuild`=23420 WHERE `ID`=39652; -- Where Dragons Rule
UPDATE `quest_offer_reward` SET `RewardText`='За то, что ты $gсделал:сделала;, я в огромном долгу перед тобой. Мои собратья не смогли сами защитить себя от скверноскорнских врайкулов и закончили бы свою жизнь у них в рабстве, если бы не ты. $B$BТы настоящий друг торигниров.', `VerifiedBuild`=23420 WHERE `ID`=38413; -- Wings of Liberty
UPDATE `quest_offer_reward` SET `RewardText`='Сегодня сквернскорнские врайкулы узнали, что такое настоящая боевая мощь. $B$BТеперь они сто раз подумают, прежде чем обращать против тебя оружие.', `VerifiedBuild`=23420 WHERE `ID`=40568; -- Fury of the Storm
UPDATE `quest_offer_reward` SET `RewardText`='Весть о спасении нашей родительницы стала для меня огромным облегчением. $B$BДумаю, она лично захочет выразить тебе свою благодарность.', `VerifiedBuild`=23420 WHERE `ID`=38414; -- Heart of a Dragon
UPDATE `quest_offer_reward` SET `RewardText`='Ты хочешь пройти испытание? Боюсь, что ты $gопоздал:опоздала;.$B$BЭта битва со сквернскорнскими врайкулами окончательно нас вымотала. Я слишком слаб, чтобы дать тебе ту силу, которую ты ищешь...$B$BВпрочем, ты еще можешь нам помочь...', `VerifiedBuild`=23420 WHERE `ID`=38412; -- Above the Winter Moonlight
UPDATE `quest_offer_reward` SET `RewardText`='Я смотрю, тебя ничто не остановит!', `VerifiedBuild`=23420 WHERE `ID`=38342; -- Another Way
UPDATE `quest_offer_reward` SET `RewardText`='Хе-хе! Похоже, они совсем не ждали такого поворота событий!$B$BОднако на этом наши неприятности не заканчиваются.', `VerifiedBuild`=23420 WHERE `ID`=38410; -- Impalement Insurance
UPDATE `quest_offer_reward` SET `RewardText`='Прекрасно. Теперь тебе не страшны ни дождь, ни молния.', `VerifiedBuild`=23420 WHERE `ID`=38405; -- To Weather the Storm
UPDATE `quest_offer_reward` SET `RewardText`='Ловко ты $gперелетел:перелетела; через стену! Врайкулы, что видели тебя, аж остолбенели! $B$BВообще-то этот гарпун – очень полезная штука и наверняка не раз еще пригодится. Оставь пока его у себя.', `VerifiedBuild`=23420 WHERE `ID`=38318; -- No Wings Required
UPDATE `quest_offer_reward` SET `RewardText`='Похоже, это как раз то, что нужно. $B$BПошли скорее, пока нас не засекли.', `VerifiedBuild`=23420 WHERE `ID`=38312; -- A Grapple a Day
UPDATE `quest_offer_reward` SET `RewardText`='Отрадно видеть тебя, $n. Седогрив отправил меня искать в этой деревне сведения об Эгиде. $B$BПока ничего выяснить не удалось – кроме того, что местные жители настроены весьма враждебно. Впрочем, когда бывало иначе?$B$BНадеюсь, тебе больше повезет в поисках.', `VerifiedBuild`=23420 WHERE `ID`=38473; -- Will of the Thorignir
UPDATE `quest_offer_reward` SET `RewardText`='Испытание пройдено, и ты все еще $gжив:жива;. Воистину, пути нашего мира неисповедимы.$B$BПохоже, Король-бог хочет осложнить твою задачу, подкидывая тебе дополнительные испытания. Но отдыхать пока некогда – следующее испытание уже ждет!', `VerifiedBuild`=23420 WHERE `ID`=39597; -- The Blessing of the Watchers
UPDATE `quest_offer_reward` SET `RewardText`='Испытание пройдено! Слава $gпобедителю:победительнице;! $B$BЭто большое достижение, но тебе предстоит сделать еще немало. На пути к Эгиде тебя будет ожидать множество других испытаний и опасностей.', `VerifiedBuild`=23420 WHERE `ID`=39594; -- A Trial of Might
UPDATE `quest_offer_reward` SET `RewardText`='Великолепно! $B$BКак же здорово снова ощущать себя целым!', `VerifiedBuild`=23420 WHERE `ID`=39593; -- The Shattered Watcher
UPDATE `quest_offer_reward` SET `RewardText`='Обретенное тобой знание станет мощным оружием, которое ты обратишь против своих врагов. $B$BПомни об этом.', `VerifiedBuild`=23420 WHERE `ID`=39592; -- A Trial of Will
UPDATE `quest_offer_reward` SET `RewardText`='Теперь ты знаешь, с чем тебе предстоит столкнуться. Ты еще не $gпередумал:передумала;?', `VerifiedBuild`=23420 WHERE `ID`=39591; -- A Trial of Valor
UPDATE `quest_offer_reward` SET `RewardText`='Твои дары пришлись мне по нраву, $gиноземец:чужестранка;. Вижу, ты с большим почтением относишься к испытаниям. $B$BУважение к нашим традициям поможет тебе добиться успеха.', `VerifiedBuild`=23420 WHERE `ID`=39595; -- Blood and Gold
UPDATE `quest_offer_reward` SET `RewardText`='Жаль, что первый достойный претендент с таким пренебрежением отнесся к испытаниям. С такой самоуверенностью ему не видать Эгиды, как своих ушей, ибо боги, несомненно, покарают его за гордыню.\n\nНо ты, похоже, другого склада. Ты $gдоказал, что достоин:доказала, что достойна; пройти испытания. $B$BПоэтому я допущу тебя до них.', `VerifiedBuild`=23420 WHERE `ID`=39590; -- Ahead of the Game
UPDATE `quest_offer_reward` SET `RewardText`='О, да ты бросаешь прямо как дева щита!$B$BЧего зыркаешь? Это комплимент! $B$BПопробуй лучше похлебку. Насладись вкусом хорошо выполненной задачи.', `VerifiedBuild`=23420 WHERE `ID`=38331; -- Havi's Test
UPDATE `quest_offer_reward` SET `RewardText`='Понимаю, у тебя много вопросов. Ты получишь ответы на них в свое время.$B$BЯ Хави, и через меня с тобой говорят валарьяры – славные хранители Чертогов Доблести. $B$BЕсли ты ищешь Эгиду, тебе понадобится моя помощь. О да, я знаю, зачем ты $gпришел, чужестранец:пришла, чужестранка;. Мне многое ведомо...', `VerifiedBuild`=23420 WHERE `ID`=38210; -- The Ancient Trials
UPDATE `quest_offer_reward` SET `RewardText`='Это похоже на гарпун – с помощью таких местные врайкулы поднимаются по крутым склонам Штормхейма.$B$BМожет пригодиться.', `VerifiedBuild`=23420 WHERE `ID`=39775; -- Stormforged Grapple Launcher
UPDATE `quest_offer_reward` SET `RewardText`='<Лампочки передатчика загораются. Вы слышите встревоженный голос.>$B$BЕсть кто на связи? Слышно меня? (Свет мне свидетель, как же я ненавижу эти штуки.)$B$BГоворит Мишка. Пропавшие солдаты 7-го легиона вернулись в лагерь. Вроде все на месте.$B$BЭ-э... у меня все. Конец связи.$B$BВсего доброго.$B$BКонец сооб... <Связь внезапно прерывается.>', `VerifiedBuild`=23420 WHERE `ID`=38059; -- Pins and Needles
UPDATE `quest_offer_reward` SET `RewardText`='<Солдат никак не реагирует на вас, хотя его глаза открыты. Он окружен электрическим полем, издающим слабое гудение.>', `VerifiedBuild`=23420 WHERE `ID`=38057; -- The Lost Legion
UPDATE `quest_offer_reward` SET `RewardText`='Наш сигнал бедствия приняли. В ближайшее время нас эвакуируют на заставу Седогрива.$B$BБоюсь, что дальше тебе придется справляться уже без нас. Как только мы туда доберемся, я отправлю разведывательные патрули выяснять местоположение Эгиды.$B$BТы $gдолжен:должна; добыть Эгиду Агграмара, чтобы отразить угрозу Легиона!', `VerifiedBuild`=23420 WHERE `ID`=38060; -- Signal Boost
UPDATE `quest_offer_reward` SET `RewardText`='Так... Батарея зарядилась полностью. Отлично.$B$BДальше нам понадобится антенна...', `VerifiedBuild`=23420 WHERE `ID`=38058; -- Lightning Rod
UPDATE `quest_offer_reward` SET `RewardText`='<Замыкалец внимательно осматривает кристалл.>$B$BВроде порядок. Блестит, как новенький!', `VerifiedBuild`=23420 WHERE `ID`=38558; -- See Ya Later, Oscillator
UPDATE `quest_offer_reward` SET `RewardText`='ВИНТ-ПЕРЕБОЛТ!$B$BПрошу прощения.$B$BБатарейка-то дохлая, совсем как тот упырь, у которого ты ее $gзабрал:забрала;. Нужно ее зарядить заново – но вот как?.. О, у меня есть идея...', `VerifiedBuild`=23420 WHERE `ID`=38053; -- Assault and Battery
UPDATE `quest_offer_reward` SET `RewardText`='Ты очень вовремя! Я чуть не начала перевязывать раненых листьями.', `VerifiedBuild`=23420 WHERE `ID`=38036; -- Supplies From the Skies
UPDATE `quest_offer_reward` SET `RewardText`='За корабль не переживай – в конце концов, это всего лишь металл да дерево.$B$BПока мы сражаемся, \"Небесный огонь\" будет жить.', `VerifiedBuild`=23420 WHERE `ID`=38052; -- Boarded!
UPDATE `quest_offer_reward` SET `RewardText`='Вижу, тебе удалось избежать взрыва. Увы, Седогриву не так повезло...$B$BСоберись! Надо шевелиться, пока нас не добили Отрекшиеся!', `VerifiedBuild`=23420 WHERE `ID`=39800; -- Greymane's Gambit

DELETE FROM `quest_greeting` WHERE (`Type`=0 AND `ID` IN (94318,91519,90866));
INSERT INTO `quest_greeting` (`ID`, `Type`, `GreetEmoteType`, `GreetEmoteDelay`, `Greeting`, `VerifiedBuild`) VALUES
(94318, 0, 0, 0, 'Если мы хотим задержать королеву банши, нужно действовать быстро. $B$BТы $gготов:готова; исполнить свой долг, |3-6($c)?', 23420), -- 94318
(91519, 0, 0, 0, 'Мы почти у цели, но есть одна маленькая проблема...', 23420), -- 91519
(90866, 0, 0, 0, 'Этим негодяям удалось взорвать наши ящики с боеприпасами. Это просто чудо, что корабль продержался так долго!', 23420); -- 90866

UPDATE `quest_greeting` SET `Greeting`='Хелия – могучий враг, но мы непременно должны ее одолеть.' WHERE (`ID`=97480 AND `Type`=0); -- 97480
UPDATE `quest_greeting` SET `Greeting`='Хелия – могучий враг, но мы непременно должны ее одолеть.' WHERE (`ID`=97480 AND `Type`=0); -- 97480
UPDATE `quest_greeting` SET `Greeting`='Хелия – могучий враг, но мы непременно должны ее одолеть.' WHERE (`ID`=97480 AND `Type`=0); -- 97480
UPDATE `quest_greeting` SET `Greeting`='Наверняка тебе, как и мне, не место в Хельхейме. $B$BНадеюсь, Хелия возражать не будет.' WHERE (`ID`=91531 AND `Type`=0); -- 91531
UPDATE `quest_greeting` SET `Greeting`='Наверняка тебе, как и мне, не место в Хельхейме. $B$BНадеюсь, Хелия возражать не будет.' WHERE (`ID`=91531 AND `Type`=0); -- 91531
UPDATE `quest_greeting` SET `Greeting`='Что ты $gнашел:нашла; в Хауствальде?' WHERE (`ID`=97270 AND `Type`=0); -- 97270
UPDATE `quest_greeting` SET `Greeting`='Что ты $gнашел:нашла; в Хауствальде?' WHERE (`ID`=97270 AND `Type`=0); -- 97270
UPDATE `quest_greeting` SET `Greeting`='Мистики совершили здесь страшное злодеяние. Валь\'киры не забудут этого.' WHERE (`ID`=93446 AND `Type`=0); -- 93446
UPDATE `quest_greeting` SET `Greeting`='Мистики совершили здесь страшное злодеяние. Валь\'киры не забудут этого.' WHERE (`ID`=93446 AND `Type`=0); -- 93446
UPDATE `quest_greeting` SET `Greeting`='Ты... $B$BТы не $gпохож:похожа; на остальных.' WHERE (`ID`=91249 AND `Type`=0); -- 91249
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836
UPDATE `quest_greeting` SET `Greeting`='Этого не может быть! Как этот Сковальд посмел наплевать на древние ритуалы! $B$BЯ этого не допущу!' WHERE (`ID`=243836 AND `Type`=1); -- 243836


UPDATE `quest_request_items` SET `CompletionText`='Это, похоже, последняя строфа.' WHERE `ID`=39405; -- Stories of Battle
UPDATE `quest_request_items` SET `CompletionText`='Ключ... у тюремщика...' WHERE `ID`=40002; -- A Familiar Fate
UPDATE `quest_request_items` SET `CompletionText`='Ключ... у тюремщика...' WHERE `ID`=40002; -- A Familiar Fate
UPDATE `quest_request_items` SET `CompletionText`='Тебе удалось достать светильник?' WHERE `ID`=39849; -- To Light the Way
UPDATE `quest_request_items` SET `CompletionText`='<При вашем приближении в воздухе повисает мертвая тишина.>' WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_request_items` SET `CompletionText`='<При вашем приближении в воздухе повисает мертвая тишина.>' WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_request_items` SET `CompletionText`='<При вашем приближении в воздухе повисает мертвая тишина.>' WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_request_items` SET `CompletionText`='<При вашем приближении в воздухе повисает мертвая тишина.>' WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_request_items` SET `CompletionText`='<При вашем приближении в воздухе повисает мертвая тишина.>' WHERE `ID`=39848; -- A Desperate Bargain
UPDATE `quest_request_items` SET `CompletionText`='Прежде чем двигаться дальше, надо набрать побольше костей.' WHERE `ID`=38324; -- Accessories of the Cursed
UPDATE `quest_request_items` SET `CompletionText`='Ну что, хватает тебе водорослей для маскировки?' WHERE `ID`=38339; -- A Little Kelp From My Foes
UPDATE `quest_request_items` SET `CompletionText`='Тебе удалось вернуть останки Ашильдир?' WHERE `ID`=38817; -- Regal Remains
UPDATE `quest_request_items` SET `CompletionText`='Как твоя охота, $gиноземец:чужестранка;?' WHERE `ID`=38808; -- Bjornharta
UPDATE `quest_request_items` SET `CompletionText`='Что ты мне $gпринес:принесла;?' WHERE `ID`=38810; -- The Dreaming Fungus
UPDATE `quest_request_items` SET `CompletionText`='Какие новости ты несешь о моих братьях и сестрах?' WHERE `ID`=38413; -- Wings of Liberty
UPDATE `quest_request_items` SET `CompletionText`='Тебе удалось найти их все?' WHERE `ID`=39593; -- The Shattered Watcher
UPDATE `quest_request_items` SET `CompletionText`='Что ты $gпринес:принесла;, $n?$B$BТы оказываешь мне честь, $gиноземец:чужестранка;.' WHERE `ID`=39595; -- Blood and Gold
UPDATE `quest_request_items` SET `CompletionText`='Странные дары ты мне $gпринес, претендент:принесла, претендентка;...' WHERE `ID`=39590; -- Ahead of the Game

DELETE FROM `creature_template_addon` WHERE `entry` IN (109942 /*109942 (Storm's Reach Greatstag)*/, 107463 /*107463 (Storm's Reach Worg)*/, 109967 /*109967 (Storm's Reach Warbear)*/, 107020 /*107020 (Storm's Reach Cliffwalker)*/, 106611 /*106611 (Vadrak)*/, 95926 /*95926 (Genn Greymane)*/, 95932 /*95932 (Commander Lorna Crowley)*/, 95804 /*95804 (Genn Greymane)*/, 95859 /*95859 (Greywatch Guard)*/, 95921 /*95921 (Commander Lorna Crowley)*/, 108663 /*108663 (Lochaber)*/, 107942 /*107942 (Herald of Odyn)*/, 109590 /*109590 (Greywatch Guard)*/, 109522 /*109522 (Bronzeleaf Cub) - Cosmetic - Sleep Zzz*/, 93988 /*93988 (Enthralled Remains)*/, 93987 /*93987 (Apothecary Curseheart)*/, 109521 /*109521 (Bronzeleaf Grizzly) - Cosmetic - Sleep Zzz*/, 94347 /*94347 (Dread-Rider Cortis) - Plagued Ground*/, 94341 /*94341 (Credit  Bunny)*/, 94323 /*94323 (Nurse Dolores)*/, 94318 /*94318 (Genn Greymane)*/, 98109 /*98109 (Hankerin Ferinale)*/, 109570 /*109570 (Derek Testerman)*/, 98112 /*98112 (Steward Dayton)*/, 109567 /*109567 (Harrison McCabe)*/, 109525 /*109525 (Desmond) - Carry Hay*/, 105526 /*105526 (Helmouth Soulflayer)*/, 94346 /*94346 (Ensign Ward)*/, 109678 /*109678 (Greywatch Gryphon)*/, 91553 /*91553 (Commander Lorna Crowley)*/, 91519 /*91519 (Commander Lorna Crowley)*/, 91481 /*91481 (Commander Lorna Crowley)*/, 91222 /*91222 (Commander Lorna Crowley)*/, 98113 /*98113 (Donovan)*/, 92592 /*92592 (Stormwing Drake) - Permanent Feign Death*/, 115940 /*115940 (Goal Energy Field)*/, 92152 /*92152 (Whitewater Typhoon) - Whitewater Typhoon Cosmetic*/, 91083 /*91083 (The Blades of Vengeance)*/, 92632 /*92632 (Mind-Controlled Dreadwing) - Mind Control Helmet*/, 111172 /*111172 (Stormstruck Beaver)*/, 90948 /*90948 (7th Legion Dragoon)*/, 91084 /*91084 (Alliance Gyrocopter)*/, 91082 /*91082 (Dave Murphy)*/, 66460 /*66460 (Skyfire Gyrocopter Pilot) - Ride Vehicle Hardcoded*/, 90907 /*90907 (Vethir) - Static Maelstrom*/, 92557 /*92557 (Sky Admiral Rogers) - Ride Vehicle Hardcoded*/, 92547 /*92547 (Mind-Controlled Dreadwing) - Mind Control Helmet*/, 92475 /*92475 (Signal Boost Controller) - Distress Signal*/, 72587 /*72587 (VFX Bunny) - Distress Signal Visual*/, 92415 /*92415 (Storm Drake Whelp)*/, 92414 /*92414 (Knight-Captain Rhodes) - Static Field*/, 92670 /*92670 (7th Legion Dragoon) - Permanent Feign Death (Stun, Untrackable, Immune)*/, 90903 /*90903 (Adolescent Storm Drake) - Cosmetic - Sleep Zzz*/, 92556 /*92556 (Tinkmaster Overspark)*/, 95891 /*95891 (Genn Greymane) - Threat 5000%, Sleeping Sleep*/, 90749 /*90749 (Sky Admiral Rogers) - Invisibility and Stealth Detection*/, 98114 /*98114 (Donovan)*/, 95889 /*95889 (Commander Lorna Crowley)*/, 110521 /*110521 (Supplier Barleyfoot) - Backpack Visual*/, 90783 /*90783 (Mishka)*/, 90866 /*90866 (Tinkmaster Overspark)*/, 116514 /*116514 (Energy Wall)*/, 90785 /*90785 (Skyfire Marine)*/, 91069 /*91069 (Forsaken Dreadwing) - Permanent Feign Death (Stun, Untrackable, Immune)*/, 92407 /*92407 (Riding Bat)*/, 90902 /*90902 (Dread-Rider Malwick) - Ride Vehicle*/, 114717 /*114717 (Forsaken Bat-Rider)*/, 92224 /*92224 (Forsaken Deathstalker) - Pick Lock*/, 91085 /*91085 (Skyfire Marine) - Permanent Feign Death (Stun, Untrackable, Immune)*/, 92471 /*92471 (Skyfire Engineer) - Permanent Feign Death (Stun, Untrackable, Immune)*/, 116511 /*116511 (Launch Up Field)*/, 115938 /*115938 (Energy Field)*/, 110667 /*110667 (Adolescent Storm Drake)*/, 90899 /*90899 (Forsaken Bat-Rider)*/);
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(109942, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 109942 (Storm's Reach Greatstag)
(107463, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 107463 (Storm's Reach Worg)
(109967, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 109967 (Storm's Reach Warbear)
(107020, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 107020 (Storm's Reach Cliffwalker)
(106611, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 106611 (Vadrak)
(95926, 0, 0, 3, 1, 0, 0, 0, 0, ''), -- 95926 (Genn Greymane)
(95932, 0, 0, 0, 0, 0, 0, 0, 0, ''), -- 95932 (Commander Lorna Crowley)
(95804, 0, 0, 8, 0, 0, 0, 0, 0, ''), -- 95804 (Genn Greymane)
(95859, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 95859 (Greywatch Guard)
(95921, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 95921 (Commander Lorna Crowley)
(108663, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 108663 (Lochaber)
(107942, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 107942 (Herald of Odyn)
(109590, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 109590 (Greywatch Guard)
(109522, 0, 0, 0, 1, 0, 0, 0, 0, '145953'), -- 109522 (Bronzeleaf Cub) - Cosmetic - Sleep Zzz
(93988, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 93988 (Enthralled Remains)
(93987, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 93987 (Apothecary Curseheart)
(109521, 0, 0, 0, 1, 0, 0, 0, 0, '145953'), -- 109521 (Bronzeleaf Grizzly) - Cosmetic - Sleep Zzz
(94347, 0, 52730, 50331648, 1, 0, 0, 0, 0, '218878'), -- 94347 (Dread-Rider Cortis) - Plagued Ground
(94341, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 94341 (Credit  Bunny)
(94323, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 94323 (Nurse Dolores)
(94318, 0, 0, 0, 256, 0, 0, 0, 0, ''), -- 94318 (Genn Greymane)
(98109, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 98109 (Hankerin Ferinale)
(109570, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 109570 (Derek Testerman)
(98112, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 98112 (Steward Dayton)
(109567, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 109567 (Harrison McCabe)
(109525, 0, 0, 0, 256, 0, 0, 0, 0, '218099'), -- 109525 (Desmond) - Carry Hay
(105526, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 105526 (Helmouth Soulflayer)
(94346, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 94346 (Ensign Ward)
(109678, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 109678 (Greywatch Gryphon)
(91553, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 91553 (Commander Lorna Crowley)
(91519, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 91519 (Commander Lorna Crowley)
(91481, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 91481 (Commander Lorna Crowley)
(91222, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 91222 (Commander Lorna Crowley)
(98113, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 98113 (Donovan)
(92592, 0, 0, 262144, 1, 0, 0, 0, 0, '130966'), -- 92592 (Stormwing Drake) - Permanent Feign Death
(115940, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 115940 (Goal Energy Field)
(92152, 0, 0, 0, 1, 0, 0, 0, 0, '183247'), -- 92152 (Whitewater Typhoon) - Whitewater Typhoon Cosmetic
(91083, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 91083 (The Blades of Vengeance)
(92632, 0, 0, 50331648, 1, 0, 0, 0, 0, '183481'), -- 92632 (Mind-Controlled Dreadwing) - Mind Control Helmet
(111172, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 111172 (Stormstruck Beaver)
(90948, 0, 0, 8, 1, 0, 0, 0, 0, ''), -- 90948 (7th Legion Dragoon)
(91084, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 91084 (Alliance Gyrocopter)
(91082, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 91082 (Dave Murphy)
(66460, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 66460 (Skyfire Gyrocopter Pilot) - Ride Vehicle Hardcoded
(90907, 0, 0, 50331648, 1, 0, 0, 0, 0, '183423'), -- 90907 (Vethir) - Static Maelstrom
(92557, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 92557 (Sky Admiral Rogers) - Ride Vehicle Hardcoded
(92547, 0, 0, 0, 1, 0, 0, 0, 0, '183481'), -- 92547 (Mind-Controlled Dreadwing) - Mind Control Helmet
(92475, 0, 0, 50331648, 1, 0, 0, 0, 0, '183267'), -- 92475 (Signal Boost Controller) - Distress Signal
(72587, 0, 0, 50331648, 1, 0, 0, 0, 0, '183439'), -- 72587 (VFX Bunny) - Distress Signal Visual
(92415, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 92415 (Storm Drake Whelp)
(92414, 0, 0, 8, 1, 0, 0, 0, 0, '183749'), -- 92414 (Knight-Captain Rhodes) - Static Field
(92670, 0, 0, 262144, 1, 0, 0, 0, 0, '145363'), -- 92670 (7th Legion Dragoon) - Permanent Feign Death (Stun, Untrackable, Immune)
(90903, 0, 0, 0, 1, 0, 0, 0, 0, '145953'), -- 90903 (Adolescent Storm Drake) - Cosmetic - Sleep Zzz
(92556, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 92556 (Tinkmaster Overspark)
(95891, 0, 0, 0, 1, 0, 0, 0, 0, '222584 152209'), -- 95891 (Genn Greymane) - Threat 5000%, Sleeping Sleep
(90749, 0, 0, 0, 258, 0, 0, 0, 0, '18950'), -- 90749 (Sky Admiral Rogers) - Invisibility and Stealth Detection
(98114, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 98114 (Donovan)
(95889, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 95889 (Commander Lorna Crowley)
(110521, 0, 0, 0, 0, 0, 0, 0, 0, '219748'), -- 110521 (Supplier Barleyfoot) - Backpack Visual
(90783, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 90783 (Mishka)
(90866, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 90866 (Tinkmaster Overspark)
(116514, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 116514 (Energy Wall)
(90785, 0, 0, 0, 258, 0, 0, 0, 0, ''), -- 90785 (Skyfire Marine)
(91069, 0, 0, 50593792, 1, 0, 0, 0, 0, '145363'), -- 91069 (Forsaken Dreadwing) - Permanent Feign Death (Stun, Untrackable, Immune)
(92407, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 92407 (Riding Bat)
(90902, 0, 0, 0, 1, 0, 0, 0, 0, '52391'), -- 90902 (Dread-Rider Malwick) - Ride Vehicle
(114717, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 114717 (Forsaken Bat-Rider)
(92224, 0, 0, 0, 1, 0, 0, 0, 0, '183078'), -- 92224 (Forsaken Deathstalker) - Pick Lock
(91085, 0, 0, 262144, 1, 0, 0, 0, 0, '145363'), -- 91085 (Skyfire Marine) - Permanent Feign Death (Stun, Untrackable, Immune)
(92471, 0, 0, 262144, 1, 0, 0, 0, 0, '145363'), -- 92471 (Skyfire Engineer) - Permanent Feign Death (Stun, Untrackable, Immune)
(116511, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 116511 (Launch Up Field)
(115938, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 115938 (Energy Field)
(110667, 0, 0, 50331648, 1, 0, 0, 0, 0, ''), -- 110667 (Adolescent Storm Drake)
(90899, 0, 62247, 50331648, 1, 0, 0, 0, 0, ''); -- 90899 (Forsaken Bat-Rider)

UPDATE `creature_template_addon` SET `bytes1`=1 WHERE `entry`=106565; -- 106565 (Blackfeather Gatherer)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=91885; -- 91885 (Forsaken Crewman)
UPDATE `creature_template_addon` SET `bytes2`=520093697 WHERE `entry`=91468; -- 91468 (Spymaster Illandris)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=111206; -- 111206 (Saberfang Worg)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=107689; -- 107689 (Mook Laborer)
UPDATE `creature_template_addon` SET `bytes1`=262144, `bytes2`=1, `auras`='159474' WHERE `entry`=109452; -- 109452 (Dreadwake Deathguard)
UPDATE `creature_template_addon` SET `bytes1`=262144, `bytes2`=1, `auras`='159474' WHERE `entry`=93612; -- 93612 (Dreadwake Deathguard)
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=94856; -- 94856 (Priestess of Eyir)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=93584; -- 93584 (Tideskorn Shieldmaiden)
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32639; -- 32639 (Gnimo)
UPDATE `creature_template_addon` SET `auras`='61424' WHERE `entry`=32638; -- 32638 (Hakmud of Argus)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=97809; -- 97809 (Coastal Seagull)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=109639; -- 109639 (Dread-Rider Stalker)
UPDATE `creature_template_addon` SET `bytes1`=50331648, `auras`='' WHERE `entry`=95073; -- 95073 (Forsaken Dreadwing)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=109640; -- 109640 (Dread-Rider Plaguebringer)
UPDATE `creature_template_addon` SET `auras`='215919 204227' WHERE `entry`=109083; -- 109083 (Houndmaster Payne)
UPDATE `creature_template_addon` SET `auras`='177928' WHERE `entry`=94338; -- 94338 (Dread-Rider Stalker)
UPDATE `creature_template_addon` SET `auras`='218319' WHERE `entry`=97821; -- 97821 (Felskorn Oathbinder)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=97906; -- 97906 (Runebound Wretch)
UPDATE `creature_template_addon` SET `mount`=0 WHERE `entry`=92307; -- 92307 (God-King Skovald)
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=97851; -- 97851 (Felskorn Chosen)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=95620; -- 95620 (Servant of Skovald)
UPDATE `creature_template_addon` SET `auras`='218325' WHERE `entry`=97825; -- 97825 (Felskorn Cleaver)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=91657; -- 91657 (Bloodbeard)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=91384; -- 91384 (Helhound)
UPDATE `creature_template_addon` SET `aiAnimKit`=8096, `auras`='184856' WHERE `entry`=91818; -- 91818 (Unworthy Soul)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=93071; -- 93071 (Bonespeaker Mystic)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=108939; -- 108939 (Bonespeaker Cleaver)
UPDATE `creature_template_addon` SET `bytes1`=0, `bytes2`=1, `auras`='205155' WHERE `entry`=108940; -- 108940 (Ancient Boneservant)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='184840 191995 221829' WHERE `entry`=93094; -- 93094 (Restless Ancestor)
UPDATE `creature_template_addon` SET `bytes2`=0 WHERE `entry`=108030; -- 108030 (Blood-Crazed Swashbuckler)
UPDATE `creature_template_addon` SET `auras`='216329' WHERE `entry`=93070; -- 93070 (Bonespeaker Carver)
UPDATE `creature_template_addon` SET `bytes1`=33554432 WHERE `entry`=97890; -- 97890 (Dravax)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=112480; -- 112480 (Servant of Skovald)
UPDATE `creature_template_addon` SET `auras`='212427 221016' WHERE `entry`=93401; -- 93401 (Urgev the Flayer)
UPDATE `creature_template_addon` SET `auras`='218020' WHERE `entry`=108856; -- 108856 (Agitated Stonewarden)
UPDATE `creature_template_addon` SET `bytes2`=0, `auras`='123964' WHERE `entry`=93066; -- 93066 (Bonespeaker Runeaxe)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='214567 213961' WHERE `entry`=97091; -- 97091 (Duskpelt Snarler)
UPDATE `creature_template_addon` SET `bytes1`=1 WHERE `entry`=110534; -- 110534 (Provisioner Sheldon)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=91244; -- 91244 (Felskorn Trapper)
UPDATE `creature_template_addon` SET `bytes1`=262144, `auras`='159474' WHERE `entry`=91566; -- 91566 (Felskorn Executioner)
UPDATE `creature_template_addon` SET `bytes2`=1 WHERE `entry`=91205; -- 91205 (Drekirjar Galeborn)
UPDATE `creature_template_addon` SET `bytes1`=1 WHERE `entry`=108526; -- 108526 (Tideskorn Worker)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=91204; -- 91204 (Tideskorn Longaxe)
UPDATE `creature_template_addon` SET `auras`='183195' WHERE `entry`=91417; -- 91417 (Tideskorn Worker)
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=106648; -- 106648 (Stormwing Drake)
UPDATE `creature_template_addon` SET `bytes2`=2 WHERE `entry`=100446; -- 100446 (Tideskorn Huntress)
UPDATE `creature_template_addon` SET `auras`='145953' WHERE `entry`=107965; -- 107965 (Canyon Rockeater)
UPDATE `creature_template_addon` SET `aiAnimKit`=0 WHERE `entry`=96282; -- 96282 (Vault Guardian)
UPDATE `creature_template_addon` SET `auras`='187656' WHERE `entry`=108263; -- 108263 (Felskorn Warmonger)
UPDATE `creature_template_addon` SET `auras`='222022' WHERE `entry`=100838; -- 100838 (Thunderhorn)
UPDATE `creature_template_addon` SET `auras`='187656' WHERE `entry`=96135; -- 96135 (Felskorn Warmonger)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=90747; -- 90747 (Slash Gutspill)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='123169' WHERE `entry`=97828; -- 97828 (Silvertail Mountain Goat)
UPDATE `creature_template_addon` SET `auras`='8269' WHERE `entry`=96236; -- 96236 (Mightstone Savage)
UPDATE `creature_template_addon` SET `auras`='195512' WHERE `entry`=96129; -- 96129 (Felskorn Raider)
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=97305; -- 97305 (Huginn)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=108322; -- 108322 (Ferngrazer Stag)
UPDATE `creature_template_addon` SET `bytes1`=0 WHERE `entry`=108313; -- 108313 (Ferngrazer Doe)
UPDATE `creature_template_addon` SET `bytes1`=50331649 WHERE `entry`=97755; -- 97755 (Galecrested Eagle)
UPDATE `creature_template_addon` SET `bytes1`=50331648 WHERE `entry`=108927; -- 108927 (Gluttonous Raven)
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=111291; -- 111291 (Stonescar River-Thresher)
UPDATE `creature_template_addon` SET `bytes1`=0, `auras`='123978' WHERE `entry`=91824; -- 91824 (Bluffwalker Goat)


DELETE FROM `creature_equip_template` WHERE (`ID`=1 AND `CreatureID` IN (106611,95932,95804,95859,95921,108663,109590,94347,94318,109525,105526,91553,91519,91481,91222,90948,92557,92414,92670,92556,95891,90749,95889,110521,90783,90866,90785,90902,114717,92224,91085,92471,90899)) OR (`ID`=2 AND `CreatureID` IN (91481,90866));
INSERT INTO `creature_equip_template` (`CreatureID`, `ID`, `ItemID1`, `AppearanceModID1`, `ItemVisual1`, `ItemID2`, `AppearanceModID2`, `ItemVisual2`, `ItemID3`, `AppearanceModID3`, `ItemVisual3`) VALUES
(106611, 1, 40435, 0, 0, 0, 0, 0, 0, 0, 0), -- Vadrak
(95932, 1, 30147, 0, 0, 61512, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(95804, 1, 46737, 0, 0, 0, 0, 0, 0, 0, 0), -- Genn Greymane
(95859, 1, 65492, 0, 0, 111717, 0, 0, 0, 0, 0), -- Greywatch Guard
(95921, 1, 30147, 0, 0, 61512, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(108663, 1, 124524, 0, 0, 0, 0, 0, 0, 0, 0), -- Lochaber
(109590, 1, 65492, 0, 0, 111717, 0, 0, 110314, 0, 0), -- Greywatch Guard
(94347, 1, 108925, 0, 0, 0, 0, 0, 0, 0, 0), -- Dread-Rider Cortis
(94318, 1, 46737, 0, 0, 0, 0, 0, 0, 0, 0), -- Genn Greymane
(109525, 1, 3367, 0, 0, 0, 0, 0, 0, 0, 0), -- Desmond
(105526, 1, 34058, 0, 0, 0, 0, 0, 0, 0, 0), -- Helmouth Soulflayer
(91553, 1, 0, 0, 0, 0, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(91519, 1, 0, 0, 0, 0, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(91481, 2, 0, 0, 0, 0, 0, 0, 112340, 0, 0), -- Commander Lorna Crowley
(91481, 1, 0, 0, 0, 0, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(91222, 1, 0, 0, 0, 0, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(90866, 2, 56090, 0, 0, 0, 0, 0, 0, 0, 0), -- Tinkmaster Overspark
(90948, 1, 38211, 0, 0, 0, 0, 0, 47014, 0, 0), -- 7th Legion Dragoon
(92557, 1, 3364, 0, 0, 2526, 0, 0, 61576, 0, 0), -- Sky Admiral Rogers
(92414, 1, 38211, 0, 0, 0, 0, 0, 47014, 0, 0), -- Knight-Captain Rhodes
(92670, 1, 38211, 0, 0, 0, 0, 0, 47014, 0, 0), -- 7th Legion Dragoon
(92556, 1, 1903, 0, 0, 0, 0, 0, 0, 0, 0), -- Tinkmaster Overspark
(95891, 1, 46737, 0, 0, 0, 0, 0, 0, 0, 0), -- Genn Greymane
(90749, 1, 3364, 0, 0, 2526, 0, 0, 61576, 0, 0), -- Sky Admiral Rogers
(95889, 1, 0, 0, 0, 0, 0, 0, 110180, 0, 0), -- Commander Lorna Crowley
(110521, 1, 109593, 0, 0, 0, 0, 0, 0, 0, 0), -- Supplier Barleyfoot
(90783, 1, 0, 0, 0, 0, 0, 0, 49761, 0, 0), -- Mishka
(90866, 1, 1903, 0, 0, 0, 0, 0, 0, 0, 0), -- Tinkmaster Overspark
(90785, 1, 3364, 0, 0, 4067, 0, 0, 61576, 0, 0), -- Skyfire Marine
(90902, 1, 113362, 0, 0, 0, 0, 0, 0, 0, 0), -- Dread-Rider Malwick
(114717, 1, 52521, 0, 0, 34717, 0, 0, 0, 0, 0), -- Forsaken Bat-Rider
(92224, 1, 57020, 0, 0, 57020, 0, 0, 0, 0, 0), -- Forsaken Deathstalker
(91085, 1, 3364, 0, 0, 4067, 0, 0, 61576, 0, 0), -- Skyfire Marine
(92471, 1, 6219, 0, 0, 0, 0, 0, 0, 0, 0), -- Skyfire Engineer
(90899, 1, 52521, 0, 0, 34717, 0, 0, 0, 0, 0); -- Forsaken Bat-Rider

UPDATE `gossip_menu_option` SET `OptionText`='А что у вас есть?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='Зачем это вы переносите товары тауренов в свой дирижабль?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='А что у вас есть?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='Зачем это вы переносите товары тауренов в свой дирижабль?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='А что у вас есть?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='Зачем это вы переносите товары тауренов в свой дирижабль?', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19808 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Попытаться установить контакт со статуей.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18543 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Отнеси меня обратно к Вратам Доблести.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18852 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Ветир, доставь меня на вершину!', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18843 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Уничтожить темницу Ветира с помощью осколка тюремщика.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18828 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Мы победили твоего воина. Выпусти нас из Хельхейма! Освободи нас!', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18790 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='Мне здесь не место! Я хочу покинуть Хельхейм!', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18790 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Мне здесь не место! Я хочу покинуть Хельхейм!', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18790 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Позволь взглянуть на твои товары.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=20232 AND `OptionIndex`=1);
UPDATE `gossip_menu_option` SET `OptionText`='Я хочу остановиться здесь.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=20232 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Покажи мне свой товар.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=19781 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Я готов принять твой дар.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18741 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Отвези меня на вершину, Ветир.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18693 AND `OptionIndex`=0);
UPDATE `gossip_menu_option` SET `OptionText`='Я готов принять твой дар, Йотнар.', `OptionBroadcastTextId`=0, `VerifiedBuild`=23420 WHERE (`MenuId`=18672 AND `OptionIndex`=0);




UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2000, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=18432, `VehicleId`=4878 WHERE `entry`=109942; -- Storm's Reach Greatstag
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1711, `npcflag`=16777216, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048, `VehicleId`=4780 WHERE `entry`=107463; -- Storm's Reach Worg
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1711, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=18432, `VehicleId`=4879 WHERE `entry`=109967; -- Storm's Reach Warbear
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2000, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=18432, `VehicleId`=4771 WHERE `entry`=107020; -- Storm's Reach Cliffwalker
UPDATE `creature_template` SET `gossip_menu_id`=20092, `minlevel`=110, `maxlevel`=110, `npcflag`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=33556480 WHERE `entry`=106611; -- Vadrak
UPDATE `creature_template` SET `speed_walk`=0.5, `speed_run`=0.496031433343887329 WHERE `entry`=98417; -- Enamored Ravenbear
UPDATE `creature_template` SET `speed_walk`=0.5, `speed_run`=0.496031433343887329 WHERE `entry`=91468; -- Spymaster Illandris
UPDATE `creature_template` SET `gossip_menu_id`=19808 WHERE `entry`=107675; -- Rax Sixtrigger
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `npcflag`=2, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=95926; -- Genn Greymane
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=2164, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=95932; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=95804; -- Genn Greymane
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480 WHERE `entry`=95859; -- Greywatch Guard
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=2164, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=34816 WHERE `entry`=95921; -- Commander Lorna Crowley
UPDATE `creature_template` SET `unit_flags`=536904448, `unit_flags2`=2049, `dynamicflags`=32 WHERE `entry`=109452; -- Dreadwake Deathguard
UPDATE `creature_template` SET `unit_flags`=536904448, `unit_flags2`=2049, `dynamicflags`=32 WHERE `entry`=93612; -- Dreadwake Deathguard
UPDATE `creature_template` SET `speed_walk`=0.5, `speed_run`=0.5 WHERE `entry`=92764; -- Valkyra Aspirant
UPDATE `creature_template` SET `npcflag`=16777216 WHERE `entry`=94466; -- Shieldmaiden Armaments
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=954, `speed_run`=0.992062866687774658, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32832, `unit_flags2`=33556480 WHERE `entry`=108663; -- Lochaber
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `speed_walk`=4, `speed_run`=1.428571462631225585, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=33088, `unit_flags2`=67110912, `unit_flags3`=1, `HoverHeight`=4 WHERE `entry`=107942; -- Herald of Odyn
UPDATE `creature_template` SET `speed_walk`=1, `speed_run`=1.142857193946838378 WHERE `entry`=97944; -- Muorg
UPDATE `creature_template` SET `unit_flags`=67141632 WHERE `entry`=98955; -- Tideskorn Warbear
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=98953; -- Tideskorn Shieldmaiden
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32784, `unit_flags2`=2048 WHERE `entry`=109590; -- Greywatch Guard
UPDATE `creature_template` SET `faction`=190, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480 WHERE `entry`=109522; -- Bronzeleaf Cub
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=118, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=93988; -- Enthralled Remains
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=118, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=93987; -- Apothecary Curseheart
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1711, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=33556480 WHERE `entry`=109521; -- Bronzeleaf Grizzly
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=118, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048, `HoverHeight`=1.25 WHERE `entry`=94347; -- Dread-Rider Cortis
UPDATE `creature_template` SET `faction`=190, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=94341; -- Credit  Bunny
UPDATE `creature_template` SET `unit_flags`=32784 WHERE `entry`=109639; -- Dread-Rider Stalker
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=2164, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=94323; -- Nurse Dolores
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=94318; -- Genn Greymane
UPDATE `creature_template` SET `unit_flags`=67141632, `unit_flags2`=2048, `dynamicflags`=0 WHERE `entry`=95073; -- Forsaken Dreadwing
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=84, `npcflag`=4224, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=98109; -- Hankerin Ferinale
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=2164, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=109570; -- Derek Testerman
UPDATE `creature_template` SET `gossip_menu_id`=20269, `minlevel`=110, `maxlevel`=110, `faction`=2164, `npcflag`=66177, `BaseAttackTime`=1200, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=98112; -- Steward Dayton
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=534, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=109567; -- Harrison McCabe
UPDATE `creature_template` SET `minlevel`=108, `maxlevel`=108, `faction`=2164, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=109525; -- Desmond
UPDATE `creature_template` SET `unit_flags`=32784 WHERE `entry`=97821; -- Felskorn Oathbinder
UPDATE `creature_template` SET `unit_flags`=32784 WHERE `entry`=97906; -- Runebound Wretch
UPDATE `creature_template` SET `HoverHeight`=1 WHERE `entry`=92307; -- God-King Skovald
UPDATE `creature_template` SET `unit_flags2`=2099200 WHERE `entry`=97825; -- Felskorn Cleaver
UPDATE `creature_template` SET `unit_flags`=33040 WHERE `entry`=97665; -- Valkyra Guardian
UPDATE `creature_template` SET `npcflag`=16777216 WHERE `entry`=91974; -- Bones of the Defeated
UPDATE `creature_template` SET `npcflag`=16777216 WHERE `entry`=91818; -- Unworthy Soul
UPDATE `creature_template` SET `unit_flags`=32784 WHERE `entry`=105680; -- Bonespeaker Drudge
UPDATE `creature_template` SET `unit_flags`=32832 WHERE `entry`=108939; -- Bonespeaker Cleaver
UPDATE `creature_template` SET `unit_flags`=33587200 WHERE `entry`=93094; -- Restless Ancestor
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=108030; -- Blood-Crazed Swashbuckler
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2819, `speed_run`=1.071428537368774414, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=105526; -- Helmouth Soulflayer
UPDATE `creature_template` SET `gossip_menu_id`=18656, `minlevel`=107, `maxlevel`=107, `faction`=12, `npcflag`=3, `BaseAttackTime`=1000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=94346; -- Ensign Ward
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=109678; -- Greywatch Gryphon
UPDATE `creature_template` SET `unit_flags2`=34816 WHERE `entry`=110534; -- Provisioner Sheldon
UPDATE `creature_template` SET `unit_flags`=33040 WHERE `entry`=97143; -- Juvenile Thorignir
UPDATE `creature_template` SET `unit_flags`=537165888 WHERE `entry`=91759; -- Felskorn Subduer
UPDATE `creature_template` SET `unit_flags`=536904448, `unit_flags2`=2049, `dynamicflags`=32 WHERE `entry`=91566; -- Felskorn Executioner
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=1000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=91553; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=1000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=91519; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=1000, `RangeAttackTime`=2000, `unit_flags`=33280, `unit_flags2`=34816 WHERE `entry`=91481; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2165, `BaseAttackTime`=1000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=91222; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `npcflag`=8192, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=98113; -- Donovan
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=107965; -- Canyon Rockeater
UPDATE `creature_template` SET `minlevel`=107, `maxlevel`=107, `faction`=14, `speed_walk`=1.60000002384185791, `speed_run`=1.428571462631225585, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=537133824, `unit_flags2`=2049, `unit_flags3`=1, `dynamicflags`=32, `HoverHeight`=6.5 WHERE `entry`=92592; -- Stormwing Drake
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `speed_walk`=1.60000002384185791, `speed_run`=0.714285731315612792, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=64, `unit_flags2`=71321600, `unit_flags3`=1 WHERE `entry`=115940; -- Goal Energy Field
UPDATE `creature_template` SET `unit_flags`=32832 WHERE `entry`=93166; -- Tiptog the Lost
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=2048, `dynamicflags`=0 WHERE `entry`=97828; -- Silvertail Mountain Goat
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2296, `speed_walk`=1.555556058883666992, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=92152; -- Whitewater Typhoon
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106, `faction`=1732, `speed_run`=2.142857074737548828, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=768, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=91083; -- The Blades of Vengeance
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106, `faction`=1732, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=92632; -- Mind-Controlled Dreadwing
UPDATE `creature_template` SET `faction`=190, `npcflag`=1073741824, `speed_run`=0.857142865657806396, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=111172; -- Stormstruck Beaver
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1733, `npcflag`=16777216, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33280, `unit_flags3`=1, `dynamicflags`=128 WHERE `entry`=90948; -- 7th Legion Dragoon
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=84, `speed_run`=2.142857074737548828, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=256, `unit_flags2`=2048, `unit_flags3`=1, `VehicleId`=4106 WHERE `entry`=91084; -- Alliance Gyrocopter
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1733, `speed_run`=2.142857074737548828, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=91082; -- Dave Murphy
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=66460; -- Skyfire Gyrocopter Pilot
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=1.60000002384185791, `speed_run`=1.428571462631225585, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32784, `unit_flags2`=2048, `unit_flags3`=1, `HoverHeight`=7.5 WHERE `entry`=90907; -- Vethir
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=210, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33280, `unit_flags2`=2048 WHERE `entry`=92557; -- Sky Admiral Rogers
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1732, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048, `VehicleId`=4157 WHERE `entry`=92547; -- Mind-Controlled Dreadwing
UPDATE `creature_template` SET `minlevel`=85, `maxlevel`=85, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33555200, `unit_flags2`=2048 WHERE `entry`=92475; -- Signal Boost Controller
UPDATE `creature_template` SET `minlevel`=90, `maxlevel`=90, `speed_walk`=3.20000004768371582, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33587456, `unit_flags2`=2048 WHERE `entry`=72587; -- VFX Bunny
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=92415; -- Storm Drake Whelp
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2618, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33536, `unit_flags2`=34816, `unit_flags3`=1 WHERE `entry`=92414; -- Knight-Captain Rhodes
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1733, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=537166592, `unit_flags2`=1, `unit_flags3`=1, `dynamicflags`=32 WHERE `entry`=92670; -- 7th Legion Dragoon
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=1.60000002384185791, `speed_run`=1.428571462631225585, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048, `HoverHeight`=5 WHERE `entry`=90903; -- Adolescent Storm Drake
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=875, `npcflag`=2, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33600, `unit_flags2`=2048, `unit_flags3`=1 WHERE `entry`=92556; -- Tinkmaster Overspark
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106, `faction`=1819, `speed_run`=1, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2048, `unit_flags3`=128 WHERE `entry`=95891; -- Genn Greymane
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=210, `npcflag`=3, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=90749; -- Sky Admiral Rogers
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=2164, `npcflag`=8192, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags2`=2048 WHERE `entry`=98114; -- Donovan
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106, `faction`=2164, `npcflag`=65537, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=95889; -- Commander Lorna Crowley
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=534, `npcflag`=4224, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=110521; -- Supplier Barleyfoot
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1733, `npcflag`=67, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=90783; -- Mishka
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=875, `npcflag`=4226, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33600, `unit_flags2`=34816, `unit_flags3`=1 WHERE `entry`=90866; -- Tinkmaster Overspark
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `speed_walk`=1.60000002384185791, `speed_run`=0.714285731315612792, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=64, `unit_flags2`=71321600, `unit_flags3`=1 WHERE `entry`=116514; -- Energy Wall
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=210, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768 WHERE `entry`=90785; -- Skyfire Marine
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=118, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=537166592, `unit_flags2`=2049, `dynamicflags`=32 WHERE `entry`=91069; -- Forsaken Dreadwing
UPDATE `creature_template` SET `unit_flags`=32768 WHERE `entry`=111291; -- Stonescar River-Thresher
UPDATE `creature_template` SET `minlevel`=106, `maxlevel`=106, `faction`=68, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=33554432, `unit_flags2`=2048, `unit_flags3`=1, `VehicleId`=4148 WHERE `entry`=92407; -- Riding Bat
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=83, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=1073743872 WHERE `entry`=90902; -- Dread-Rider Malwick
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=83, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=114717; -- Forsaken Bat-Rider
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=83, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=4, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=92224; -- Forsaken Deathstalker
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=210, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=537166592, `unit_flags2`=1, `dynamicflags`=32 WHERE `entry`=91085; -- Skyfire Marine
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=1733, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=537166592, `unit_flags2`=2049, `dynamicflags`=32 WHERE `entry`=92471; -- Skyfire Engineer
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `speed_walk`=1.60000002384185791, `speed_run`=0.714285731315612792, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=64, `unit_flags2`=71321600, `unit_flags3`=1 WHERE `entry`=116511; -- Launch Up Field
UPDATE `creature_template` SET `minlevel`=112, `maxlevel`=112, `speed_walk`=1.60000002384185791, `speed_run`=0.714285731315612792, `BaseAttackTime`=1500, `RangeAttackTime`=2000, `unit_flags`=64, `unit_flags2`=71321600, `unit_flags3`=1 WHERE `entry`=115938; -- Energy Field
UPDATE `creature_template` SET `unit_flags`=32768, `unit_flags2`=2048, `dynamicflags`=0 WHERE `entry`=91824; -- Bluffwalker Goat
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=16, `speed_walk`=1.60000002384185791, `speed_run`=1.428571462631225585, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_class`=2, `unit_flags`=32768, `unit_flags2`=2099200, `HoverHeight`=5 WHERE `entry`=110667; -- Adolescent Storm Drake
UPDATE `creature_template` SET `minlevel`=110, `maxlevel`=110, `faction`=83, `speed_run`=1.385714292526245117, `BaseAttackTime`=2000, `RangeAttackTime`=2000, `unit_flags`=32768, `unit_flags2`=2048 WHERE `entry`=90899; -- Forsaken Bat-Rider

UPDATE `gameobject_template` SET `Data6`=30, `VerifiedBuild`=23420 WHERE `entry`=255344; -- Felslate Seam
