--
DELETE FROM `quest_offer_reward_locale` WHERE `ID` IN (24506,9705,8472,8468,8463,8895,9119,9352,8486,8482,8483) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`) VALUES
(24506, 'ruRU', 'Хорошо. $N, я знаю, кто ты. Ты идеально подойдешь для выполнения этого задания.$B$BНам представилась уникальная возможность проникнуть в Цитадель Ледяной Короны, но мы должны действовать быстро, пока Артас не догадался, что происходит.'),
(9705, 'ruRU', 'Во имя Солнечного Колодца! Это третий курьер, которого мы потеряли за последний месяц!$B$BЯ ценю твою отвагу – не каждый осмелится сунуться на Рассветную улицу. Стражам нужно лучше следить за этими злосчастными Презренными.'),
(8472, 'ruRU', 'Молодец, $n! Теперь, когда наши волшебные святилища не работают в полную силу, эти энергетические сердечники очень сильно поспособствуют решению наших проблем.'),
(8468, 'ruRU', 'Наконец-то этот негодяй, Таэлис, получил по заслугам! Молодец, $n. Теперь-то Презренные присмиреют хотя бы на время!'),
(8463, 'ruRU', 'Прекрасно, $n.'),
(8895, 'ruRU', 'Спасибо, $n. Я ждал этого письма.'),
(9119, 'ruRU', 'Оглядись вокруг. Нельзя сказать, что все в порядке!$B$BВ Западном святилище произошла серьезная авария. Нужно сделать все, чтобы ситуация не ухудшилась!'),
(9352, 'ruRU', 'Ночные эльфы? Здесь? Вот крысы!$b$bКак ты думаешь, имеют ли они отношение к аварии в моем святилище? Если у тебя есть какие-то сведения, лучше незамедлительно передать их капитану Печати Солнца!'),
(8486, 'ruRU', 'Спасибо, $n. Теперь, когда ситуация под контролем, можно отправить туда рабочих и все наладить. Надеюсь, там ничего серьезного...'),
(8482, 'ruRU', 'Все это было у ночного эльфа? Точно? Язык-то явно дворфийский…$b$bНасколько я понимаю из письма, тот, кто его написал, не сам устроил аварию, но был прислан сюда, чтобы понаблюдать за ее результатами. Тут сказано, что наши усилия опасны и безрассудны... но вот кто это был?$b$bНу разумеется! Тот посланец из Стальгорна! Не глупо ли было доверяться тому, кто принадлежит к Альянсу?'),
(8483, 'ruRU', 'Ага, дело сделано! Прекрасно.$B$BПредводителю следопытов уже обо всем сообщили – поверь мне, дворфы дорого заплатят за предательство.$B$BСегодня ты оказал большую услугу своему народу, $n.');

DELETE FROM `quest_request_items_locale` WHERE `ID` IN (9705,8472,8468,8463,8895,8482,8483) AND `locale`='ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`) VALUES
(9705, 'ruRU', 'Что тебе удалось найти, $n?'),
(8472, 'ruRU', 'Ну что, $n, удалось тебе собрать волшебные сердечники?'),
(8468, 'ruRU', 'Ты хочешь мне что-то показать?'),
(8463, 'ruRU', 'Ну что, удалось тебе отыскать похищенное?'),
(8895, 'ruRU', 'Да, $c?'),
(8482, 'ruRU', 'Ты мне что-то принес? Дай-ка взглянуть...'),
(8483, 'ruRU', 'Ну что, удалось тебе разобраться с этим прохвостом?');
