-- Untranslated name of the quest. / Непереведённое название квеста.
UPDATE `quest_template_locale` SET `VerifiedBuild`=0, `ObjectiveText1`='Убейте Морбента Скверна' WHERE  `ID`=55 AND `locale`='ruRU';

-- Correction of an incorrect phrase. / Исправление неверной фразы.
UPDATE `quest_request_items_locale` SET `VerifiedBuild`=0, `CompletionText`='Ну что, $N, тебе удалось обнаружить лагерь охотников?' WHERE  `ID`=201 AND `locale`='ruRU';

-- Russian text is missing. / Отсутствует русский текст.
DELETE FROM `quest_greeting_locale` WHERE `ID` = 186420 AND `Type` = 1 AND `locale` = 'ruRU';
INSERT INTO `quest_greeting_locale` (`ID`, `Type`, `locale`, `Greeting`) VALUES 
(186420, 1, 'ruRU', 'Эта коллекция свитков содержит различную логистическую и стратегическую информацию, а также закодированную корреспонденцию.');

-- Russian text is missing. / Отсутствует русский текст.
DELETE FROM `quest_greeting_locale` WHERE `ID` IN (2276,2700,1356,2910,2860,2817,2498,773,737,2921,2920,733) AND `Type` = 0 AND `locale` = 'ruRU';
INSERT INTO `quest_greeting_locale` (`ID`, `Type`, `locale`, `Greeting`) VALUES 
(2276, 0, 'ruRU', 'Когда мне впервые предложили должность мирового судьи Южнобережья, я был восхищен тем, что добился этого в столь раннем возрасте.$B$BНо теперь, когда я здесь, мне интересно, не лучше ли было бы перебирать бумаги в Штормграде.'),
(2700, 0, 'ruRU', 'Мы в Опорном пункте владеем одним из немногих оставшихся участков территории Стромгарда в Нагорье Арати. И мы теряем позиции ...$B$BЕсли Вам есть что сказать, надеюсь, что это что-то хорошее.'),
(1356, 0, 'ruRU', 'Я провожу очень важное геологическое исследование. Если твоё дело не столь же важное, в чем я не сомневаюсь, то не отвлекай меня.'),
(2910, 0, 'ruRU', 'Эти негодяи застали нас врасплох, напав ночью. Немногим удалось уцелеть в той заварушке...'),
(2860, 0, 'ruRU', 'Это была настоящая бойня, скажу я тебе, $C. Мы схватили всё, что не было прибито и бежали со всех ног. Из-за этого припасов у нас осталось с гулькин нос.'),
(2817, 0, 'ruRU', 'Да-а, тяжко здесь, в этих Бесплодных землях, $C. Очень тяжко!$B$BНужно быть сумасшедшим, что бы приехать сюда по доброй воле... прямо как я...'),
(2498, 0, 'ruRU', 'Что-что?!? Мы все зарабатываем... но не тем, что простаиваем без дела.'),
(773, 0, 'ruRU', '$C, да? Я Кразек, секретарь барона Ревилгаза. Я знаю все о том, что происходит в этих джунглях и за их пределами. Хочешь узнать текущую цену на нефть в Кабестане? Нет? Может, ищешь работу? Я могу помочь тебе в этом.'),
(737, 0, 'ruRU', 'Ну привет. Похоже, ты не против подзаработать монет, а? По глазам вижу, что хочешь. Я Могол Кебок, слежу за операциями в Азероте, и если хочешь разбогатеть, возможно, я смогу все организовать.'),
(2921, 0, 'ruRU', 'Как прекрасно с твоей стороны, $C.$B$BМеня зовут Лотвиль Вериатус, член-основатель Просвещенного собрания арканологии, алхимии и инженерных наук: мы стремимся объединить интеллектуальные науки Азерота в одну общеобразовательную школу.'),
(2920, 0, 'ruRU', 'Привет, $N.$B$BЛотвиль - не самый проницательный босс, который у меня был. Он действительно вовлечён в свою работу. Настолько, что иногда его слуги не едят, или им не платят.$B$B<Люсьен хмуро смотрит на Лотвиля.>$B$BНо это не значит, что вы должны страдать.'),
(733, 0, 'ruRU', 'Смотри под ноги, $Gпарень:подруга;. Быть может наши с тобой интересы не совпадают, но это не значит, что я не поставлю тебе свечку за упокой, если джунгли поглотят тебя!');
