-- Troll start area fix
DELETE FROM `gameobject_template_addon` WHERE `entry`=202444;
INSERT INTO `gameobject_template_addon` (`entry`, `faction`, `flags`) VALUES
(202444, 114, 32); -- 202444

SET NAMES 'latin1';
SET NAMES 'utf8';
DELETE FROM `quest_template_locale` WHERE (`ID`=25073 AND `locale`='ruRU') OR (`ID`=24814 AND `locale`='ruRU') OR (`ID`=8468 AND `locale`='ruRU') OR (`ID`=25170 AND `locale`='ruRU') OR (`ID`=25236 AND `locale`='ruRU') OR (`ID`=24812 AND `locale`='ruRU') OR (`ID`=24813 AND `locale`='ruRU') OR (`ID`=25035 AND `locale`='ruRU') OR (`ID`=24626 AND `locale`='ruRU') OR (`ID`=24974 AND `locale`='ruRU') OR (`ID`=14438 AND `locale`='ruRU') OR (`ID`=24625 AND `locale`='ruRU') OR (`ID`=24624 AND `locale`='ruRU') OR (`ID`=24623 AND `locale`='ruRU') OR (`ID`=25037 AND `locale`='ruRU') OR (`ID`=24759 AND `locale`='ruRU') OR (`ID`=24758 AND `locale`='ruRU');
INSERT INTO `quest_template_locale` (`ID`, `locale`, `LogTitle`, `LogDescription`, `QuestDescription`, `AreaDescription`, `PortraitGiverText`, `PortraitGiverName`, `PortraitTurnInText`, `PortraitTurnInName`, `QuestCompletionLog`, `VerifiedBuild`) VALUES
(25073, 'ruRU', 'Деревня Сен''джин', 'Поговорите с мастером Гадрином в деревне Сен''джин.', 'Ты совсем $gмолодой:молодая;, но справляешься отлично. Не сомневаюсь, что еще не раз услышу твое имя.$B$BА теперь ступай на северо-запад через лощину и доберись до деревни Сен''джин. Найди в ней мастера Гадрина – думаю, он поручит тебе парочку заданий, прежде чем отправить в дебри Дуротара.$B$BПомни, $n, мы не всегда согласны с юным Адским Криком, но им движут благородные мотивы, и всех нас объединяет Орда. Ступай и не посрами Черное Копье.', '', '', '', '', '', '', 26365),
(24814, 'ruRU', 'Древний враг', 'Поговорите с Вол''джином в гроте Злобной Чешуи и помогите ему убить морскую ведьму Зар''джиру.', 'На острове объявилась морская ведьма. Мы столько ждали шанса отомстить ей, и сейчас эта честь выпала тебе.$B$BОтправляйся на северо-восток и встреться с Вол''джином. Дай ему знать, когда будешь $gготов:готова; вступить в бой.', '', 'Морская Ведьма, убившая отца Вол''джина и прогнавшая троллей с родных островов, вернулась, и Вол''джин наконец может ей отомстить.', 'Зар''джира', '', '', '', 26365),
(8468, 'ruRU', 'Разыскивается: Таэлис Ненасытный', 'Принесите голову Таэлиса сержанту Ка''рену на площадь Соколиных Крыльев в лесах Вечной Песни.', 'Город Луносвет назначает награду за голову Таэлиса Ненасытного, известного главаря Презренных. Он разыскивается за то, что неоднократно совершал преступления против жителей города Луносвета, в том числе убил двух городских стражников.$b$bОтносительно награды осведомляться у сержанта Ка''рена.', '', '', '', '', '', '', 26365),
(25170, 'ruRU', 'Зачистка побережья', 'Добудьте 5 пригоршень слизи крабов.', 'Эй, $gприятель:подруга;! Бом''бей работает над новым настоем. Хочешь глотнуть? Только прежде собери кое-какие штучки для Бом''бея.$b$bПрежде всего, Бом''бею нужно немного слизи подводных крабов. Покажи-ка мне свои руки!$b$b<Бом''бей внимательно изучает ваши ладони.>$b$bБом''бей хочет, чтобы ты $gпринес:принесла; 5 пригоршень. Поторопись!', '', '', '', '', '', '', 26365),
(25236, 'ruRU', 'Подводное электричество', 'Обвяжите магической веревкой 8 утонувших рокочущих ящериц на Громовом хребте.', 'Нашей армии жизненно необходима вода, и нам повезло – разбушевавшиеся стихии после Катаклизма вдоволь обеспечили нас ею. Вода, заполнившая каньон на юго-западе, вполне сгодится.$b$bК сожалению, трупы рокочущих ящериц до сих плавают по поверхности воды, а их электрические разряды весьма опасны. У меня хватает рядовых, чтобы вытащить их из воды, но нужен кто-то достаточно ловкий для того, чтобы привязать к тушам веревку. Ну что, не о тебе ли я говорю?', '', '', '', '', '', '', 26365),
(24812, 'ruRU', 'Пощады не будет', 'Убейте 12 наг Злобной Чешуи.', 'Наги принесли много горя нашему народу. Они не заслуживают пощады.$B$BОтправляйся в пещеру и убей всех наг, которых встретишь. Чем меньше их останется, тем меньше вероятность их дальнейшего нападения. Не сомневаюсь, что ты не пропустишь ни одной.', '', '', '', '', '', '', 26365),
(24813, 'ruRU', 'Территориальный амулет', 'Разместите 8 территориальных амулетов на флагах Злобной Чешуи.', 'Это не просто контратака. Мы намерены уничтожить всех оставшихся наг и обезопасить себя от их возвращения.$B$BРазмести эти амулеты на каждом флаге Злобной Чешуи, которые найдешь в пещере. Это четко даст понять нагам, как мы относимся к их присутствию. Кроме того, магия, заключенная в амулетах, подорвет силы любого приблизившегося к ним представителя Злобной Чешуи. Пусть прочувствуют наше гостеприимство...', '', '', '', '', '', '', 26365),
(25035, 'ruRU', 'Прорыв обороны', 'Поговорите с Йорнуном, чтобы отправиться в грот Злобной Чешуи, а там найдите Моракки.', 'Вол''джин приказал начать крупномасштабную атаку на наг, оккупировавших наш северный остров. Многие уже вступили с ними в бой у моста, но несколько бойцов должны прорвать их оборону и пробраться вглубь острова.$B$BПоговори с Йорнуном, чтобы отправиться на остров, а там найди капитана дозора Моракки. Он расскажет, чем ты можешь помочь.', '', '', '', '', '', '', 26365),
(24626, 'ruRU', 'Молодой и горячий', 'Поймайте Стремительного Когтя и приведите его в стойла возле крепости Черного Копья.', 'Ты молодец, $n.$B$BМорайа давно просила привести ей новых ящеров, пора выполнить эту просьбу! Я уже направила других помощников на поиски ящеров, но есть один особенный зверь, которого я давно обещала Морайе.$B$BСтремительный Коготь – самый быстрый и храбрый из молодых ящеров, правда, немного непослушный. Сейчас он бродит по этому острову. Возьми лассо, поймай Стремительного Когтя и приведи в стойла на главный остров. Но знай: будет нелегко!', '', '', '', '', '', '', 26365),
(24974, 'ruRU', 'Невыносимое одиночество', 'Накиньте поводок на мурлока из племени Злобного Плавника, а затем приведите его Седрику Калстону в поместье Калстона.', 'Вот представь: работаешь ты усердно всю свою жизнь – и что потом? Умираешь от чумы, переходишь в ряды нежити, работаешь еще усердней. А потом что? Да, накопишь деньжат, купишь небольшой домик, познакомишься с парочкой надоедливых соседей... А счастье? Его-то впрок не напасешься.$b$bЯ чувствую себя одиноким стариком, $n. Мне нужен спутник. Вот, возьми этот поводок и приведи мне одного из мурлоков с Шепчущего берега на северо-западе. Запомни: пока мурлок полон сил, он не даст накинуть на себя поводок. Поэтому тебе придется сначала измотать его, а потом уже привести ко мне.', '', '', '', '', '', '', 26365),
(14438, 'ruRU', 'Недобрые соседи', 'Убейте 15 гноллов из стаи Бледногривов и возвращайтесь к Ахмо Громовому Рогу в деревню Кровавого Копыта.', '$n, нашей земле причиняют боль раздоры ее обитателей. Я надеюсь, что тебе не суждено увидеть столько войн, сколько выпало мне. И все же я вынужден просить тебя вступить в бой. Так ты поймешь, что малая угроза, если не искоренить ее, со временем разрастается.$B$BГноллы-бледногривы поселились на юге от нашей деревни и в пещере на западе. Они не обращают внимания на наши попытки договориться и без жалости убивают животных Мулгора.$B$BСловами их не остановить.', '', '', '', '', '', '', 26365),
(24625, 'ruRU', 'Спутник морской ведьмы', 'Убейте Наж''тесса и заберите его сферу.', 'Кажется, мне удалось понять, кто оскверняет наших детенышей. Это некий нага. Я видел, как он поднимал над малышами какую-то красную сферу, и они... начинали меняться.$B$BПолагаю, он уверен, что о его проделках никто не знает, поэтому ты сможешь застать его врасплох. Отправляйся в Падение Залазана на северо-запад отсюда, убей этого нагу и принеси мне его сферу.', '', 'Наж''тесс надеялся обратить союзников троллей против них, но просчитался.', 'Наж''тесс', '', '', '', 26365),
(24624, 'ruRU', 'Жест милосердия', 'Убейте 8 оскверненных кровопалых ящеров.', 'Тот, кто украл наших ящеров, осквернил их какой-то магией. И теперь нам ничего не остается, кроме как помочь им упокоиться с миром. Отправляйся в Падение Залазана, что к северо-западу отсюда, и доведи дело до конца.$B$BНадеюсь, тебе по плечу эта работа. Я бы точно не смог это сделать, если даже нет другого выхода.', '', '', '', '', '', '', 26365),
(24623, 'ruRU', 'Спасение детенышей', 'Спасите 12 потерянных кровопалых детенышей с помощью свистка Кровопалых.', 'У меня есть одно важное дело, $gприятель:подруга;.$B$BКто-то с соседнего острова ворует наших детенышей. Сначала я думала, что они сами убегают, но сейчас мы не досчитались более десятка.$B$BПожалуйста, отправляйся в Падение Залазана, что к северо-западу отсюда, и приведи детенышей назад. Бедные малыши...', '', '', '', '', '', '', 26365),
(25037, 'ruRU', 'Ловля крабов', 'Убейте карликовых приливных крабов и добудьте 5 порций свежего крабового мяса.', 'Похоже, на старости лет мой организм забастовал – кабанину уже не принимает. Видать, она только для молодых хороша.$B$BМы уже расставили в округе несколько ловушек для крабов, но мне просто не терпится – хочется уже сейчас насладиться свежим крабовым мясом. Может, выполнишь прихоть старика? Крабов полно по всему острову, но лучше всего ловить их на восточном побережье.', '', '', '', '', '', '', 26365),
(24759, 'ruRU', 'Азы мастерства: поражение цели', 'Уничтожьте 6 манекенов-тики.', 'Ну ладно, $gдружище:подруга;. Начнем с самого простого. Хочу убедиться, что ты владеешь азами тайных искусств.$B$BДавай-ка попробуем поразить эти манекены-тики. Не торопись. Делай, как получится. А я посмотрю, насколько ты умеешь творить заклинания.', '', '', '', '', '', '', 26365),
(24758, 'ruRU', 'Возрождение Черного Копья', 'Повстречайтесь с Некали на тренировочной площадке Черного Копья.', 'Племя Черного Копья стало жертвой обстоятельств. Мы попали в изгнание. Раз за разом мы были вынуждены покидать свои дома... Однако на сей раз мы не сбежим как трусы.$B$BВол''джин всегда мудро правил племенем и долгое время оберегал нас от невзгод. Сейчас же его мудрость подсказывает ему, что под началом Гарроша Адского Крика Орду ждет непонятное будущее.$B$BВ этот раз мы не сбежим. Мы будем сражаться за свой дом до конца.$B$BПора начать твое обучение, $n. Отправляйся на восток и поговори с Некали.', '', '', '', '', '', '', 26365);


SET NAMES 'latin1';
SET NAMES 'utf8';
DELETE FROM `quest_objectives_locale` WHERE (`ID`=265488 AND `locale`='ruRU') OR (`ID`=265482 AND `locale`='ruRU') OR (`ID`=265528 AND `locale`='ruRU') OR (`ID`=267327 AND `locale`='ruRU') OR (`ID`=266031 AND `locale`='ruRU') OR (`ID`=266030 AND `locale`='ruRU') OR (`ID`=267187 AND `locale`='ruRU') OR (`ID`=267186 AND `locale`='ruRU') OR (`ID`=264756 AND `locale`='ruRU') OR (`ID`=256278 AND `locale`='ruRU');
INSERT INTO `quest_objectives_locale` (`ID`, `locale`, `QuestId`, `StorageIndex`, `Description`, `VerifiedBuild`) VALUES
(265488, 'ruRU', 24814, 0, 'Поговорите с Вол''джином в гроте Злобной Чешуи', 26365),
(265482, 'ruRU', 25236, 0, 'Утонувших рокочущих ящериц вытащено', 26365),
(265528, 'ruRU', 24812, 0, 'Нага Злобной Чешуи уничтожена', 26365),
(267327, 'ruRU', 24813, 0, 'Территориальный амулет размещен', 26365),
(266031, 'ruRU', 24626, 1, 'Приведите Стремительного Когтя в стойла для ящеров', 26365),
(266030, 'ruRU', 24626, 0, 'Поймайте Стремительного Когтя', 26365),
(267187, 'ruRU', 24974, 1, 'Доставлено мурлоков из племени Злобного Плавника', 26365),
(267186, 'ruRU', 24974, 0, 'Поймано мурлоков из племени Злобного Плавника', 26365),
(264756, 'ruRU', 14438, 0, 'Гноллы из стаи Бледногривов', 26365),
(256278, 'ruRU', 24623, 0, 'Кровопалые детеныши спасены', 26365);


DELETE FROM `quest_offer_reward` WHERE `ID` IN (24814 /*24814*/, 24813 /*24813*/, 24812 /*24812*/, 25035 /*25035*/, 24626 /*24626*/, 24625 /*24625*/, 24624 /*24624*/, 24623 /*24623*/, 24622 /*24622*/, 25037 /*25037*/, 25064 /*25064*/, 24763 /*24763*/, 24762 /*24762*/, 24761 /*24761*/, 24759 /*24759*/, 24758 /*24758*/);
INSERT INTO `quest_offer_reward` (`ID`, `Emote1`, `Emote2`, `Emote3`, `Emote4`, `EmoteDelay1`, `EmoteDelay2`, `EmoteDelay3`, `EmoteDelay4`, `RewardText`, `VerifiedBuild`) VALUES
(24814, 1, 0, 0, 0, 0, 0, 0, 0, 'В момент смерти морской ведьмы высвободилось огромное количество энергии, и теперь с ее помощью я смогу увидеть отдаленные земли.$B$BЯ собираюсь связаться с Траллом и хочу, чтобы ты $gувидел это сам:увидела это сама;. Может, это откроет тебе глаза на многое.', 26365), -- 24814
(24813, 1, 0, 0, 0, 0, 0, 0, 0, 'Теперь они не посмеют вернуться.', 26365), -- 24813
(24812, 1, 0, 0, 0, 0, 0, 0, 0, 'Ты молодец, $gюный:юная:r; |3-6($r).', 26365), -- 24812
(25035, 1, 0, 0, 0, 0, 0, 0, 0, 'Здорово, что ты с нами, $gбратишка:сестренка;.$B$BВ такие минуты начинаешь гордиться, что служишь Вол''джину, и хочется шагнуть прямо навстречу опасности.', 26365), -- 25035
(24626, 0, 0, 0, 0, 0, 0, 0, 0, 'Стремительный Коготь! Киджара говорила, что с ним хлопот не оберешься. Но я не против трудностей – из ящеров с характером получаются самые преданные и храбрые спутники.$B$BСпасибо, $gдорогой:дорогуша;. Ты мне здорово $gпомог:помогла;.', 26365), -- 24626
(24625, 1, 273, 0, 0, 0, 60, 0, 0, 'Молодец, $n! Этот нага нам здорово помешал, но никто не может сдерживать нас вечно.$B$BХорошо, что ты с нами, $n. У тебя горячее сердце.', 26365), -- 24625
(24624, 1, 0, 0, 0, 0, 0, 0, 0, 'Спасибо, |3-6($c).$B$BИменно такие храбрецы, как ты, смогут возродить Черное Копье. Я надеюсь, наши ряды пополнятся теми, кто хотя бы вполовину силен, как ты.', 26365), -- 24624
(24623, 1, 0, 0, 0, 0, 0, 0, 0, 'Большое спасибо! Они бывают агрессивны, если их рассердить, но большую часть времени такие милые.', 26365), -- 24623
(24622, 3, 0, 0, 0, 0, 0, 0, 0, 'Я всегда рада новым лицам. Мы тут будто в изоляции, с тех пор как ушли из Оргриммара.', 26365), -- 24622
(25037, 0, 0, 0, 0, 0, 0, 0, 0, 'Ммм, как вкусно. Спасибо тебе за доброту. Ты $gзаслужил:заслужила; расположение духов.', 26365), -- 25037
(25064, 0, 0, 0, 0, 0, 0, 0, 0, 'Привет, $gдорогой:дорогуша;. Тебя прислал Вол''джин? Как мило с его стороны.$B$BДа, помощь мне нужна, и на месте тебе сидеть не придется.', 26365), -- 25064
(24763, 6, 0, 0, 0, 0, 0, 0, 0, 'Так ты и есть $gтот новенький:та новенькая;, о $gкотором:которой; все говорят? Добро пожаловать в Черное Копье.', 26365), -- 24763
(24762, 4, 0, 0, 0, 0, 0, 0, 0, 'А ты молодец. Когда-нибудь станешь очень $gсильным:сильной;.', 26365), -- 24762
(24761, 1, 0, 0, 0, 0, 0, 0, 0, 'Хорошие шкуры, $gмалыш:малышка;. Из них можно справить отличные плащи.', 26365), -- 24761
(24759, 1, 0, 0, 0, 0, 0, 0, 0, 'Неплохо, $gдружище:подруга;. У тебя прирожденные способности к магии. Прямо-таки настоящий талант.$B$BКонечно, тебе предстоит потрудиться, чтобы овладеть магией по-настоящему. Но я тебя научу.', 26365), -- 24759
(24758, 6, 5, 0, 0, 0, 60, 0, 0, 'Еще один новобранец?$B$BВид у тебя бывалый.И глаза мудрые. Может, ты и вправду $gнастоящий:настоящая:c; |3-6($c).$B$BНе будем терять время.', 26365); -- 24758


DELETE FROM `quest_poi` WHERE (`QuestID`=25073 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=25073 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24814 AND `BlobIndex`=1 AND `Idx1`=3) OR (`QuestID`=24814 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24814 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24814 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24812 AND `BlobIndex`=1 AND `Idx1`=3) OR (`QuestID`=24812 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24812 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24812 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24813 AND `BlobIndex`=1 AND `Idx1`=3) OR (`QuestID`=24813 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24813 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24813 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=25035 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24626 AND `BlobIndex`=0 AND `Idx1`=3) OR (`QuestID`=24626 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24626 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24626 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24625 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24625 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24625 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24624 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24624 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24624 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24623 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24623 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24623 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24622 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24622 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=25037 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=25037 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=25037 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=25064 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=25064 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24763 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24763 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24762 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24762 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24762 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24761 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24761 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24761 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24759 AND `BlobIndex`=0 AND `Idx1`=2) OR (`QuestID`=24759 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24759 AND `BlobIndex`=0 AND `Idx1`=0) OR (`QuestID`=24758 AND `BlobIndex`=0 AND `Idx1`=1) OR (`QuestID`=24758 AND `BlobIndex`=0 AND `Idx1`=0);
INSERT INTO `quest_poi` (`QuestID`, `BlobIndex`, `Idx1`, `ObjectiveIndex`, `QuestObjectiveID`, `QuestObjectID`, `MapID`, `WorldMapAreaId`, `Floor`, `Priority`, `Flags`, `WorldEffectID`, `PlayerConditionID`, `WoDUnk1`, `AlwaysAllowMergingBlobs`, `VerifiedBuild`) VALUES
(25073, 0, 1, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345193, 0, 26365), -- 25073
(25073, 0, 0, -1, 0, 0, 1, 4, 0, 0, 1, 0, 0, 0, 0, 26365), -- 25073
(24814, 1, 3, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 347686, 0, 26365), -- 24814
(24814, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 355501, 0, 26365), -- 24814
(24814, 0, 1, 1, 265489, 38306, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24814
(24814, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24814
(24812, 1, 3, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 347686, 0, 26365), -- 24812
(24812, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 355501, 0, 26365), -- 24812
(24812, 0, 1, 0, 265528, 38300, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24812
(24812, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24812
(24813, 1, 3, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 347686, 0, 26365), -- 24813
(24813, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 355501, 0, 26365), -- 24813
(24813, 0, 1, 0, 267327, 38560, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24813
(24813, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24813
(25035, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 347686, 0, 26365), -- 25035
(24626, 0, 3, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 342925, 0, 26365), -- 24626
(24626, 0, 2, 0, 266031, 38002, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24626
(24626, 0, 1, 0, 266030, 37989, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24626
(24626, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24626
(24625, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 342981, 0, 26365), -- 24625
(24625, 0, 1, 0, 266650, 50018, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24625
(24625, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24625
(24624, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 342981, 0, 26365), -- 24624
(24624, 0, 1, 0, 265678, 37961, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24624
(24624, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24624
(24623, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 342925, 0, 26365), -- 24623
(24623, 0, 1, 0, 256278, 39157, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24623
(24623, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24623
(24622, 0, 1, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 343106, 0, 26365), -- 24622
(24622, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24622
(25037, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 354840, 0, 26365), -- 25037
(25037, 0, 1, 0, 266815, 52080, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 25037
(25037, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 25037
(25064, 0, 1, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345193, 0, 26365), -- 25064
(25064, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 25064
(24763, 0, 1, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345553, 0, 26365), -- 24763
(24763, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24763
(24762, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345553, 0, 26365), -- 24762
(24762, 0, 1, 0, 267219, 39062, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24762
(24762, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24762
(24761, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345553, 0, 26365), -- 24761
(24761, 0, 1, 0, 265352, 50222, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24761
(24761, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24761
(24759, 0, 2, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 345553, 0, 26365), -- 24759
(24759, 0, 1, 0, 267033, 38038, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24759
(24759, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365), -- 24759
(24758, 0, 1, 32, 0, 0, 1, 891, 0, 0, 0, 0, 0, 342252, 0, 26365), -- 24758
(24758, 0, 0, -1, 0, 0, 1, 891, 0, 0, 0, 0, 0, 0, 0, 26365); -- 24758

DELETE FROM `quest_poi_points` WHERE (`QuestID`=25073 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=25073 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24814 AND `Idx1`=3 AND `Idx2`=0) OR (`QuestID`=24814 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24814 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24814 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24812 AND `Idx1`=3 AND `Idx2`=0) OR (`QuestID`=24812 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24812 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24812 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24813 AND `Idx1`=3 AND `Idx2`=0) OR (`QuestID`=24813 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24813 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24813 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=25035 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24626 AND `Idx1`=3 AND `Idx2`=0) OR (`QuestID`=24626 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24626 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24626 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24625 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24625 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24625 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24624 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24624 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24624 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24623 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24623 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24623 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24622 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24622 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=25037 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=25037 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=25037 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=25064 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=25064 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24763 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24763 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24762 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24762 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24762 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24761 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24761 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24761 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24759 AND `Idx1`=2 AND `Idx2`=0) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=11) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=10) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=9) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=8) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=7) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=6) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=5) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=4) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=3) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=2) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=1) OR (`QuestID`=24759 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24759 AND `Idx1`=0 AND `Idx2`=0) OR (`QuestID`=24758 AND `Idx1`=1 AND `Idx2`=0) OR (`QuestID`=24758 AND `Idx1`=0 AND `Idx2`=0);
INSERT INTO `quest_poi_points` (`QuestID`, `Idx1`, `Idx2`, `X`, `Y`, `VerifiedBuild`) VALUES
(25073, 1, 0, -1318, -5604, 26365), -- 25073
(25073, 0, 0, -826, -4921, 26365), -- 25073
(24814, 3, 0, -803, -5556, 26365), -- 24814
(24814, 2, 0, -1257, -5543, 26365), -- 24814
(24814, 1, 0, -710, -5583, 26365), -- 24814
(24814, 0, 0, -1318, -5604, 26365), -- 24814
(24812, 3, 0, -803, -5556, 26365), -- 24812
(24812, 2, 0, -1257, -5543, 26365), -- 24812
(24812, 1, 11, -847, -5674, 26365), -- 24812
(24812, 1, 10, -852, -5634, 26365), -- 24812
(24812, 1, 9, -837, -5580, 26365), -- 24812
(24812, 1, 8, -823, -5550, 26365), -- 24812
(24812, 1, 7, -798, -5510, 26365), -- 24812
(24812, 1, 6, -773, -5490, 26365), -- 24812
(24812, 1, 5, -718, -5495, 26365), -- 24812
(24812, 1, 4, -699, -5560, 26365), -- 24812
(24812, 1, 3, -699, -5604, 26365), -- 24812
(24812, 1, 2, -718, -5659, 26365), -- 24812
(24812, 1, 1, -773, -5698, 26365), -- 24812
(24812, 1, 0, -813, -5698, 26365), -- 24812
(24812, 0, 0, -803, -5556, 26365), -- 24812
(24813, 3, 0, -803, -5556, 26365), -- 24813
(24813, 2, 0, -1257, -5543, 26365), -- 24813
(24813, 1, 6, -734, -5652, 26365), -- 24813
(24813, 1, 5, -763, -5644, 26365), -- 24813
(24813, 1, 4, -772, -5618, 26365), -- 24813
(24813, 1, 3, -737, -5539, 26365), -- 24813
(24813, 1, 2, -683, -5484, 26365), -- 24813
(24813, 1, 1, -619, -5655, 26365), -- 24813
(24813, 1, 0, -693, -5656, 26365), -- 24813
(24813, 0, 0, -803, -5556, 26365), -- 24813
(25035, 0, 0, -803, -5556, 26365), -- 25035
(24626, 3, 0, -1560, -5305, 26365), -- 24626
(24626, 2, 0, -1280, -5456, 26365), -- 24626
(24626, 1, 11, -1603, -5381, 26365), -- 24626
(24626, 1, 10, -1633, -5343, 26365), -- 24626
(24626, 1, 9, -1633, -5308, 26365), -- 24626
(24626, 1, 8, -1623, -5263, 26365), -- 24626
(24626, 1, 7, -1561, -5219, 26365), -- 24626
(24626, 1, 6, -1524, -5221, 26365), -- 24626
(24626, 1, 5, -1491, -5259, 26365), -- 24626
(24626, 1, 4, -1479, -5301, 26365), -- 24626
(24626, 1, 3, -1491, -5331, 26365), -- 24626
(24626, 1, 2, -1504, -5351, 26365), -- 24626
(24626, 1, 1, -1531, -5373, 26365), -- 24626
(24626, 1, 0, -1561, -5386, 26365), -- 24626
(24626, 0, 0, -1292, -5518, 26365), -- 24626
(24625, 2, 0, -1549, -5318, 26365), -- 24625
(24625, 1, 0, -1356, -5156, 26365), -- 24625
(24625, 0, 0, -1549, -5318, 26365), -- 24625
(24624, 2, 0, -1549, -5318, 26365), -- 24624
(24624, 1, 7, -1406, -5220, 26365), -- 24624
(24624, 1, 6, -1424, -5209, 26365), -- 24624
(24624, 1, 5, -1421, -5158, 26365), -- 24624
(24624, 1, 4, -1387, -5069, 26365), -- 24624
(24624, 1, 3, -1276, -5120, 26365), -- 24624
(24624, 1, 2, -1282, -5177, 26365), -- 24624
(24624, 1, 1, -1340, -5221, 26365), -- 24624
(24624, 1, 0, -1355, -5222, 26365), -- 24624
(24624, 0, 0, -1549, -5318, 26365), -- 24624
(24623, 2, 0, -1560, -5305, 26365), -- 24623
(24623, 1, 11, -1408, -5194, 26365), -- 24623
(24623, 1, 10, -1408, -5159, 26365), -- 24623
(24623, 1, 9, -1398, -5133, 26365), -- 24623
(24623, 1, 8, -1388, -5113, 26365), -- 24623
(24623, 1, 7, -1373, -5093, 26365), -- 24623
(24623, 1, 6, -1308, -5108, 26365), -- 24623
(24623, 1, 5, -1278, -5133, 26365), -- 24623
(24623, 1, 4, -1283, -5169, 26365), -- 24623
(24623, 1, 3, -1303, -5194, 26365), -- 24623
(24623, 1, 2, -1323, -5214, 26365), -- 24623
(24623, 1, 1, -1348, -5229, 26365), -- 24623
(24623, 1, 0, -1388, -5229, 26365), -- 24623
(24623, 0, 0, -1560, -5305, 26365), -- 24623
(24622, 1, 0, -1292, -5518, 26365), -- 24622
(24622, 0, 0, -1560, -5305, 26365), -- 24622
(25037, 2, 0, -1282, -5585, 26365), -- 25037
(25037, 1, 11, -1313, -5778, 26365), -- 25037
(25037, 1, 10, -1353, -5738, 26365), -- 25037
(25037, 1, 9, -1363, -5674, 26365), -- 25037
(25037, 1, 8, -1278, -5644, 26365), -- 25037
(25037, 1, 7, -1080, -5624, 26365), -- 25037
(25037, 1, 6, -956, -5634, 26365), -- 25037
(25037, 1, 5, -927, -5689, 26365), -- 25037
(25037, 1, 4, -961, -5763, 26365), -- 25037
(25037, 1, 3, -1001, -5807, 26365), -- 25037
(25037, 1, 2, -1080, -5817, 26365), -- 25037
(25037, 1, 1, -1160, -5817, 26365), -- 25037
(25037, 1, 0, -1209, -5817, 26365), -- 25037
(25037, 0, 0, -1282, -5585, 26365), -- 25037
(25064, 1, 0, -1318, -5604, 26365), -- 25064
(25064, 0, 0, -1292, -5518, 26365), -- 25064
(24763, 1, 0, -1160, -5396, 26365), -- 24763
(24763, 0, 0, -1318, -5604, 26365), -- 24763
(24762, 2, 0, -1160, -5396, 26365), -- 24762
(24762, 1, 0, -1136, -5414, 26365), -- 24762
(24762, 0, 0, -1160, -5396, 26365), -- 24762
(24761, 2, 0, -1160, -5396, 26365), -- 24761
(24761, 1, 11, -1229, -5637, 26365), -- 24761
(24761, 1, 10, -1335, -5491, 26365), -- 24761
(24761, 1, 9, -1340, -5463, 26365), -- 24761
(24761, 1, 8, -1227, -5373, 26365), -- 24761
(24761, 1, 7, -1163, -5332, 26365), -- 24761
(24761, 1, 6, -1142, -5329, 26365), -- 24761
(24761, 1, 5, -1066, -5352, 26365), -- 24761
(24761, 1, 4, -1001, -5403, 26365), -- 24761
(24761, 1, 3, -991, -5501, 26365), -- 24761
(24761, 1, 2, -1038, -5627, 26365), -- 24761
(24761, 1, 1, -1049, -5637, 26365), -- 24761
(24761, 1, 0, -1208, -5638, 26365), -- 24761
(24761, 0, 0, -1160, -5396, 26365), -- 24761
(24759, 2, 0, -1160, -5396, 26365), -- 24759
(24759, 1, 11, -1168, -5586, 26365), -- 24759
(24759, 1, 10, -1193, -5525, 26365), -- 24759
(24759, 1, 9, -1200, -5407, 26365), -- 24759
(24759, 1, 8, -1177, -5388, 26365), -- 24759
(24759, 1, 7, -1150, -5384, 26365), -- 24759
(24759, 1, 6, -1109, -5397, 26365), -- 24759
(24759, 1, 5, -1101, -5446, 26365), -- 24759
(24759, 1, 4, -1095, -5510, 26365), -- 24759
(24759, 1, 3, -1102, -5565, 26365), -- 24759
(24759, 1, 2, -1120, -5590, 26365), -- 24759
(24759, 1, 1, -1125, -5593, 26365), -- 24759
(24759, 1, 0, -1155, -5595, 26365), -- 24759
(24759, 0, 0, -1160, -5396, 26365), -- 24759
(24758, 1, 0, -1168, -5265, 26365), -- 24758
(24758, 0, 0, -1160, -5396, 26365); -- 24758

DELETE FROM `quest_request_items` WHERE `ID` IN (24625 /*24625*/, 25037 /*25037*/, 24761 /*24761*/);
INSERT INTO `quest_request_items` (`ID`, `EmoteOnComplete`, `EmoteOnIncomplete`, `EmoteOnCompleteDelay`, `EmoteOnIncompleteDelay`, `CompletionText`, `VerifiedBuild`) VALUES
(24625, 1, 0, 0, 0, 'Мы уже давно воюем с нагами, и последние битвы прошли для нас не слишком удачно. Но теперь все будет по-другому. Времена изменились, в том числе благодаря тебе.', 26365), -- 24625
(25037, 0, 0, 0, 0, 'Крабовое мясо – один из лучших даров моря.', 26365), -- 25037
(24761, 0, 0, 0, 0, 'Конечно, это не самые страшные зверюги, но царапаются изрядно. Могут все ноги тебе изодрать, если их вовремя не унести. Ноги в смысле, не рысей.', 26365); -- 24761


SET @CGUID := 210115305;
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+848;
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+0, 38046, 1, 0, 0, 1, '0', 0, 0, 0, -1119.34, -5353.947, 14.4892, 2.702703, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+1, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1157.764, -5384.353, 12.02107, 4.991642, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+2, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1149.578, -5383.863, 12.04741, 4.974188, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+3, 38046, 1, 0, 0, 1, '0', 0, 0, 0, -1229.569, -5382.759, 14.79381, 3.304118, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+4, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1177.257, -5391.658, 12.01643, 5.811946, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+5, 38281, 1, 0, 0, 1, '0', 0, 0, 0, -1165.736, -5396.179, 12.20856, 2.767676, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38281 (Area: -1 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+6, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1255.646, -5354.785, 14.45636, 0.03490658, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1)
(@CGUID+7, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1198.804, -5399.399, 12.02187, 3.159046, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+8, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1179.658, -5394.167, 12.15416, 5.602507, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+9, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1260.349, -5334.772, 14.31971, 1.593492, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+10, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1243.278, -5339.544, 14.56386, 0.7050897, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+11, 42618, 1, 0, 0, 1, '0', 0, 0, 0, -1126.516, -5395.474, 12.29228, 5.916666, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 42618 (Area: -1 - Difficulty: 1)
(@CGUID+12, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1153.875, -5384.913, 12.02437, 4.886922, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+13, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1190.731, -5399.809, 12.24632, 0.03490658, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+14, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1248.118, -5353.89, 14.44471, 3.462001, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+15, 38046, 1, 0, 0, 1, '0', 0, 0, 0, -1228.104, -5366.554, 14.80172, 4.525331, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: -1 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+16, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1190.472, -5403.453, 12.28711, 6.248279, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+17, 38038, 1, 0, 0, 1, '0', 0, 0, 0, -1176.592, -5387.825, 12.01633, 6.126106, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: -1 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+18, 42619, 1, 0, 0, 1, '0', 0, 0, 0, -1117.335, -5386.096, 12.09528, 5.406205, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 42619 (Area: -1 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+19, 38268, 1, 0, 0, 1, '0', 0, 0, 0, -1151.08, -5387.208, 12.06027, 1.148701, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: -1 - Difficulty: 1)
(@CGUID+20, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1255.345, -5345.563, 14.37544, 1.623156, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1)
(@CGUID+21, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1257.448, -5343.198, 14.3528, 0.296706, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1)
(@CGUID+22, 37956, 1, 0, 0, 1, '0', 0, 0, 0, -1252.276, -5340.519, 14.38414, 3.316126, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: -1 - Difficulty: 1)
(@CGUID+23, 38242, 1, 0, 0, 1, '0', 0, 0, 0, -1160.215, -5396.146, 12.31492, 2.879793, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38242 (Area: -1 - Difficulty: 1)
(@CGUID+24, 38003, 1, 0, 0, 1, '0', 0, 0, 0, -1260.585, -5347.774, 14.37264, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: -1 - Difficulty: 1)
(@CGUID+25, 38268, 1, 6453, 4875, 1, '0', 0, 0, 0, -1203.054, -5402.86, 12.05284, 6.276793, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: 4875 - Difficulty: 1)
(@CGUID+26, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1199.387, -5402.884, 12.03514, 3.089233, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+27, 42619, 1, 6453, 4875, 1, '0', 0, 0, 0, -1168.906, -5409.338, 12.11283, 3.996804, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 42619 (Area: 4875 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+28, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1191.297, -5407.319, 12.21143, 0.03490658, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+29, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1179.892, -5414.592, 12.32645, 1.48353, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+30, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1199.55, -5407.049, 12.0346, 3.106686, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+31, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1184.099, -5415.049, 12.1052, 1.972222, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+32, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1176.101, -5415.385, 12.40913, 1.48353, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+33, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1172.819, -5416.874, 12.38187, 0.6806784, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+34, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1187.345, -5417.988, 12.01687, 2.460914, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+35, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1113.069, -5403.262, 12.25443, 2.86234, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+36, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1108.563, -5396.643, 12.18887, 2.443461, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+37, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1170.95, -5420.969, 12.13027, 0.4886922, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+38, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1112.08, -5399.13, 12.37492, 2.443461, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+39, 38142, 1, 6453, 4875, 1, '0', 0, 0, 0, -1135.868, -5414.137, 13.35231, 3.368485, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38142 (Area: 4875 - Difficulty: 1)
(@CGUID+40, 42619, 1, 6453, 4875, 1, '0', 0, 0, 0, -1124.403, -5407.335, 12.33622, 6.221843, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 42619 (Area: 4875 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+41, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1065.906, -5352.406, 14.49357, 5.778736, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+42, 38272, 1, 6453, 4875, 1, '0', 0, 0, 0, -1192.826, -5419.01, 12.04274, 5.602288, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38272 (Area: 4875 - Difficulty: 1)
(@CGUID+43, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1091.165, -5391.08, 12.25549, 0.3958483, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+44, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1112.446, -5408.069, 12.22019, 3.368485, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+45, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1170.852, -5428.747, 12.11718, 5.934119, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+46, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1170.01, -5424.944, 12.28207, 6.126106, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+47, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1189.977, -5421.318, 12.01536, 2.478368, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+48, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1177.972, -5434.778, 12.00315, 4.625123, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+49, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1066.757, -5364.833, 14.61551, 4.375815, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+50, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1185.106, -5433.503, 12.01071, 4.39823, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+51, 38268, 1, 6453, 4875, 1, '0', 0, 0, 0, -1167.5, -5430.209, 12.37618, 2.730254, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: 4875 - Difficulty: 1)
(@CGUID+52, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1181.267, -5434.518, 12.00762, 4.572762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+53, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1247.541, -5385.706, 14.70486, 5.520187, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+54, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1073.333, -5383.628, 14.80797, 3.001986, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+55, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1126.41, -5427.333, 12.33664, 3.455752, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+56, 39062, 1, 6453, 4875, 1, '0', 0, 0, 0, -1143.191, -5429.963, 13.97729, 1.850049, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39062 (Area: 4875 - Difficulty: 1)
(@CGUID+57, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1172.155, -5432.292, 12.14821, 6.021386, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+58, 38038, 1, 6453, 4875, 1, '0', 0, 0, 0, -1126, -5431.483, 12.38861, 3.333579, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4875 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+59, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1068.559, -5384.791, 14.80458, 6.044055, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+60, 38244, 1, 6453, 4865, 1, '0', 0, 0, 0, -1125.962, -5446.971, 12.05935, 0.2268928, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38244 (Area: 4865 - Difficulty: 1)
(@CGUID+61, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1141.224, -5444.458, 12.07089, 1.239184, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+62, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.915, -5453.575, 12.45334, 2.234021, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+63, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1114.198, -5440.549, 12.01999, 2.042035, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+64, 38037, 1, 6453, 4865, 1, '0', 0, 0, 0, -1171.352, -5440.788, 12.04206, 5.305801, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38037 (Area: 4865 - Difficulty: 1)
(@CGUID+65, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1243.21, -5439.299, 14.63198, 2.229145, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+66, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1194.635, -5452.088, 12.06008, 0.8552113, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+67, 38272, 1, 6453, 4865, 1, '0', 0, 0, 0, -1120.243, -5443.414, 12.05935, 6.048099, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38272 (Area: 4865 - Difficulty: 1)
(@CGUID+68, 63309, 1, 6453, 4865, 1, '0', 0, 0, 0, -1144.793, -5441.143, 12.06463, 3.116011, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 63309 (Area: 4865 - Difficulty: 1)
(@CGUID+69, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.677, -5444.268, 12.0185, 2.879793, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+70, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1137.12, -5445.976, 12.06518, 1.256637, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+71, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1129.903, -5449.406, 12.07813, 1.239184, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+72, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1118.137, -5448.491, 12.01883, 2.96706, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+73, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1173.915, -5456.274, 12.58632, 2.356194, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+74, 63310, 1, 6453, 4865, 1, '0', 0, 0, 0, -1149.391, -5441.252, 12.04295, 0.08601265, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 63310 (Area: 4865 - Difficulty: 1)
(@CGUID+75, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1106.34, -5438.924, 12.05946, 1.029744, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+76, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1133.326, -5447.807, 12.07358, 1.37881, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+77, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1167.203, -5451.172, 12.16175, 2.181662, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+78, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1189.983, -5456.563, 12.07844, 0.8203048, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+79, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1109.993, -5439.094, 12.02888, 2.024582, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+80, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1160.352, -5446.288, 12.29938, 2.042035, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+81, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1164.313, -5448.231, 12.06315, 2.076942, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+82, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1250.585, -5418.486, 15.25076, 4.060446, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+83, 38268, 1, 6453, 4865, 1, '0', 0, 0, 0, -1172.1, -5450.107, 12.32253, 5.041788, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: 4865 - Difficulty: 1)
(@CGUID+84, 38987, 1, 6453, 4865, 1, '0', 0, 0, 0, -1262.455, -5373.597, 14.859, 3.595378, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4865 - Difficulty: 1)
(@CGUID+85, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1103.194, -5441.813, 12.15313, 0.6981317, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+86, 38987, 1, 6453, 4865, 1, '0', 0, 0, 0, -1256.556, -5372.531, 14.59448, 4.29351, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4865 - Difficulty: 1)
(@CGUID+87, 38272, 1, 6453, 4865, 1, '0', 0, 0, 0, -1114.012, -5465.186, 12.30324, 4.002489, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38272 (Area: 4865 - Difficulty: 1)
(@CGUID+88, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.762, -5453.405, 12.02328, 4.118977, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+89, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1100.991, -5445.535, 12.2907, 0.1396263, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+90, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1112.602, -5456.059, 12.02122, 4.276057, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+91, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1189.333, -5483.382, 12.31785, 6.230825, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+92, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1177.446, -5481.938, 12.11769, 4.014257, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+93, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1229.052, -5457.606, 14.77234, 4.716082, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+94, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.396, -5467.96, 12.55976, 1.466077, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+95, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1111.918, -5468.842, 12.14022, 1.43117, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+96, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1075.441, -5410.995, 14.69544, 4.776266, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+97, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1082.078, -5351.021, 14.56988, 0.9220245, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+98, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1175.177, -5485.147, 12.09024, 3.909538, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+99, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1104.97, -5469.23, 12.60393, 1.919862, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+100, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1172.793, -5487.965, 12.06418, 3.822271, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+101, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.116, -5480.936, 12.05969, 4.956735, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+102, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1189.398, -5487.519, 12.38725, 0.01745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+103, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1111.111, -5480.953, 12.13269, 4.660029, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+104, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.403, -5491.177, 12.21353, 3.787364, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+105, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1189.682, -5491.375, 12.32583, 5.602507, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+106, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1193.391, -5494.689, 12.1732, 5.288348, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+107, 49837, 1, 6453, 4865, 1, '0', 0, 0, 0, -1237.406, -5467.379, 14.66593, 1.255482, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4865 - Difficulty: 1)
(@CGUID+108, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1167.825, -5493.575, 12.24527, 3.787364, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+109, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1123.953, -5490.403, 12.06275, 5.393067, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+110, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1126.962, -5493.193, 12.08131, 5.585053, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+111, 38280, 1, 6453, 4865, 1, '0', 0, 0, 0, -1184.668, -5501.611, 12.31737, 2.470769, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38280 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+112, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1213.542, -5321.632, 14.91903, 0.3973977, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+113, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1183.618, -5347.734, 14.73992, 2.348939, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+114, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1168.609, -5507.859, 12.16493, 3.961897, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+115, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.986, -5504.658, 12.06761, 3.944444, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+116, 38272, 1, 6453, 4865, 1, '0', 0, 0, 0, -1121.94, -5493.277, 12.06241, 2.18187, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38272 (Area: 4865 - Difficulty: 1)
(@CGUID+117, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1157.939, -5506.772, 12.17241, 5.637414, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+118, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1156.319, -5504.28, 12.0595, 5.532694, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+119, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1134.318, -5500.693, 12.03048, 5.375614, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+120, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1131.03, -5499.104, 12.0398, 5.340707, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+121, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1256.465, -5456.278, 14.63198, 2.462109, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+122, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1137.54, -5502.762, 12.02133, 5.427974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+123, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1141.398, -5504.366, 12.05677, 5.253441, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+124, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1270.563, -5429.144, 14.62363, 6.103456, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+125, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1166.054, -5510.125, 12.35837, 4.258604, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+126, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1162.661, -5510.938, 12.46286, 4.712389, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+127, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1159.734, -5509.658, 12.35508, 5.218534, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+128, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1176.101, -5415.385, 12.40913, 1.48353, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066)
(@CGUID+129, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1179.892, -5414.592, 12.32645, 1.48353, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064)
(@CGUID+130, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1142.816, -5359.601, 14.95699, 3.685964, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+131, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1070.38, -5384.043, 14.76812, 2.99551, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+132, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1157.385, -5349.302, 14.77263, 1.946287, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+133, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1063.817, -5431.2, 14.56358, 1.268893, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+134, 38247, 1, 6453, 4865, 1, '0', 0, 0, 0, -1128.116, -5510.068, 12.05989, 0.01745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38247 (Area: 4865 - Difficulty: 1)
(@CGUID+135, 38142, 1, 6453, 4865, 1, '0', 0, 0, 0, -1150.283, -5519.264, 12.03508, 4.729842, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38142 (Area: 4865 - Difficulty: 1)
(@CGUID+136, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1125.241, -5514.755, 12.15069, 1.675516, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+137, 38282, 1, 6453, 4865, 1, '0', 0, 0, 0, -1169.102, -5519.037, 12.32368, 1.241185, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38282 (Area: 4865 - Difficulty: 1)
(@CGUID+138, 38282, 1, 6453, 4865, 1, '0', 0, 0, 0, -1119.186, -5507.639, 12.04955, 4.782202, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38282 (Area: 4865 - Difficulty: 1)
(@CGUID+139, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1106.111, -5504.993, 12.08672, 3.089233, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+140, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1106.41, -5501.052, 12.25046, 3.263766, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+141, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1192.991, -5516.085, 12.06623, 6.161012, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+142, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1214.918, -5504.436, 12.64699, 4.931511, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+143, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1172.819, -5416.874, 12.38187, 0.6806784, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066)
(@CGUID+144, 38268, 1, 6453, 4865, 1, '0', 0, 0, 0, -1189.091, -5520.438, 12.06828, 3.121616, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: 4865 - Difficulty: 1)
(@CGUID+145, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1128.411, -5517.443, 12.3104, 3.089233, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+146, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1192.757, -5520.365, 12.06618, 0.1396263, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+147, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1121.486, -5515.037, 12.0637, 1.745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+148, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1117.516, -5514.972, 12.06176, 1.727876, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+149, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1128.101, -5521.003, 12.37637, 2.879793, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+150, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1192.733, -5524.655, 12.09347, 0.296706, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+151, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1238.177, -5495.861, 15.15128, 4.329625, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+152, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1103.307, -5510.588, 12.05305, 4.363323, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+153, 39062, 1, 6453, 4865, 1, '0', 0, 0, 0, -1159.28, -5530.028, 11.97957, 6.195919, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39062 (Area: 4865 - Difficulty: 1)
(@CGUID+154, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1141.691, -5328.507, 14.1646, 4.236687, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+155, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1130.684, -5334.337, 14.48796, 3.469986, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+156, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.95, -5420.969, 12.13027, 0.4886922, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065)
(@CGUID+157, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1256.564, -5390.149, 14.57986, 0.4037966, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+158, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.01, -5424.944, 12.28207, 6.126106, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064)
(@CGUID+159, 37956, 1, 6453, 4865, 1, '0', 0, 0, 0, -1262.574, -5353.914, 14.44471, 0.5929523, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+160, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1275.921, -5433.038, 14.74863, 5.052589, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+161, 38990, 1, 6453, 4865, 1, '0', 0, 0, 0, -1275.809, -5360.382, 14.97939, 0.3839724, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38990 (Area: 4865 - Difficulty: 1)
(@CGUID+162, 38987, 1, 6453, 4865, 1, '0', 0, 0, 0, -1290.557, -5444.476, 14.59452, 3.438299, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4865 - Difficulty: 1)
(@CGUID+163, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1291.429, -5423.715, 14.59043, 5.741917, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+164, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1254.04, -5487.575, 14.5922, 4.979826, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+165, 38987, 1, 6453, 4865, 1, '0', 0, 0, 0, -1295.807, -5439.903, 14.72451, 3.804818, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4865 - Difficulty: 1)
(@CGUID+166, 49837, 1, 6453, 4865, 1, '0', 0, 0, 0, -1275.821, -5477.789, 14.6312, 4.041047, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4865 - Difficulty: 1)
(@CGUID+167, 38988, 1, 6453, 4865, 1, '0', 0, 0, 0, -1315.33, -5436.459, 14.57339, 3.141593, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38988 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+168, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1296.25, -5372.097, 13.82675, 1.278003, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+169, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1239.359, -5527.638, 15.03998, 1.890694, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+170, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1270.385, -5392.106, 14.83107, 2.991485, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+171, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.852, -5428.747, 12.11718, 5.934119, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064)
(@CGUID+172, 37956, 1, 6453, 4865, 1, '0', 0, 0, 0, -1306.023, -5459.818, 14.82339, 0.2390466, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+173, 37956, 1, 6453, 4865, 1, '0', 0, 0, 0, -1318.753, -5443.608, 14.69839, 3.479389, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+174, 38003, 1, 6453, 4865, 1, '0', 0, 0, 0, -1310.832, -5451.655, 17.59769, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4865 - Difficulty: 1)
(@CGUID+175, 37956, 1, 6453, 4865, 1, '0', 0, 0, 0, -1318.735, -5452.118, 14.82339, 4.742326, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+176, 37956, 1, 6453, 4865, 1, '0', 0, 0, 0, -1271.837, -5344.059, 14.47338, 3.176499, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: 4865 - Difficulty: 1)
(@CGUID+177, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1312.516, -5492.936, 14.76505, 3.335257, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+178, 37956, 1, 6453, 4875, 1, '0', 0, 0, 0, -1285.416, -5347.916, 14.79738, 3.393527, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+179, 38003, 1, 6453, 4875, 1, '0', 0, 0, 0, -1331.26, -5394.59, 14.94037, 5.8294, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4875 - Difficulty: 1)
(@CGUID+180, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1308.65, -5492.178, 14.63941, 3.070505, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+181, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1339.905, -5463.318, 14.42044, 5.537595, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+182, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -1303.161, -5506.752, 14.84873, 2.408554, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+183, 39032, 1, 6453, 4875, 1, '0', 0, 0, 0, -1281.953, -5524.03, 24.25354, 4.590216, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39032 (Area: 4875 - Difficulty: 1)
(@CGUID+184, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -1319.191, -5509.28, 14.92528, 1.605703, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+185, 37960, 1, 6453, 4875, 1, '0', 0, 0, 0, -1291.153, -5523.003, 20.866, 5.689773, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+186, 38005, 1, 6453, 4875, 1, '0', 0, 0, 0, -1291.92, -5518.061, 20.85028, 4.764749, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38005 (Area: 4875 - Difficulty: 1)
(@CGUID+187, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1238.543, -5411.295, 14.64377, 1.900043, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+188, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1230.559, -5465.913, 14.71074, 0.5794491, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+189, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -1279.5, -5530.799, 20.92569, 4.572762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+190, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1375.819, -5449.181, -7.101926, 5.497787, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+191, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1375.737, -5419.412, -9.493299, 2.953401, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+192, 38442, 1, 6453, 4875, 1, '0', 0, 0, 0, -1294.183, -5533.259, 20.65336, 2.284277, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38442 (Area: 4875 - Difficulty: 1) (Auras: 65017 - 65017) (possible waypoints or random movement)
(@CGUID+193, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1368.261, -5482.5, 1.700689, 4.081731, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+194, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1306.903, -5490.188, 14.80908, 4.168121, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+195, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1380.959, -5490.448, 1.560816, 2.75311, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+196, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -1293.903, -5544.651, 21.25047, 5.340707, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+197, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1376.006, -5507.058, 1.849909, 5.49369, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+198, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1371.902, -5522.904, 1.698576, 1.804978, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+199, 39031, 1, 6453, 4875, 1, '0', 0, 0, 0, -1307.248, -5557.472, 21.10605, 0.1919862, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39031 (Area: 4875 - Difficulty: 1)
(@CGUID+200, 38989, 1, 6453, 4875, 1, '0', 0, 0, 0, -1330.821, -5558.847, 21.49031, 0.2443461, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38989 (Area: 4875 - Difficulty: 1) (Auras: 65017 - 65017)
(@CGUID+201, 90113, 1, 6453, 4875, 1, '0', 0, 0, 0, -1311.884, -5556.941, 21.10959, 2.502383, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 90113 (Area: 4875 - Difficulty: 1) (Auras: 133464 - 133464) (possible waypoints or random movement)
(@CGUID+202, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1411.832, -5470.427, -14.82825, 2.151536, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+203, 38987, 1, 6453, 4875, 1, '0', 0, 0, 0, -1328.398, -5561.901, 21.38232, 0.122173, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4875 - Difficulty: 1)
(@CGUID+204, 38987, 1, 6453, 4875, 1, '0', 0, 0, 0, -1342.42, -5557.662, 20.90166, 5.899213, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4875 - Difficulty: 1)
(@CGUID+205, 38987, 1, 6453, 4875, 1, '0', 0, 0, 0, -1337.813, -5564.8, 20.98915, 0.6108652, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4875 - Difficulty: 1)
(@CGUID+206, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1305.541, -5565.398, 21.4038, 1.345244, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+207, 38987, 1, 6453, 4875, 1, '0', 0, 0, 0, -1342.337, -5562.295, 20.66571, 0.3141593, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38987 (Area: 4875 - Difficulty: 1)
(@CGUID+208, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1274.254, -5454.997, 14.70965, 0.419563, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+209, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1274.845, -5480.894, 14.64047, 4.100594, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+210, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1291.667, -5393.323, 15.00213, 2.937284, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+211, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1345.717, -5507.689, 14.22618, 1.481459, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+212, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -1243.125, -5535.399, 16.17907, 0.2617994, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+213, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1222.715, -5537.104, 14.44232, 4.114499, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+214, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1221.253, -5355.025, 14.51146, 4.3504, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+215, 49743, 1, 6453, 4865, 1, '0', 0, 0, 0, -1148.503, -5348.576, 14.75505, 1.335575, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4865 - Difficulty: 1)
(@CGUID+216, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1162.892, -5332.143, 14.21123, 5.70346, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+217, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1124.558, -5357.243, 14.62189, 2.845284, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+218, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1146.581, -5291.012, 0.7742214, 0.3439526, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+219, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1080.344, -5353.479, 14.60457, 5.326878, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+220, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1104.085, -5338.449, 14.81145, 3.794075, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+221, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1050.981, -5360.811, 14.61857, 0.5408742, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+222, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1044.894, -5432.056, 14.56059, 0.2447581, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+223, 49743, 1, 6453, 4865, 1, '0', 0, 0, 0, -1043.05, -5376.049, 14.65691, 3.66773, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4865 - Difficulty: 1)
(@CGUID+224, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1035.987, -5398.086, 15.03191, 4.526108, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+225, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1157.385, -5349.302, 14.77263, 0.5330523, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+226, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1142.816, -5359.601, 14.95699, 2.058169, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+227, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1119.578, -5522.196, 12.48485, 5.270895, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+228, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1125.517, -5523.412, 12.36916, 4.660029, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+229, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1099.398, -5511.804, 12.09523, 4.799655, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+230, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1115.156, -5518.745, 12.17621, 0.06981317, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+231, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1095.2, -5509.688, 12.25532, 4.869469, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+232, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1190.813, -5527.519, 12.11499, 0.7504916, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+233, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1087.62, -5508.04, 13.47543, 3.926991, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+234, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1187.816, -5530.823, 12.0829, 0.6632251, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+235, 38278, 1, 6453, 4865, 1, '0', 0, 0, 0, -1126.472, -5531.056, 12.07891, 1.446512, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38278 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+236, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1071.033, -5495.038, 14.64655, 6.004552, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+237, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1183.98, -5532.85, 12.05713, 0.1047198, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+238, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1046.294, -5462.054, 14.82561, 1.678906, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+239, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1100.97, -5530.47, 12.08053, 3.246312, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+240, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.457, -5535.51, 12.10776, 3.333579, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+241, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1040.802, -5459.549, 14.72273, 0.4287273, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+242, 38245, 1, 6453, 4865, 1, '0', 0, 0, 0, -1118.16, -5539.962, 12.06216, 6.161012, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38245 (Area: 4865 - Difficulty: 1)
(@CGUID+243, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1070.38, -5384.043, 14.76812, 5.766841, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+244, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1183.618, -5347.734, 14.73992, 1.950962, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+245, 38142, 1, 6453, 4865, 1, '0', 0, 0, 0, -1135.868, -5414.137, 13.35231, 3.368485, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38142 (Area: 4865 - Difficulty: 1)
(@CGUID+246, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1248.405, -5510.822, 14.82762, 6.143011, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+247, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1169.28, -5559.757, 12.44541, 0.3141593, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+248, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1184.71, -5551.82, 12.05793, 0.7679449, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+249, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1139.97, -5548.53, 12.31343, 5.916666, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 47057 (Area: 4865 - Difficulty: 1)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+250, 38280, 1, 6453, 4865, 1, '0', 0, 0, 0, -1172.514, -5545.424, 12.11226, 4.508234, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38280 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+251, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1265.167, -5428.265, 14.63716, 0.4795343, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+252, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1174.076, -5552.971, 12.23881, 0.8552113, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+253, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1170.328, -5555.912, 12.39039, 0.6806784, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+254, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1178.193, -5552.516, 12.0707, 1.64061, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+255, 38243, 1, 6453, 4865, 1, '0', 0, 0, 0, -1175.476, -5540.337, 12.06118, 4.747295, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38243 (Area: 4865 - Difficulty: 1)
(@CGUID+256, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1167.618, -5586.122, 12.06097, 0.6457718, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+257, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1163.481, -5590.406, 12.03999, 0.9424778, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+258, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1171.24, -5567.89, 12.54073, 0.541052, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+259, 38217, 1, 6453, 4865, 1, '0', 0, 0, 0, -1239.809, -5553.768, 15.30029, 0.3490658, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4865 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+260, 38278, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.205, -5553.512, 12.0163, 0.007651743, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38278 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+261, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1141.88, -5591.99, 16.19553, 1.850049, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+262, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1123.24, -5548.84, 12.01643, 1.989675, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+263, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1228.842, -5601.295, 14.75081, 4.957202, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+264, 38278, 1, 6453, 4865, 1, '0', 0, 0, 0, -1114.84, -5543.894, 12.05392, 6.228894, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38278 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+265, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1154.644, -5594.887, 12.01891, 1.291544, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+266, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1159.299, -5593.063, 12.01962, 1.151917, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+267, 38279, 1, 6453, 4865, 1, '0', 0, 0, 0, -1155.472, -5576.599, 12.02552, 4.186777, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38279 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+268, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1228.915, -5587.067, 14.96631, 4.757769, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+269, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1171.05, -5577.53, 15.82533, 0.5759587, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+270, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.639, -5544.557, 12.24786, 3.071779, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+271, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1228.36, -5595.584, 15.05909, 1.454387, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+272, 38268, 1, 6453, 4865, 1, '0', 0, 0, 0, -1153.964, -5591.284, 12.05797, 4.525871, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38268 (Area: 4865 - Difficulty: 1)
(@CGUID+273, 38246, 1, 6453, 4865, 1, '0', 0, 0, 0, -1151.981, -5569.874, 12.01836, 4.310963, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38246 (Area: 4865 - Difficulty: 1)
(@CGUID+274, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.656, -5548.755, 12.07781, 3.054326, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+275, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.7, -5540.097, 12.29904, 3.141593, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+276, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1121.06, -5565.57, 15.79343, 3.246312, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+277, 38217, 1, 6453, 4865, 1, '0', 0, 0, 0, -1266.214, -5565.162, 21.09024, 2.513274, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4865 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+278, 38278, 1, 6453, 4865, 1, '0', 0, 0, 0, -1121.559, -5581.463, 12.01631, 5.489618, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38278 (Area: 4865 - Difficulty: 1) (Auras: 73299 - 73299)
(@CGUID+279, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1130.17, -5592.58, 12.01633, 2.111848, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+280, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.745, -5557.394, 12.0394, 3.193953, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+281, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.757, -5561.476, 12.06243, 3.071779, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+282, 49743, 1, 6453, 4865, 1, '0', 0, 0, 0, -1226.589, -5601.464, 14.73988, 4.471563, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4865 - Difficulty: 1)
(@CGUID+283, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.613, -5553.408, 12.06237, 3.089233, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+284, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1124.72, -5592.514, 12.01631, 2.146755, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+285, 39033, 1, 6453, 4865, 1, '0', 0, 0, 0, -1268.302, -5572.389, 20.93808, 3.071779, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39033 (Area: 4865 - Difficulty: 1)
(@CGUID+286, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1114.932, -5582.518, 12.01658, 2.670354, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71065 - 71065, 83470 - 83470)
(@CGUID+287, 49837, 1, 6453, 4865, 1, '0', 0, 0, 0, -1193.644, -5618.959, 14.98796, 1.577851, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4865 - Difficulty: 1)
(@CGUID+288, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1120.181, -5589.603, 12.0163, 2.234021, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+289, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.92, -5586.179, 12.01635, 2.513274, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+290, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1190.466, -5624.744, 14.86904, 3.493212, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+291, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.549, -5569.628, 12.01668, 3.106686, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71066 - 71066, 83470 - 83470)
(@CGUID+292, 38038, 1, 6453, 4865, 1, '0', 0, 0, 0, -1102.444, -5565.385, 12.05755, 3.159046, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38038 (Area: 4865 - Difficulty: 1) (Auras: 71064 - 71064, 83470 - 83470)
(@CGUID+293, 47057, 1, 6453, 4865, 1, '0', 0, 0, 0, -1106.15, -5579.15, 12.01633, 2.373648, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 47057 (Area: 4865 - Difficulty: 1)
(@CGUID+294, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1139.139, -5620.342, 14.71949, 3.268439, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+295, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1168.712, -5633.983, 14.70778, 2.194533, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+296, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1144.24, -5629.444, 15.06382, 1.060064, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+297, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1072.341, -5520.639, 14.57796, 5.011262, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+298, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1042.798, -5504.353, 15.10133, 3.27079, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+299, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1039.825, -5503.966, 15.00705, 4.424865, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+300, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1065.214, -5580.249, 15.26521, 1.801551, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+301, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1046.958, -5586.594, 14.89021, 4.919336, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+302, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1112.323, -5620.905, 14.52838, 5.599751, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+303, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1088.084, -5613.52, 14.56563, 3.811394, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+304, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1088.084, -5613.52, 14.56563, 1.080005, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+305, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1214.918, -5504.436, 12.64699, 0.1264781, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+306, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1045.993, -5528.292, 14.62425, 0.07001963, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+307, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1046.958, -5586.594, 14.89021, 0.5999445, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+308, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1119.332, -5634.429, 14.54654, 2.822571, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+309, 49837, 1, 6453, 4865, 1, '0', 0, 0, 0, -1076.222, -5620.102, 14.56563, 1.991985, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4865 - Difficulty: 1)
(@CGUID+310, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1048.438, -5609.896, 14.94995, 3.874283, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+311, 62114, 1, 6453, 4865, 1, '0', 0, 0, 0, -1038.369, -5479.17, 14.62791, 4.656246, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 62114 (Area: 4865 - Difficulty: 1)
(@CGUID+312, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1021.851, -5514.948, 15.56909, 6.24408, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+313, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1040.104, -5602.621, 15.5281, 3.326578, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+314, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1062.057, -5623.018, 14.77465, 5.288136, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+315, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1022.21, -5579.022, 14.63362, 6.062331, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+316, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1043.027, -5463.095, 14.57586, 1.734624, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+317, 49837, 1, 6453, 4865, 1, '0', 0, 0, 0, -1014.15, -5579.344, 14.65452, 1.43516, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4865 - Difficulty: 1)
(@CGUID+318, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1088.462, -5629.938, 14.48636, 1.547789, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+319, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1049.359, -5636.679, 14.51172, 2.319662, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+320, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1037.587, -5626.564, 14.44995, 2.671427, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+321, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1082.731, -5669.002, 0.1148442, 4.950113, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+322, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1196.903, -5636.431, 15.05866, 1.134677, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+323, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1208.451, -5637.844, 14.30119, 2.857943, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+324, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1210.991, -5637.104, 14.66663, 4.484262, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+325, 38046, 1, 6453, 4865, 1, '0', 0, 0, 0, -1228.799, -5636.559, 14.88167, 6.252622, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4865 - Difficulty: 1)
(@CGUID+326, 38217, 1, 6453, 4865, 1, '0', 0, 0, 0, -1258.684, -5606.967, 20.81991, 4.921828, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4865 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+327, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1268.944, -5596.313, 20.89992, 2.855987, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+328, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1269.76, -5612.517, 20.77654, 6.204273, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+329, 39008, 1, 6453, 4865, 1, '0', 0, 0, 0, -1279.181, -5583.563, 21.06847, 3.176499, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39008 (Area: 4865 - Difficulty: 1)
(@CGUID+330, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1216.087, -5692.233, 0.7086611, 3.525244, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+331, 39007, 1, 6453, 4865, 1, '0', 0, 0, 0, -1282.203, -5585, 21.07309, 0.8377581, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39007 (Area: 4865 - Difficulty: 1)
(@CGUID+332, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1198.269, -5726.4, -1.784289, 2.860352, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+333, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1242.68, -5703.582, -1.974909, 4.294165, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+334, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1186, -5705.5, 0.2201056, 4.796972, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+335, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1153.389, -5705.046, -1.005215, 2.144715, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+336, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1272.463, -5656.052, -0.1294664, 0.6258007, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+337, 38966, 1, 6453, 4865, 1, '0', 0, 0, 0, -1318.085, -5603.771, 23.80273, 0.8377581, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38966 (Area: 4865 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+338, 38440, 1, 6453, 4865, 1, '0', 0, 0, 0, -1313.46, -5609.679, 23.80273, 1.37881, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38440 (Area: 4865 - Difficulty: 1) (Auras: 65017 - 65017)
(@CGUID+339, 38003, 1, 6453, 4865, 1, '0', 0, 0, 0, -1322.481, -5608.927, 25.03553, 3.979351, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4865 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+340, 39027, 1, 6453, 4865, 1, '0', 0, 0, 0, -1321.681, -5589.463, 23.80273, 5.602507, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39027 (Area: 4865 - Difficulty: 1) (Auras: 65017 - 65017)
(@CGUID+341, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1300.824, -5690.483, -6.024343, 5.883105, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+342, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1322.985, -5654.819, -6.269741, 1.226133, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+343, 38217, 1, 6453, 4866, 1, '0', 0, 0, 0, -1299.207, -5576.774, 24.49938, 0.7330383, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4866 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+344, 38217, 1, 6453, 4866, 1, '0', 0, 0, 0, -1294.714, -5580.677, 24.49858, 1.099557, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4866 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+345, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1352.657, -5613.691, -7.393913, 3.396036, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+346, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1358.918, -5630.842, -10.38804, 1.703864, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+347, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1382.286, -5625.621, -13.9252, 4.739726, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+348, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1367.604, -5555.874, -6.844152, 3.035898, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+349, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1345.711, -5683.773, -8.931553, 0.7149754, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+350, 38938, 1, 6453, 4866, 1, '0', 0, 0, 0, -1321.641, -5610.247, 25.45405, 2.460914, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38938 (Area: 4866 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+351, 38953, 1, 6453, 4866, 1, '0', 0, 0, 0, -1323.865, -5608.563, 25.45229, 5.480334, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38953 (Area: 4866 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+352, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1228.856, -5605.446, 14.60987, 3.139049, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+353, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1251.833, -5649.724, -0.5268717, 4.065329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+354, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1262.524, -5689.587, -3.528787, 4.786703, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+355, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1228.692, -5543.425, 14.55556, 4.319752, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+356, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1244.561, -5509.362, 14.82762, 3.360668, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+357, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1189.359, -5621.306, 14.81315, 2.184426, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+358, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1274.845, -5480.894, 14.64047, 3.118009, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+359, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1345.138, -5480.966, 14.84087, 3.793245, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+360, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1403.302, -5542.919, -12.28885, 0.6844938, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+361, 38046, 1, 6453, 4866, 1, '0', 0, 0, 0, -1339.905, -5463.318, 14.46334, 4.532137, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+362, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1412.643, -5495.328, -11.93518, 1.34527, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+363, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1274.937, -5460.667, 14.74196, 3.005524, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+364, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1214.918, -5504.436, 12.64699, 3.45335, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+365, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1230.094, -5456.477, 14.67895, 1.765595, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+366, 38046, 1, 6453, 4866, 1, '0', 0, 0, 0, -1280.318, -5421.688, 14.93223, 2.004185, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+367, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1194.707, -5669.361, 3.001493, 0.3365826, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1) (Auras: )
(@CGUID+368, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1169.902, -5637.146, 14.8528, 3.387697, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+369, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1249.39, -5722.935, -9.39468, 0.2067227, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+370, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1147.065, -5674.374, 0.4866369, 0.2473553, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1) (Auras: )
(@CGUID+371, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1117.338, -5682.049, -0.5412211, 4.500189, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+372, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1156.288, -5735.07, -1.825701, 4.6509, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+373, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1187.661, -5623.715, 14.83455, 1.277129, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+374, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1201.84, -5757.62, -9.699818, 0.001895594, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+375, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1129.982, -5737.047, 1.106899, 3.352365, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+376, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1165.482, -5761.385, -10.81711, 3.125969, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+377, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1226.779, -5754.963, -10.87487, 1.991601, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+378, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1098.209, -5695.201, -0.4809282, 3.522099, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+379, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1084.324, -5696.459, -0.1877654, 2.600631, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+380, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1074.189, -5745.852, -18.02781, 3.875764, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+381, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1062.64, -5678.758, -0.1576817, 4.906586, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+382, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1100.428, -5778.084, -26.13908, 0.3594568, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+383, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1050.92, -5693.546, -2.024328, 2.840222, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+384, 38141, 1, 6453, 0, 1, '0', 0, 0, 0, -1075.441, -5639.443, 14.65536, 4.800885, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 0 - Difficulty: 1)
(@CGUID+385, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1048.791, -5764.003, -20.89352, 4.649989, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+386, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1047.12, -5785.241, -25.63639, 0.8036391, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+387, 38953, 1, 6453, 4865, 1, '0', 0, 0, 0, -1323.865, -5608.563, 25.45229, 5.480334, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38953 (Area: 4865 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+388, 38938, 1, 6453, 4865, 1, '0', 0, 0, 0, -1321.641, -5610.247, 25.45405, 2.460914, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38938 (Area: 4865 - Difficulty: 1) (Auras: 49414 - 49414)
-- (@CGUID+389, 89713, UNKNOWN, 6453, 4866, 1, '0', 0, 0, 0, 0, 0, 0, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 89713 (Area: 4866 - Difficulty: 1) (Auras: 46598 - 46598) - !!! on transport - transport template not found !!!
(@CGUID+390, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1281.205, -5483.82, 14.6312, 3.811995, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+391, 38046, 1, 6453, 4866, 1, '0', 0, 0, 0, -1312.841, -5495.558, 15.04517, 6.084681, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38046 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+392, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1275.877, -5427.857, 14.62363, 3.033677, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+393, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1280.211, -5391.889, 14.64628, 3.088792, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+394, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1298.124, -5367.091, 14.10117, 4.084591, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+395, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1306.615, -5414.406, 14.54327, 4.008509, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+396, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1345.717, -5507.689, 14.22618, 0.9127892, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+397, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1343.42, -5482.92, 14.89312, 2.490624, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+398, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1247.72, -5385.601, 14.70486, 5.522923, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+399, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1348.691, -5351.505, -9.584495, 2.295804, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+400, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1233.785, -5405.701, 14.76199, 3.342359, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+401, 38003, 1, 6453, 4875, 1, '0', 0, 0, 0, -1369.667, -5365.686, 11.6768, 5.8294, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4875 - Difficulty: 1)
(@CGUID+402, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1447.223, -5422.546, -16.72229, 2.277344, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+403, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1343.047, -5284.399, -11.52622, 5.389875, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+404, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -1446.883, -5385.47, -9.411041, 3.603492, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+405, 6145, 1, 6453, 4875, 1, '0', 0, 0, 0, -1380.478, -5283.322, -14.67393, 1.252293, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 6145 (Area: 4875 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+406, 38003, 1, 6453, 4875, 1, '0', 0, 0, 0, -1447.672, -5328.082, 3.221069, 5.8294, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4875 - Difficulty: 1)
(@CGUID+407, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1450.972, -5310.081, -8.271929, 2.209217, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+408, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1479.9, -5337.656, -2.823893, 0.8282489, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+409, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1486.233, -5286.38, 0.1850307, 0.2934029, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+410, 37956, 1, 6453, 0, 1, '0', 0, 0, 0, -1500.466, -5347.653, 2.515737, 6.124453, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+411, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1480.209, -5412.401, -12.44204, 5.501925, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+412, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1380.835, -5247.15, -3.372843, 0.5239946, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+413, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1502.909, -5390.057, -1.57795, 5.964274, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+414, 37956, 1, 6453, 0, 1, '0', 0, 0, 0, -1522.822, -5323.857, 6.865881, 5.007957, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+415, 37956, 1, 6453, 0, 1, '0', 0, 0, 0, -1503.47, -5273.608, 4.610752, 1.136311, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+416, 37960, 1, 6453, 0, 1, '0', 0, 0, 0, -1523.571, -5346.902, 6.43323, 0.7379519, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+417, 37960, 1, 6453, 0, 1, '0', 0, 0, 0, -1531.85, -5356.682, 5.993533, 3.008559, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+418, 37956, 1, 6453, 0, 1, '0', 0, 0, 0, -1529.688, -5299.479, 7.115881, 0.8230081, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+419, 37960, 1, 6453, 0, 1, '0', 0, 0, 0, -1536.265, -5332.37, 7.380192, 0.7540171, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+420, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1545.485, -5375.02, 2.450558, 2.810186, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+421, 37987, 1, 6453, 4863, 1, '0', 0, 0, 0, -1548.524, -5317.635, 7.892085, 0.9599311, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37987 (Area: 4863 - Difficulty: 1)
(@CGUID+422, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1553.155, -5277.382, 8.418818, 5.252305, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+423, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1546.764, -5316.643, 7.892857, 4.118977, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1)
(@CGUID+424, 38003, 1, 6453, 4863, 1, '0', 0, 0, 0, -1552.997, -5297.351, 9.1979, 5.8294, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4863 - Difficulty: 1)
(@CGUID+425, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1548.113, -5315.295, 8.029807, 4.572762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1)
(@CGUID+426, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1555.248, -5300.68, 9.086246, 5.382569, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+427, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1549.07, -5272.802, 7.853375, 0.03784141, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+428, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1552.084, -5285.416, 8.727655, 0.4145727, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+429, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1555.874, -5271.421, 7.860468, 1.540499, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+430, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1560.792, -5293.713, 8.910761, 5.946696, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+431, 37969, 1, 6453, 4863, 1, '0', 0, 0, 0, -1549.887, -5314.896, 8.062809, 5.487702, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37969 (Area: 4863 - Difficulty: 1)
(@CGUID+432, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1558.854, -5303.646, 9.037907, 2.334007, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+433, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1538.021, -5321.354, 7.537907, 2.622979, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+434, 37989, 1, 6453, 4863, 1, '0', 0, 0, 0, -1577.463, -5261.263, 6.836334, 5.828207, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37989 (Area: 4863 - Difficulty: 1) (Auras: 49414 - 49414) (possible waypoints or random movement)
(@CGUID+435, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1580.592, -5356.112, 6.029335, 4.824974, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+436, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1564.258, -5268.654, 7.528681, 2.346671, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+437, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1579.186, -5379.519, -0.1742306, 0.7743489, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+438, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1572.404, -5320.864, 8.387444, 0.4554567, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+439, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1558.258, -5257.036, 6.881473, 3.527384, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+440, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1594.079, -5356.165, 5.907997, 1.367808, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+441, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1581.214, -5319.496, 8.217357, 3.409378, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+442, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1571.684, -5335.087, 7.347938, 5.165127, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+443, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1578.532, -5242.965, 5.376619, 2.475705, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+444, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1604.166, -5357.291, 5.119565, 3.141593, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+445, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1607.993, -5271.09, 6.704187, 1.264134, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+446, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1619.741, -5311.419, 5.354253, 3.070715, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+447, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1575.521, -5235.938, 4.265291, 1.570796, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+448, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1618.887, -5287.786, 5.325442, 1.124771, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+449, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1627.017, -5343.022, 4.439877, 0.2140842, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+450, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1614.896, -5275.563, 6.054202, 0.4485828, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+451, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1557.13, -5223.761, 1.087919, 3.526998, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+452, 37960, 1, 6453, 4863, 1, '0', 0, 0, 0, -1629.688, -5283.854, 3.6543, 5.098329, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37960 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+453, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1623.357, -5373.115, 2.072236, 0.4182244, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+454, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1607.855, -5240.957, 5.396607, 1.831399, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+455, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1640.208, -5304.667, 2.344293, 3.829216, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+456, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1650.843, -5315.142, 0.1684523, 3.628078, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+457, 37956, 1, 6453, 4863, 1, '0', 0, 0, 0, -1624.886, -5244.683, 3.597779, 0.6021127, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37956 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+458, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1615.647, -5217.342, -0.3846905, 1.198995, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+459, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1480.306, -5217.934, -3.582994, 3.050936, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+460, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1426.806, -5205.821, 2.199878, 5.397081, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1)
(@CGUID+461, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1421.57, -5203.357, 3.107593, 0.2730541, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1)
(@CGUID+462, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1426.517, -5200.368, 2.144214, 5.136701, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1)
(@CGUID+463, 37961, 1, 6453, 4863, 1, '0', 0, 0, 0, -1406.652, -5223.293, 2.150806, 1.263251, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4863 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+464, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1542.628, -5171.406, -12.46284, 1.78549, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+465, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1444.897, -5172.525, -3.751854, 2.856313, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+466, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1405.293, -5188.72, 3.793046, 3.453079, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+467, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1407.375, -5182.696, 3.481158, 0.8012649, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+468, 49743, 1, 6453, 4863, 1, '0', 0, 0, 0, -1395.606, -5195.694, 3.870307, 2.532877, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4863 - Difficulty: 1)
(@CGUID+469, 37961, 1, 6453, 4863, 1, '0', 0, 0, 0, -1414.62, -5182.048, 3.293046, 0.6315036, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4863 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+470, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1383.077, -5216.544, 3.869164, 5.643385, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+471, 37961, 1, 6453, 4863, 1, '0', 0, 0, 0, -1395.457, -5195.566, 3.900825, 5.844751, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4863 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+472, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1389.322, -5197.836, 3.401557, 2.196855, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+473, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1401.425, -5182.814, 3.418046, 2.794042, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+474, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1381.005, -5214.339, 3.604515, 4.748248, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+475, 37961, 1, 6453, 4863, 1, '0', 0, 0, 0, -1424.023, -5157.972, 1.545044, 2.356929, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4863 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+476, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1389.087, -5193.892, 3.328071, 2.055613, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+477, 37961, 1, 6453, 4863, 1, '0', 0, 0, 0, -1369.424, -5216.136, 3.553001, 6.238187, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4863 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+478, 39157, 1, 6453, 4863, 1, '0', 0, 0, 0, -1411.979, -5158.854, 2.740357, 4.33344, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4863 - Difficulty: 1)
(@CGUID+479, 37961, 1, 6453, 0, 1, '0', 0, 0, 0, -1354.262, -5227.497, 1.74537, 1.676491, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 0 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+480, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1489.622, -5142.878, -12.38067, 1.715729, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+481, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1356.534, -5165.133, 13.36174, 0.5483071, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+482, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1356.072, -5220.002, 3.338464, 5.893942, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+483, 37961, 1, 6453, 0, 1, '0', 0, 0, 0, -1351.747, -5190.46, 1.872643, 2.661304, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 0 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+484, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1355.535, -5169.01, 12.8077, 1.171455, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (Auras: )
(@CGUID+485, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1359.41, -5219.504, 3.714684, 1.748526, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+486, 39004, 1, 6453, 0, 1, '0', 0, 0, 0, -1446.791, -5119.715, -4.061665, 2.356801, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 0 - Difficulty: 1)
(@CGUID+487, 37961, 1, 6453, 0, 1, '0', 0, 0, 0, -1404.892, -5145.759, 2.392421, 0.09688475, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 0 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+488, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1406.09, -5152.475, 2.490357, 5.873722, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+489, 39072, 1, 6453, 0, 1, '0', 0, 0, 0, -1356.114, -5155.841, 13.77587, 5.520133, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39072 (Area: 0 - Difficulty: 1)
(@CGUID+490, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1372.575, -5151.41, 13.63509, 2.999924, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+491, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1367.593, -5159.216, 13.63509, 0.2194837, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+492, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1351.834, -5178.338, 2.518394, 0.1724691, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+493, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1410.166, -5126.583, 0.9075918, 5.156574, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+494, 37961, 1, 6453, 0, 1, '0', 0, 0, 0, -1340.583, -5224.193, 2.05111, 4.666482, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 0 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+495, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1367.905, -5156.766, 13.63509, 3.919976, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (Auras: )
(@CGUID+496, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1354.97, -5215.999, 3.710046, 0.1451192, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+497, 39157, 1, 6453, 0, 1, '0', 0, 0, 0, -1368.446, -5143.521, 13.42024, 3.639451, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 0 - Difficulty: 1)
(@CGUID+498, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1349.443, -5148.642, 13.61516, 5.09258, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: )
(@CGUID+499, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1339.797, -5160.695, 12.39421, 4.498829, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 39157 (Area: 4864 - Difficulty: 1)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+500, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1392.035, -5108.587, 1.155447, 5.452784, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+501, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1347.893, -5144.131, 13.29973, 1.402518, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+502, 6145, 1, 6453, 4864, 1, '0', 0, 0, 0, -1515.488, -5150.741, -13.53276, 5.441166, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 6145 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+503, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1370.636, -5115.222, 2.15996, 5.256595, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+504, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1365.612, -5099.212, 1.974183, 0.1425216, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: 46598 - 46598)
(@CGUID+505, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1336.701, -5147.358, 7.956714, 4.723538, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+506, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1322.734, -5189.722, 1.397124, 0.6122128, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+507, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1347.966, -5126.408, 2.177574, 2.87641, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: 46598 - 46598)
(@CGUID+508, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1369.271, -5102.604, 1.887137, 3.734196, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: 46598 - 46598)
(@CGUID+509, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1390.629, -5090.826, 1.163597, 0.6211255, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+510, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1335.461, -5147.185, 7.70061, 5.038846, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+511, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1370.552, -5178.505, 5.998561, 2.548181, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+512, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1320.167, -5125.943, 1.687562, 4.645012, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+513, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1424.002, -5077.836, -4.773005, 1.731768, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+514, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1376.14, -5075.59, 1.559349, 2.910679, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: 46598 - 46598)
(@CGUID+515, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1388.029, -5070.393, 1.475609, 0.5958456, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+516, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1317.632, -5125.968, 1.809876, 2.576811, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+517, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1379.703, -5076.338, 1.94973, 6.030672, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (Auras: 46598 - 46598)
(@CGUID+518, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1318.75, -5185.416, 1.340465, 0.5834104, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+519, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1363.317, -5087.972, 1.067445, 2.817741, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+520, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1380.209, -5076.041, 1.914086, 5.937026, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+521, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1319.524, -5118.725, 2.212816, 6.251237, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+522, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1355.635, -5104.709, 1.677574, 5.344997, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+523, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1319.856, -5187.069, 1.340465, 5.340967, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+524, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1322.734, -5189.722, 1.397124, 3.345199, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+525, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1407.933, -5048.318, -4.698182, 1.356154, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+526, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1342.724, -5057.165, -2.392704, 1.717178, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+527, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1455.318, -5047.57, -9.982005, 1.493275, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+528, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1493.082, -5082.596, -13.29395, 2.898983, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+529, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1424.297, -5208.878, 2.92286, 5.287806, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+530, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1300.281, -5160.759, 1.268049, 3.260331, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+531, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1300.698, -5083.287, -2.808311, 3.849584, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+532, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1294.204, -5138.654, 1.726466, 4.007624, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773) (possible waypoints or random movement)
(@CGUID+533, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1292.641, -5112.535, 1.915517, 2.941488, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+534, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1299.026, -5155.146, 1.747218, 5.599998, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+535, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1300.482, -5157.849, 1.388654, 3.0464, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+536, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1341.325, -5128.182, 2.345713, 3.490659, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+537, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1414.918, -5017.056, -11.5072, 0.730053, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+538, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1426.517, -5200.368, 2.174736, 5.344242, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+539, 6145, 1, 6453, 4864, 1, '0', 0, 0, 0, -1360.865, -5012.512, -9.191876, 2.810188, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 6145 (Area: 4864 - Difficulty: 1)
(@CGUID+540, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1384.636, -4985.566, -13.07281, 5.202801, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+541, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1408.422, -5153.087, 2.550796, 5.981864, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+542, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1293.676, -5027.593, -13.46056, 1.026181, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+543, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1280.226, -5115.697, 1.448675, 4.878704, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+544, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1291.235, -5155.954, 1.427394, 3.729041, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+545, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1315.776, -5178.319, 1.340722, 3.490659, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+546, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1410.918, -5156.668, 2.682007, 2.629943, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+547, 39072, 1, 6453, 4864, 1, '0', 0, 0, 0, -1355.684, -5155.641, 13.66326, 3.075401, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39072 (Area: 4864 - Difficulty: 1) (Auras: )
(@CGUID+548, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1257.827, -5148.763, -2.483113, 3.117387, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+549, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1257.607, -5106.245, -2.69586, 5.177782, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+550, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1287.211, -5203.385, -3.085027, 1.397936, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+551, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1274.658, -5178.252, 0.51475, 5.542592, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+552, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1247.968, -5177.145, -0.9942122, 5.772291, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+553, 3107, 1, 6453, 4864, 1, '0', 0, 0, 0, -1213.561, -5138.496, -7.415482, 4.673347, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4864 - Difficulty: 1)
(@CGUID+554, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1253.318, -5048.597, -9.368623, 3.153843, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+555, 3107, 1, 6453, 4864, 1, '0', 0, 0, 0, -1219.503, -5087.236, -6.062696, 6.255846, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4864 - Difficulty: 1)
(@CGUID+556, 39004, 1, 6453, 4864, 1, '0', 0, 0, 0, -1321.287, -5249.226, -9.473266, 4.113017, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4864 - Difficulty: 1)
(@CGUID+557, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1420.313, -5203.646, 3.258472, 3.628288, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+558, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1410.003, -5126.278, 0.8712149, 4.259536, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+559, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1426.026, -5203.099, 2.202808, 4.735369, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+560, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1379.754, -5074.431, 1.786764, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+561, 37961, 1, 6453, 4864, 1, '0', 0, 0, 0, -1395.589, -5126.266, 1.840328, 0.07222033, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 37961 (Area: 4864 - Difficulty: 1) (Auras: 79773 - 79773)
(@CGUID+562, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1366.41, -5099.724, 1.991145, 1.063252, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+563, 39157, 1, 6453, 4864, 1, '0', 0, 0, 0, -1348.865, -5126.682, 2.224503, 2.430149, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39157 (Area: 4864 - Difficulty: 1)
(@CGUID+564, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1645.781, -5249.485, 0.3019061, 2.06746, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+565, 39004, 1, 6453, 4863, 1, '0', 0, 0, 0, -1597.776, -5170.764, -12.4486, 0.2871537, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4863 - Difficulty: 1)
(@CGUID+566, 38141, 1, 6453, 0, 1, '0', 0, 0, 0, -1299.22, -5372.514, 13.85716, 3.280958, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 0 - Difficulty: 1)
(@CGUID+567, 38141, 1, 6453, 0, 1, '0', 0, 0, 0, -1308.72, -5416.49, 14.59238, 3.921967, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 0 - Difficulty: 1)
(@CGUID+568, 38046, 1, 6453, 0, 1, '0', 0, 0, 0, -1291.429, -5423.715, 14.59043, 2.745767, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 0 - Difficulty: 1)
(@CGUID+569, 38141, 1, 6453, 0, 1, '0', 0, 0, 0, -1270.514, -5429.578, 14.62363, 3.189362, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 0 - Difficulty: 1)
(@CGUID+570, 38046, 1, 6453, 0, 1, '0', 0, 0, 0, -1260.611, -5410.262, 14.96462, 4.238631, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 0 - Difficulty: 1)
(@CGUID+571, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1273.372, -5457.811, 14.88159, 5.016084, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+572, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1248.192, -5381.103, 14.57986, 1.04478, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+573, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1254.148, -5423.153, 14.91409, 3.515666, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+574, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1236.199, -5409.488, 14.64432, 0.6566714, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+575, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1256.465, -5456.278, 14.68336, 3.232033, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+576, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1309.433, -5491.714, 14.86913, 3.684286, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+577, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1254.04, -5487.575, 14.5922, 6.043826, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+578, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1318.168, -5527.401, 20.77204, 5.410521, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+579, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1228.118, -5464.248, 14.67895, 5.256409, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+580, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1321.035, -5530.469, 20.8207, 5.427974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+581, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1246.613, -5500.54, 14.7365, 1.699938, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+582, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1228.118, -5464.248, 14.67895, 0.5985954, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+583, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1274.845, -5480.894, 14.64047, 2.996704, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+584, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1342.302, -5538.684, 20.81846, 5.358161, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+585, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1337.073, -5538.205, 20.82421, 5.410521, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+586, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1324.198, -5533.587, 20.85115, 5.427974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+587, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1327.352, -5536.042, 21.06844, 5.51524, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+588, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1331.458, -5537.667, 21.02953, 5.427974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+589, 39027, 1, 6453, 4875, 1, '0', 0, 0, 0, -1332.422, -5544.947, 21.05047, 0.3770363, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39027 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+590, 38440, 1, 6453, 4875, 1, '0', 0, 0, 0, -1329.891, -5556.582, 21.55126, 4.276057, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38440 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+591, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1271.615, -5545.944, 21.07296, 0.296706, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+592, 38931, 1, 6453, 4875, 1, '0', 0, 0, 0, -1327.415, -5557.939, 21.5484, 2.183068, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38931 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+593, 38989, 1, 6453, 4875, 1, '0', 0, 0, 0, -1330.837, -5558.896, 21.48784, 0.7845301, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38989 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+594, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1267.925, -5552.052, 21.01184, 0.296706, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+595, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1268.313, -5547.897, 20.94538, 0.2792527, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+596, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1273.116, -5553.075, 21.0282, 0.1570796, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+597, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1294.651, -5565.743, 21.22984, 0.7330383, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+598, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1273.22, -5549.733, 21.00912, 0.2268928, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+599, 39028, 1, 6453, 4875, 1, '0', 0, 0, 0, -1270.184, -5556.087, 21.14443, 0.2268928, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39028 (Area: 4875 - Difficulty: 1) (Auras: 60921 - 60921)
(@CGUID+600, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1231.325, -5537.579, 14.64963, 5.900866, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+601, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1212.283, -5503.584, 12.20095, 0.3126051, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
-- (@CGUID+602, 89713, UNKNOWN, 6453, 4866, 1, '0', 0, 0, 0, 0, 0, 0, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 89713 (Area: 4866 - Difficulty: 1) (Auras: 46598 - 46598) - !!! on transport - transport template not found !!!
(@CGUID+603, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1211.291, -5643.846, 14.69743, 4.149017, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+604, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1169.84, -5637.102, 14.84743, 3.378547, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+605, 39004, 1, 6453, 4866, 1, '0', 0, 0, 0, -1192.603, -5676.321, 1.631456, 3.726873, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4866 - Difficulty: 1)
(@CGUID+606, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1139.096, -5620.505, 14.72484, 3.324948, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+607, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1154.205, -5674.832, 0.5564611, 2.97026, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+608, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1114.503, -5622.909, 14.52188, 3.884992, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+609, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1066.809, -5621.01, 14.77437, 3.501835, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+610, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1087.315, -5609.155, 14.18648, 2.185365, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+611, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1036.749, -5595.548, 15.32088, 4.125668, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+612, 38141, 1, 6453, 4865, 1, '0', 0, 0, 0, -1039.372, -5549.505, 15.13469, 4.786616, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4865 - Difficulty: 1)
(@CGUID+613, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1009.669, -5643.562, 14.10617, 3.08723, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+614, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1018.273, -5675.487, -3.582161, 6.153988, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+615, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -1002.611, -5610.747, 14.58045, 5.934119, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+616, 38326, 1, 6453, 4865, 1, '0', 0, 0, 0, -1009.445, -5612.368, 14.52631, 6.254919, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4865 - Difficulty: 1)
(@CGUID+617, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1008.425, -5621.865, 14.57404, 2.732922, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+618, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -1002.764, -5627.716, 14.83747, 5.081244, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1)
(@CGUID+619, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1008.75, -5618.359, 14.44904, 3.734804, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+620, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1010.999, -5640.532, 14.35617, 2.060215, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+621, 38326, 1, 6453, 4865, 1, '0', 0, 0, 0, -1013.33, -5643.363, 14.13783, 0.3141593, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+622, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -1003.87, -5628.39, 14.91852, 5.43647, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1)
(@CGUID+623, 38326, 1, 6453, 4865, 1, '0', 0, 0, 0, -1005.096, -5630.932, 14.89369, 0.9948376, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+624, 38326, 1, 6453, 4865, 1, '0', 0, 0, 0, -1011.79, -5620.408, 14.5219, 0.2443461, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+625, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1002.344, -5609.896, 14.57404, 0.2907935, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+626, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1001.442, -5631.136, 14.44904, 1.204337, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+627, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -999.884, -5641.547, 14.16566, 0.4470661, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1)
(@CGUID+628, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -981.8807, -5623.2, 15.11629, 0.4371561, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1)
(@CGUID+629, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -998.8309, -5608.845, 14.57174, 4.389338, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+630, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -996.5781, -5639.962, 14.23017, 2.984513, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+631, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -999.9948, -5612.321, 14.52181, 2.513274, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+632, 38324, 1, 6453, 4865, 1, '0', 0, 0, 0, -1000.198, -5639.462, 14.28402, 5.951573, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4865 - Difficulty: 1) (Auras: )
(@CGUID+633, 38301, 1, 6453, 4865, 1, '0', 0, 0, 0, -985.25, -5613.052, 14.88626, 3.036873, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4865 - Difficulty: 1)
(@CGUID+634, 38300, 1, 6453, 4865, 1, '0', 0, 0, 0, -1002.072, -5628.859, 14.79717, 3.742601, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4865 - Difficulty: 1)
(@CGUID+635, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -991.4869, -5694.062, -4.25092, 0.0537988, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+636, 38301, 1, 6453, 4865, 1, '0', 0, 0, 0, -978.559, -5621.647, 15.14817, 3.281219, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4865 - Difficulty: 1)
(@CGUID+637, 39004, 1, 6453, 4865, 1, '0', 0, 0, 0, -1116.621, -5723.927, -0.7461592, 1.310194, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4865 - Difficulty: 1)
(@CGUID+638, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1010.725, -5554.084, 14.56868, 2.398876, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+639, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -991.6343, -5722.995, -9.00896, 3.589535, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+640, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -978.9861, -5583.788, 14.6806, 6.056293, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+641, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -969.3777, -5587.265, 13.1451, 1.686474, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+642, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -975.6105, -5585.195, 14.4825, 2.746749, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+643, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -969.7596, -5583.979, 14.35048, 0.430917, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+644, 6145, 1, 6453, 4875, 1, '0', 0, 0, 0, -952.793, -5678.641, -6.45131, 3.61902, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 6145 (Area: 4875 - Difficulty: 1)
(@CGUID+645, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -951.8359, -5662.802, -5.696698, 4.363369, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+646, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -999.7035, -5536.824, 14.59312, 5.691823, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+647, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -958.1024, -5567.603, 9.895838, 0.1745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+648, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -956.9685, -5556.561, 9.409609, 1.272938, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+649, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -966.4288, -5582.448, 14.42251, 2.408554, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+650, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -949.0927, -5566.382, 8.357607, 4.896176, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1)
(@CGUID+651, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -968.6094, -5580.406, 14.43321, 5.427974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+652, 38301, 1, 6453, 4875, 1, '0', 0, 0, 0, -948.5677, -5561.024, 7.961811, 4.614722, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4875 - Difficulty: 1)
(@CGUID+653, 3107, 1, 6453, 4875, 1, '0', 0, 0, 0, -937.9233, -5598.21, -0.8324959, 3.494873, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4875 - Difficulty: 1)
(@CGUID+654, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -955.0816, -5569.24, 9.704755, 2.984513, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+655, 38301, 1, 6453, 4875, 1, '0', 0, 0, 0, -948.4254, -5569.972, 7.83773, 2.901447, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4875 - Difficulty: 1)
(@CGUID+656, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1051.693, -5525.995, 14.9028, 6.199071, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+657, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -960.5972, -5556.077, 9.784146, 5.332563, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+658, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -958.7747, -5559.258, 9.721984, 2.091072, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+659, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1001.716, -5512.847, 14.37891, 3.986852, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+660, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1071.874, -5519.851, 14.57796, 0.8703643, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+661, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1001.716, -5512.847, 14.37891, 2.634383, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+662, 49743, 1, 6453, 4875, 1, '0', 0, 0, 0, -1009.212, -5506.51, 14.40906, 3.869035, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4875 - Difficulty: 1)
(@CGUID+663, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -1012.43, -5487.466, 14.49593, 2.816681, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+664, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -1012.43, -5487.466, 14.60741, 0.8001008, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+665, 3107, 1, 6453, 4875, 1, '0', 0, 0, 0, -890.0716, -5598.322, -8.122272, 2.189049, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4875 - Difficulty: 1)
(@CGUID+666, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -945.4805, -5469.852, 1.621021, 3.725608, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+667, 6145, 1, 6453, 4875, 1, '0', 0, 0, 0, -921.4261, -5474.575, -5.34849, 1.821878, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 6145 (Area: 4875 - Difficulty: 1)
(@CGUID+668, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -885.0948, -5476.08, -5.434832, 3.291817, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+669, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -852.5685, -5608.812, 1.60192, 5.956858, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+670, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -848.3073, -5589.12, 2.608408, 5.288348, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+671, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -847.9875, -5592.772, 2.753046, 1.658112, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+672, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -854.2105, -5599.055, 2.131219, 1.183039, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+673, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -855.4934, -5601.859, 1.745475, 2.278439, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+674, 3107, 1, 6453, 4875, 1, '0', 0, 0, 0, -854.848, -5514.478, -1.208895, 0.02408967, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4875 - Difficulty: 1)
(@CGUID+675, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -857.8768, -5599.073, 1.724079, 5.5676, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+676, 38141, 1, 6453, 4875, 1, '0', 0, 0, 0, -947.157, -5449.208, 1.365117, 5.534121, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4875 - Difficulty: 1)
(@CGUID+677, 38046, 1, 6453, 4875, 1, '0', 0, 0, 0, -996.7237, -5472.708, 14.47957, 3.66947, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38046 (Area: 4875 - Difficulty: 1)
(@CGUID+678, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -801.9739, -5558.814, 4.575902, 1.815142, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+679, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -844.9891, -5608.923, 2.756217, 4.295968, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1)
(@CGUID+680, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -849.1376, -5609.973, 2.117983, 5.717561, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+681, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -824.3316, -5586.795, 3.683598, 4.721352, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1)
(@CGUID+682, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -844.0264, -5609.677, 2.925869, 3.90119, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+683, 38217, 1, 6453, 4875, 1, '0', 0, 0, 0, -805.7656, -5556.752, 4.700805, 5.061455, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4875 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+684, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -846.6566, -5608.594, 2.587272, 4.711505, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+685, 38326, 1, 6453, 4875, 1, '0', 0, 0, 0, -834.2813, -5592.287, 3.75456, 4.468043, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38326 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+686, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -843.9854, -5606.261, 3.048078, 3.859419, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+687, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -835.6968, -5595.667, 3.727899, 1.174181, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+688, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -827.4135, -5598.839, 4.603211, 3.571131, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+689, 39004, 1, 6453, 4875, 1, '0', 0, 0, 0, -851.1238, -5456.243, -4.789248, 4.612469, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4875 - Difficulty: 1)
(@CGUID+690, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -800.3646, -5556.304, 4.51197, 2.984513, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+691, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -837.9188, -5592.656, 3.586542, 0.1011354, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+692, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -824.2814, -5594.191, 4.436025, 4.72576, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+693, 38442, 1, 6453, 4875, 1, '0', 0, 0, 0, -802.9844, -5555.736, 4.601042, 5.77704, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38442 (Area: 4875 - Difficulty: 1)
(@CGUID+694, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -824.8488, -5601.434, 5.175916, 1.401291, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1) (Auras: )
(@CGUID+695, 38324, 1, 6453, 4875, 1, '0', 0, 0, 0, -841.0101, -5615.68, 3.153949, 2.197661, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38324 (Area: 4875 - Difficulty: 1)
(@CGUID+696, 38301, 1, 6453, 4875, 1, '0', 0, 0, 0, -825.5104, -5611.594, 5.590129, 1.623156, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4875 - Difficulty: 1)
(@CGUID+697, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -824.2327, -5597.833, 4.85243, 1.727876, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+698, 38003, 1, 6453, 4875, 1, '0', 0, 0, 0, -800.1111, -5566.853, 7.98805, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4875 - Difficulty: 1) (Auras: 51195 - 51195)
(@CGUID+699, 38003, 1, 6453, 4875, 1, '0', 0, 0, 0, -789.8871, -5553.172, 9.474733, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4875 - Difficulty: 1) (Auras: 51195 - 51195)
(@CGUID+700, 38300, 1, 6453, 4875, 1, '0', 0, 0, 0, -843.1537, -5612.721, 2.851432, 6.170151, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4875 - Difficulty: 1)
(@CGUID+701, 38301, 1, 6453, 4875, 1, '0', 0, 0, 0, -838.8489, -5619.542, 3.158902, 1.623156, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4875 - Difficulty: 1)
(@CGUID+702, 62114, 1, 6453, 4867, 1, '0', 0, 0, 0, -745.6237, -5556.732, 25.59971, 2.791, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 62114 (Area: 4867 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+703, 38217, 1, 6453, 4867, 1, '0', 0, 0, 0, -768.0886, -5609.271, 24.26271, 3.769911, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4867 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+704, 38560, 1, 6453, 4867, 1, '0', 0, 0, 0, -753.9827, -5597.783, -6.767145, 0.7679449, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4867 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+705, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -732.9207, -5574.446, -36.47366, 4.155856, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+706, 49837, 1, 6453, 4867, 1, '0', 0, 0, 0, -732.8374, -5593.206, 25.62441, 2.976801, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4867 - Difficulty: 1)
(@CGUID+707, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -774.3733, -5632.524, -40.38972, 6.056293, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+708, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -738.3323, -5584.441, -40.13772, 1.054473, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+709, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -739.8553, -5595.765, -8.848619, 4.720572, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+710, 49837, 1, 6453, 4867, 1, '0', 0, 0, 0, -753.7108, -5624.999, 22.4511, 1.164878, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4867 - Difficulty: 1)
(@CGUID+711, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -773.434, -5636.302, 15.79251, 3.263766, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+712, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -778.1979, -5633.899, 15.22457, 5.253441, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+713, 38560, 1, 6453, 4867, 1, '0', 0, 0, 0, -729.6858, -5561.596, -34.91578, 5.51524, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4867 - Difficulty: 1)
(@CGUID+714, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -830.761, -5646.931, 4.026011, 0.6774857, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+715, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -778.4445, -5635.793, 14.72312, 5.811946, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+716, 38560, 1, 6453, 4867, 1, '0', 0, 0, 0, -771.5677, -5617.788, -40.31938, 5.183628, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4867 - Difficulty: 1)
(@CGUID+717, 38560, 1, 6453, 4867, 1, '0', 0, 0, 0, -738.2639, -5600.705, -43.27283, 2.75762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4867 - Difficulty: 1)
(@CGUID+718, 38440, 1, 6453, 4867, 1, '0', 0, 0, 0, -776.3993, -5636.847, 14.96513, 2.478368, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38440 (Area: 4867 - Difficulty: 1)
(@CGUID+719, 38423, 1, 6453, 4867, 1, '0', 0, 0, 0, -748.0052, -5612.531, 25.25563, 0.9250245, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38423 (Area: 4867 - Difficulty: 1) (Auras: )
(@CGUID+720, 38560, 1, 6453, 4867, 1, '0', 0, 0, 0, -736.5955, -5539.472, -32.43118, 6.178465, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4867 - Difficulty: 1)
(@CGUID+721, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -717.8969, -5529.747, -36.76683, 4.256205, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+722, 38437, 1, 6453, 4867, 1, '0', 0, 0, 0, -740.3889, -5617.327, 25.01457, 0.8552113, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38437 (Area: 4867 - Difficulty: 1) (Auras: )
(@CGUID+723, 38003, 1, 6453, 4867, 1, '0', 0, 0, 0, -726.4792, -5602.972, -11.22216, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4867 - Difficulty: 1) (Auras: 51195 - 51195)
(@CGUID+724, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -711.5781, -5567.128, -34.7919, 3.752458, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+725, 38225, 1, 6453, 4867, 1, '0', 0, 0, 0, -741.5434, -5615.521, 25.11356, 0.8726646, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38225 (Area: 4867 - Difficulty: 1)
(@CGUID+726, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -772.118, -5645.543, -40.92651, 1.832596, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+727, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -723.4063, -5589.193, -26.23756, 4.13643, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+728, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -714.4601, -5581.12, 25.58279, 4.13643, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1) (Auras: )
(@CGUID+729, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -717.1563, -5542.603, -34.53652, 4.363323, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+730, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -789.1996, -5651.821, -43.02824, 3.996804, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+731, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -762.8038, -5644.241, -40.04967, 0.715585, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+732, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -713.1787, -5521.255, -37.60725, 4.174631, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+733, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -713.1632, -5589.049, -11.85305, 1.291544, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+734, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -769.6809, -5461.642, -2.144433, 1.106227, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+735, 38306, 1, 6453, 4913, 1, '0', 0, 0, 0, -709.7136, -5582.707, 25.58903, 3.926991, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38306 (Area: 4913 - Difficulty: 1) (Auras: 22650 - 22650)
(@CGUID+736, 38217, 1, 6453, 4913, 1, '0', 0, 0, 0, -736.2743, -5635.342, 23.0526, 5.026548, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38217 (Area: 4913 - Difficulty: 1) (Auras: 18950 - 18950)
(@CGUID+737, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -721.691, -5612.953, -9.272364, 4.031711, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+738, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -710.2691, -5609.088, -4.551438, 6.021386, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+739, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -707.8212, -5605.351, -4.860311, 5.637414, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+740, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -734.0538, -5637.486, 22.65153, 2.408554, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+741, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -706.7239, -5587.703, 25.77755, 3.787364, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+742, 62114, 1, 6453, 4913, 1, '0', 0, 0, 0, -791.2033, -5661.101, 9.528583, 4.899057, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 62114 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+743, 38003, 1, 6453, 4913, 1, '0', 0, 0, 0, -703.7641, -5573.993, 28.68507, 4.13643, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4913 - Difficulty: 1)
(@CGUID+744, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -691.5949, -5623.998, -8.690048, 1.266617, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+745, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -685.7882, -5577.16, -17.95656, 3.211406, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+746, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -690.1788, -5514.563, 7.634208, 1.494474, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+747, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -680.8073, -5597.698, -8.454867, 0.1745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+748, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -678.4167, -5597.545, -8.491747, 3.001966, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+749, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -729.3594, -5652.724, -35.78409, 3.682645, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 38300 (Area: 4913 - Difficulty: 1)

INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `PhaseGroup`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `VerifiedBuild`) VALUES
(@CGUID+750, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -732.5174, -5655.028, -35.88644, 0.7330383, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+751, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -677.9184, -5623.099, -9.596497, 2.75762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+752, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -696.6895, -5645.944, -30.27048, 0.1606727, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+753, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -684.5208, -5627.724, -9.644386, 1.413717, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+754, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -713.9549, -5638.622, -35.28114, 4.433136, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+755, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -691.5208, -5528.226, -33.45092, 6.021386, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+756, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -697.4375, -5594.247, -16.15784, 0.2617994, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+757, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -683.6823, -5624.359, -9.46916, 4.555309, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+758, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -734.0087, -5652.29, -36.30926, 5.707227, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+759, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -699.0347, -5602.255, -6.885151, 5.393067, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+760, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -697.8333, -5642.71, -30.03859, 0.1745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+761, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -695.4427, -5642.557, -29.65929, 3.001966, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+762, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -708.4011, -5618.078, -5.608397, 0.2094395, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+763, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -693.8403, -5593.198, -16.83966, 3.490659, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+764, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -675.75, -5594.708, -8.157509, 4.153883, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+765, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -685.2674, -5636.132, -27.74869, 5.916666, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+766, 49743, 1, 6453, 4913, 1, '0', 0, 0, 0, -679.0078, -5523.357, 6.992607, 3.104402, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49743 (Area: 4913 - Difficulty: 1)
(@CGUID+767, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -790.4535, -5674.692, 7.844609, 0.9491838, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+768, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -678.6288, -5643.041, -27.05834, 3.608879, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: ) (possible waypoints or random movement)
(@CGUID+769, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -693.1493, -5655.908, -28.95308, 2.042035, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+770, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -652.4757, -5598.66, -23.12575, 5.480334, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+771, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -650.3889, -5601.28, -23.54532, 2.076942, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+772, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -664.9514, -5659.929, -23.62513, 5.742133, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+773, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -646.9792, -5598.412, -23.96618, 3.333579, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1) (Auras: 72072 - 72072)
(@CGUID+774, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -647.6788, -5627.458, -25.23212, 2.530727, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+775, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -666.3386, -5545.564, -37.81979, 3.01942, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+776, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -643.8117, -5605.244, 8.245321, 2.374668, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+777, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -659.2379, -5641.582, -26.14087, 2.268928, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+778, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -661.4149, -5661.712, -23.18869, 2.722714, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+779, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -696.2789, -5686.84, 5.347595, 5.461891, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+780, 62114, 1, 6453, 4913, 1, '0', 0, 0, 0, -660.3242, -5664.49, 6.161422, 4.129846, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 62114 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+781, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -656.4124, -5652.043, 5.947084, 3.439115, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+782, 49837, 1, 6453, 4913, 1, '0', 0, 0, 0, -649.3675, -5647.876, 4.707808, 0.915577, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 49837 (Area: 4913 - Difficulty: 1)
(@CGUID+783, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -645.2813, -5627.596, -25.27508, 2.094395, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+784, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -626.4219, -5623.596, 1.607758, 4.032157, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+785, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -643.0126, -5676.99, 1.872237, 4.67711, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+786, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -773.1949, -5697.868, 5.421514, 4.640108, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+787, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -631.3004, -5650.255, -26.43858, 3.473205, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+788, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -672.2826, -5701.417, 1.703321, 2.468378, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+789, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -710.8716, -5712.593, 0.4798373, 3.782053, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+790, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -720.4514, -5580.278, -11.68313, 0.01267187, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (Auras: )
(@CGUID+791, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -718.0608, -5580.125, -11.64555, 0.1614101, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+792, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -638.838, -5557.606, 1.973159, 5.832638, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+793, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -624.1653, -5589.365, 1.019547, 0.4453609, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+794, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -618.6788, -5654.842, -26.67672, 3.595378, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+795, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -618.6129, -5659.122, -26.63174, 3.193953, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+796, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -606.25, -5614.584, -0.3128965, 4.761236, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+797, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -598.4666, -5655.634, -3.17056, 5.083194, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+798, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -671.9045, -5528.021, -36.14418, 3.804818, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1)
(@CGUID+799, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -606.6141, -5556.126, -1.696314, 4.113017, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+800, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -679.1719, -5518.213, -31.99417, 4.572762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+801, 38560, 1, 6453, 4913, 1, '0', 0, 0, 0, -679.2205, -5515.137, -31.07312, 4.572762, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38560 (Area: 4913 - Difficulty: 1)
(@CGUID+802, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -672.7396, -5511.794, 6.971692, 1.326002, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+803, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -639.6884, -5504.838, 1.114287, 1.783528, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+804, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -708.2307, -5492.298, 2.069542, 1.245885, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+805, 39004, 1, 6453, 4913, 1, '0', 0, 0, 0, -579.1642, -5648.791, -7.607821, 4.081006, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4913 - Difficulty: 1)
(@CGUID+806, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -625.9547, -5722.647, -11.74613, 3.290676, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+807, 38301, 1, 6453, 4913, 1, '0', 0, 0, 0, -732.507, -5727.478, 4.950576, 5.044002, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4913 - Difficulty: 1)
(@CGUID+808, 3107, 1, 6453, 4913, 1, '0', 0, 0, 0, -795.6929, -5709.212, -1.100216, 1.334933, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4913 - Difficulty: 1)
(@CGUID+809, 38300, 1, 6453, 4913, 1, '0', 0, 0, 0, -828.6534, -5677.213, 2.960575, 1.89872, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38300 (Area: 4913 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+810, 6491, 1, 6453, 4875, 1, '0', 0, 0, 0, -1039.63, -5416.73, 13.37213, 3.141593, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 6491 (Area: 4875 - Difficulty: 1) (Auras: 9036 - 9036, 10848 - 10848)
(@CGUID+811, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -858.8489, -5671.717, 4.910676, 3.577925, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+812, 3107, 1, 6453, 4867, 1, '0', 0, 0, 0, -879.5474, -5695.462, -4.047662, 1.314974, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 3107 (Area: 4867 - Difficulty: 1)
(@CGUID+813, 39004, 1, 6453, 4867, 1, '0', 0, 0, 0, -750.5286, -5772.382, -10.01234, 4.531837, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4867 - Difficulty: 1)
(@CGUID+814, 39004, 1, 6453, 4867, 1, '0', 0, 0, 0, -790.6264, -5762.043, -7.685439, 4.302648, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 39004 (Area: 4867 - Difficulty: 1)
(@CGUID+815, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -683.6823, -5624.359, -9.46916, 4.555309, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+816, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -684.5208, -5627.724, -9.644386, 1.413717, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+817, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -680.8073, -5597.698, -8.454867, 0.1745329, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+818, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -678.4167, -5597.545, -8.491747, 3.001966, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+819, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -710.2691, -5609.088, -4.551438, 6.021386, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+820, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -697.4375, -5594.247, -16.15784, 0.2617994, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+821, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -693.8403, -5593.198, -16.83966, 3.490659, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+822, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -720.4514, -5580.278, -11.68313, 0.01267187, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+823, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -718.0608, -5580.125, -11.64555, 0.1614101, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+824, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -708.4011, -5618.078, -5.608397, 0.2094395, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+825, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -689.3924, -5612.068, -8.191093, 4.505539, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+826, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -687.0018, -5611.915, -8.312889, 4.055816, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+827, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -699.0347, -5602.255, -6.885151, 5.393067, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+828, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -659.2379, -5641.582, -26.14087, 2.268928, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+829, 38542, 1, 6453, 4867, 1, '0', 0, 0, 0, -711.1406, -5574.353, 26.05304, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38542 (Area: 4867 - Difficulty: 1) (Auras: 72250 - 72250)
(@CGUID+830, 38542, 1, 6453, 4867, 1, '0', 0, 0, 0, -706.9375, -5578.522, 26.01914, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38542 (Area: 4867 - Difficulty: 1) (Auras: 72250 - 72250)
(@CGUID+831, 38542, 1, 6453, 4867, 1, '0', 0, 0, 0, -700.2049, -5579.721, 26.01771, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38542 (Area: 4867 - Difficulty: 1) (Auras: 72250 - 72250)
(@CGUID+832, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -652.4757, -5598.66, -23.12575, 5.480334, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+833, 38301, 1, 6453, 4867, 1, '0', 0, 0, 0, -650.3889, -5601.28, -23.54532, 2.076942, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38301 (Area: 4867 - Difficulty: 1)
(@CGUID+834, 38300, 1, 6453, 4867, 1, '0', 0, 0, 0, -647.6788, -5627.458, -25.23212, 2.530727, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38300 (Area: 4867 - Difficulty: 1)
(@CGUID+835, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1214.132, -5504.005, 12.47501, 0.5006903, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+836, 38003, 1, 6453, 4866, 1, '0', 0, 0, 0, -1322.481, -5608.927, 25.03553, 3.979351, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38003 (Area: 4866 - Difficulty: 1) (Auras: 49415 - 49415)
(@CGUID+837, 38966, 1, 6453, 4866, 1, '0', 0, 0, 0, -1318.085, -5603.771, 23.80273, 0.8901179, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38966 (Area: 4866 - Difficulty: 1) (Auras: 49415 - 49415)
(@CGUID+838, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1279.894, -5481.236, 14.6312, 6.05534, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+839, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1243.23, -5518.515, 14.82762, 2.395061, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+840, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1225.905, -5540.649, 14.46012, 0.4405049, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+841, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1310.597, -5492.776, 14.76563, 3.12337, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1)
(@CGUID+842, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1228.856, -5605.446, 14.60987, 0, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
(@CGUID+843, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1228.031, -5582.155, 14.77296, 1.919018, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266) (possible waypoints or random movement)
(@CGUID+844, 38939, 1, 6453, 4866, 1, '0', 0, 0, 0, -1323.307, -5609.903, 25.30504, 0.9250245, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38939 (Area: 4866 - Difficulty: 1) (Auras: 49415 - 49415)
(@CGUID+845, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1345.717, -5507.689, 14.22618, 0.2345461, 120, 10, 0, 0, 0, 1, 0, 0, 0, 26365), -- 38141 (Area: 4866 - Difficulty: 1) (possible waypoints or random movement)
(@CGUID+846, 38938, 1, 6453, 4866, 1, '0', 0, 0, 0, -1321.641, -5610.247, 25.45405, 2.460914, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38938 (Area: 4866 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+847, 38953, 1, 6453, 4866, 1, '0', 0, 0, 0, -1323.865, -5608.563, 25.45229, 5.480334, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365), -- 38953 (Area: 4866 - Difficulty: 1) (Auras: 49414 - 49414)
(@CGUID+848, 38141, 1, 6453, 4866, 1, '0', 0, 0, 0, -1228.856, -5605.446, 14.60987, 1.916396, 120, 0, 0, 0, 0, 0, 0, 0, 0, 26365); -- 38141 (Area: 4866 - Difficulty: 1) (Auras: 29266 - 29266)
SET @CGUID := 210115305;
DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+848;
INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+0, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+1, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+2, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+3, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+4, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+5, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38281 - 73299 - 73299
(@CGUID+6, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+7, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+8, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+9, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+10, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+11, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 42618
(@CGUID+12, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+13, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+14, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+15, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+16, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+17, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+18, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 42619 - 73299 - 73299
(@CGUID+19, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+20, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+21, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+22, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+23, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38242
(@CGUID+24, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+25, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+26, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+27, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 42619 - 73299 - 73299
(@CGUID+28, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+29, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+30, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+31, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+32, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+33, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+34, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+35, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+36, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+37, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+38, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+39, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38142
(@CGUID+40, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 42619 - 73299 - 73299
(@CGUID+41, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+42, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38272
(@CGUID+43, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+44, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+45, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+46, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+47, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+48, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+49, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+50, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+51, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+52, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+53, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+54, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+55, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+56, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39062
(@CGUID+57, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+58, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+59, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+60, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38244
(@CGUID+61, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+62, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+63, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+64, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38037
(@CGUID+65, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+66, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+67, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38272
(@CGUID+68, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 63309
(@CGUID+69, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+70, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+71, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+72, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+73, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+74, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 63310
(@CGUID+75, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+76, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+77, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+78, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+79, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+80, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+81, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+82, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+83, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+84, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+85, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+86, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+87, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38272
(@CGUID+88, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+89, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+90, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+91, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+92, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+93, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+94, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+95, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+96, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+97, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+98, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+99, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+100, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+101, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+102, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+103, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+104, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+105, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+106, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+107, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+108, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+109, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+110, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+111, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38280 - 73299 - 73299
(@CGUID+112, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+113, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+114, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+115, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+116, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38272
(@CGUID+117, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+118, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+119, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+120, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+121, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+122, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+123, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+124, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+125, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+126, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+127, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+128, 0, 0, 0, 1, 0, 0, 0, 0, '71066'), -- 38038 - 71066 - 71066
(@CGUID+129, 0, 0, 0, 1, 0, 0, 0, 0, '71064'), -- 38038 - 71064 - 71064
(@CGUID+130, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+131, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+132, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+133, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+134, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 38247
(@CGUID+135, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38142
(@CGUID+136, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+137, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38282
(@CGUID+138, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38282
(@CGUID+139, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+140, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+141, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+142, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+143, 0, 0, 0, 1, 0, 0, 0, 0, '71066'), -- 38038 - 71066 - 71066
(@CGUID+144, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+145, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+146, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+147, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+148, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+149, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+150, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+151, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+152, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+153, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39062
(@CGUID+154, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+155, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+156, 0, 0, 0, 1, 0, 0, 0, 0, '71065'), -- 38038 - 71065 - 71065
(@CGUID+157, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+158, 0, 0, 0, 1, 0, 0, 0, 0, '71064'), -- 38038 - 71064 - 71064
(@CGUID+159, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+160, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+161, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38990
(@CGUID+162, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+163, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+164, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+165, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+166, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+167, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38988
(@CGUID+168, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+169, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+170, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+171, 0, 0, 0, 1, 0, 0, 0, 0, '71064'), -- 38038 - 71064 - 71064
(@CGUID+172, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+173, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+174, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+175, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+176, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+177, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+178, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+179, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+180, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+181, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+182, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+183, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39032
(@CGUID+184, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+185, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+186, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 38005
(@CGUID+187, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+188, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+189, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+190, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+191, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+192, 0, 0, 65536, 0, 0, 0, 0, 0, '65017'), -- 38442 - 65017 - 65017
(@CGUID+193, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+194, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+195, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+196, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+197, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+198, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+199, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39031
(@CGUID+200, 0, 0, 65536, 1, 0, 0, 0, 0, '65017'), -- 38989 - 65017 - 65017
(@CGUID+201, 0, 0, 0, 1, 0, 0, 0, 0, '133464'), -- 90113 - 133464 - 133464
(@CGUID+202, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+203, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+204, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+205, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+206, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+207, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(@CGUID+208, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+209, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+210, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+211, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+212, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+213, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+214, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+215, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+216, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+217, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+218, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+219, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+220, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+221, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+222, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+223, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+224, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+225, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+226, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+227, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+228, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+229, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+230, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+231, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+232, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+233, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+234, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+235, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38278 - 73299 - 73299
(@CGUID+236, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+237, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+238, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+239, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+240, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+241, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+242, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38245
(@CGUID+243, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+244, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+245, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38142
(@CGUID+246, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+247, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+248, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+249, 0, 0, 8, 257, 0, 0, 0, 0, ''); -- 47057

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+250, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38280 - 73299 - 73299
(@CGUID+251, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+252, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+253, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+254, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+255, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38243
(@CGUID+256, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+257, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+258, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+259, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+260, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38278 - 73299 - 73299
(@CGUID+261, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+262, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+263, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+264, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38278 - 73299 - 73299
(@CGUID+265, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+266, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+267, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38279 - 73299 - 73299
(@CGUID+268, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+269, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+270, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+271, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+272, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(@CGUID+273, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38246
(@CGUID+274, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+275, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+276, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+277, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+278, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38278 - 73299 - 73299
(@CGUID+279, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+280, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+281, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+282, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+283, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+284, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+285, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39033
(@CGUID+286, 0, 0, 0, 1, 0, 0, 0, 0, '71065 83470'), -- 38038 - 71065 - 71065, 83470 - 83470
(@CGUID+287, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+288, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+289, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+290, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+291, 0, 0, 0, 1, 0, 0, 0, 0, '71066 83470'), -- 38038 - 71066 - 71066, 83470 - 83470
(@CGUID+292, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064 - 71064, 83470 - 83470
(@CGUID+293, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(@CGUID+294, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+295, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+296, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+297, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+298, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+299, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+300, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+301, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+302, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+303, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+304, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+305, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+306, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+307, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+308, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+309, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+310, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+311, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62114
(@CGUID+312, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+313, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+314, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+315, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+316, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+317, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+318, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+319, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+320, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+321, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+322, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+323, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+324, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+325, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+326, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+327, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+328, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+329, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39008
(@CGUID+330, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+331, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 39007
(@CGUID+332, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+333, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+334, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+335, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+336, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+337, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 38966 - 49414 - 49414
(@CGUID+338, 0, 0, 65536, 1, 0, 0, 0, 0, '65017'), -- 38440 - 65017 - 65017
(@CGUID+339, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 38003 - 49414 - 49414
(@CGUID+340, 0, 0, 65536, 257, 0, 0, 0, 0, '65017'), -- 39027 - 65017 - 65017
(@CGUID+341, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+342, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+343, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+344, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+345, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+346, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+347, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+348, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+349, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+350, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38938 - 49414 - 49414
(@CGUID+351, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38953 - 49414 - 49414
(@CGUID+352, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+353, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+354, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+355, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+356, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+357, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+358, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+359, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+360, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+361, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+362, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+363, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+364, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+365, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+366, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+367, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+368, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+369, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+370, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+371, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+372, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+373, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+374, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+375, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+376, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+377, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+378, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+379, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+380, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+381, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+382, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+383, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+384, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+385, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+386, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+387, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 38953 - 49414 - 49414
(@CGUID+388, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 38938 - 49414 - 49414
(@CGUID+389, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 89713 - 46598 - 46598
(@CGUID+390, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+391, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+392, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+393, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+394, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+395, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+396, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+397, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+398, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+399, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+400, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+401, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+402, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+403, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+404, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+405, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(@CGUID+406, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+407, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+408, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+409, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+410, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+411, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+412, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+413, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+414, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+415, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+416, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+417, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+418, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+419, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+420, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+421, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37987
(@CGUID+422, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+423, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+424, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+425, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+426, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+427, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+428, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+429, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+430, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+431, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37969
(@CGUID+432, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+433, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+434, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 37989 - 49414 - 49414
(@CGUID+435, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+436, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+437, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+438, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+439, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+440, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+441, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+442, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+443, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+444, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+445, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+446, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+447, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+448, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+449, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+450, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+451, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+452, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(@CGUID+453, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+454, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+455, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+456, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+457, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(@CGUID+458, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+459, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+460, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+461, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+462, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+463, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+464, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+465, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+466, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+467, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+468, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+469, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+470, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+471, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+472, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+473, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+474, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+475, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+476, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+477, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+478, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+479, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+480, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+481, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+482, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+483, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+484, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+485, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+486, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+487, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+488, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+489, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39072
(@CGUID+490, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+491, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+492, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+493, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+494, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+495, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+496, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+497, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+498, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+499, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 39157

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+500, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+501, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+502, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(@CGUID+503, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+504, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 39157 - 46598 - 46598
(@CGUID+505, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+506, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+507, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 39157 - 46598 - 46598
(@CGUID+508, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 39157 - 46598 - 46598
(@CGUID+509, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+510, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+511, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+512, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+513, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+514, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 39157 - 46598 - 46598
(@CGUID+515, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+516, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+517, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 39157 - 46598 - 46598
(@CGUID+518, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+519, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+520, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+521, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+522, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+523, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+524, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+525, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+526, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+527, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+528, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+529, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+530, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+531, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+532, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+533, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+534, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+535, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+536, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+537, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+538, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+539, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(@CGUID+540, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+541, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+542, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+543, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+544, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+545, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+546, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+547, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39072
(@CGUID+548, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+549, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+550, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+551, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+552, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+553, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+554, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+555, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+556, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+557, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+558, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+559, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+560, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+561, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773 - 79773
(@CGUID+562, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+563, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(@CGUID+564, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+565, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+566, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+567, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+568, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+569, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+570, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+571, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+572, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+573, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+574, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+575, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+576, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+577, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+578, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+579, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+580, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+581, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+582, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+583, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+584, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+585, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+586, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+587, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+588, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+589, 0, 0, 65536, 257, 0, 0, 0, 0, '60921'), -- 39027 - 60921 - 60921
(@CGUID+590, 0, 0, 65536, 1, 0, 0, 0, 0, '60921'), -- 38440 - 60921 - 60921
(@CGUID+591, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+592, 0, 0, 65536, 1, 0, 0, 0, 0, '60921'), -- 38931 - 60921 - 60921
(@CGUID+593, 0, 0, 65536, 1, 0, 0, 0, 0, '60921'), -- 38989 - 60921 - 60921
(@CGUID+594, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+595, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+596, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+597, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+598, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+599, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921 - 60921
(@CGUID+600, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+601, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+602, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 89713 - 46598 - 46598
(@CGUID+603, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+604, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+605, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+606, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+607, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+608, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+609, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+610, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+611, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+612, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+613, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+614, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+615, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+616, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+617, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+618, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+619, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+620, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+621, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+622, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+623, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+624, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+625, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+626, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+627, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+628, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+629, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+630, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+631, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+632, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+633, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+634, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+635, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+636, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+637, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+638, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+639, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+640, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+641, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+642, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+643, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+644, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(@CGUID+645, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+646, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+647, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+648, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+649, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+650, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+651, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+652, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+653, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+654, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+655, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+656, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+657, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+658, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+659, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+660, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+661, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+662, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+663, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+664, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+665, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+666, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+667, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(@CGUID+668, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+669, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+670, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+671, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+672, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+673, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+674, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+675, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+676, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+677, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38046
(@CGUID+678, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+679, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+680, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+681, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+682, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+683, 0, 0, 1, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+684, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+685, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(@CGUID+686, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+687, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+688, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+689, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+690, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+691, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+692, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+693, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38442
(@CGUID+694, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+695, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(@CGUID+696, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+697, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+698, 0, 0, 50331648, 1, 0, 0, 0, 0, '51195'), -- 38003 - 51195 - 51195
(@CGUID+699, 0, 0, 50331648, 1, 0, 0, 0, 0, '51195'), -- 38003 - 51195 - 51195
(@CGUID+700, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+701, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+702, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62114
(@CGUID+703, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+704, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+705, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+706, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+707, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+708, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+709, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+710, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+711, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+712, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+713, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+714, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+715, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+716, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+717, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+718, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38440
(@CGUID+719, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 38423
(@CGUID+720, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+721, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+722, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 38437
(@CGUID+723, 0, 0, 50331648, 1, 0, 0, 0, 0, '51195'), -- 38003 - 51195 - 51195
(@CGUID+724, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+725, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38225
(@CGUID+726, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+727, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+728, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+729, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+730, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+731, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+732, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+733, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+734, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+735, 0, 0, 0, 1, 0, 0, 0, 0, '22650'), -- 38306 - 22650 - 22650
(@CGUID+736, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950 - 18950
(@CGUID+737, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+738, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+739, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+740, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38300 - 29266 - 29266
(@CGUID+741, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+742, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62114
(@CGUID+743, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(@CGUID+744, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+745, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+746, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+747, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+748, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+749, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 38300

INSERT INTO `creature_addon` (`guid`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(@CGUID+750, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+751, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+752, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+753, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+754, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+755, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+756, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+757, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+758, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+759, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+760, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+761, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+762, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+763, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+764, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+765, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+766, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(@CGUID+767, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+768, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+769, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+770, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+771, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+772, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+773, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072 - 72072
(@CGUID+774, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+775, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+776, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+777, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+778, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+779, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+780, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62114
(@CGUID+781, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+782, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(@CGUID+783, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+784, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+785, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+786, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+787, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+788, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+789, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+790, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+791, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+792, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+793, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+794, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+795, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+796, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+797, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+798, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+799, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+800, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+801, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38560
(@CGUID+802, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+803, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+804, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+805, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+806, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+807, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+808, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+809, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+810, 0, 0, 65536, 1, 0, 0, 0, 0, '9036 10848'), -- 6491 - 9036 - 9036, 10848 - 10848
(@CGUID+811, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+812, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(@CGUID+813, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+814, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(@CGUID+815, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+816, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+817, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+818, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+819, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+820, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+821, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+822, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+823, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+824, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+825, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+826, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+827, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+828, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+829, 0, 0, 0, 1, 0, 0, 0, 0, '72250'), -- 38542 - 72250 - 72250
(@CGUID+830, 0, 0, 0, 1, 0, 0, 0, 0, '72250'), -- 38542 - 72250 - 72250
(@CGUID+831, 0, 0, 0, 1, 0, 0, 0, 0, '72250'), -- 38542 - 72250 - 72250
(@CGUID+832, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+833, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(@CGUID+834, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(@CGUID+835, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+836, 0, 0, 65536, 1, 0, 0, 0, 0, '49415'), -- 38003 - 49415 - 49415
(@CGUID+837, 0, 0, 65536, 1, 0, 0, 0, 0, '49415'), -- 38966 - 49415 - 49415
(@CGUID+838, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+839, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+840, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+841, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+842, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+843, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266 - 29266
(@CGUID+844, 0, 0, 0, 1, 0, 0, 0, 0, '49415'), -- 38939 - 49415 - 49415
(@CGUID+845, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38141
(@CGUID+846, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38938 - 49414 - 49414
(@CGUID+847, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38953 - 49414 - 49414
(@CGUID+848, 0, 0, 0, 1, 0, 0, 0, 0, '29266'); -- 38141 - 29266 - 29266


DELETE FROM `creature_template_addon` WHERE `entry` IN (38939 /*38939 - 49415*/, 38542 /*38542 - 72250*/, 6491 /*6491 - 9036, 10848*/, 38306 /*38306 - 22650*/, 38225 /*38225*/, 38437 /*38437*/, 38423 /*38423*/, 38560 /*38560 - 72072*/, 38301 /*38301*/, 38326 /*38326*/, 38324 /*38324*/, 38300 /*38300*/, 38931 /*38931 - 60921*/, 39028 /*39028 - 60921*/, 3107 /*3107*/, 39072 /*39072*/, 37961 /*37961 - 79773*/, 39157 /*39157*/, 37989 /*37989 - 49414*/, 37969 /*37969*/, 37987 /*37987*/, 6145 /*6145*/, 89713 /*89713 - 46598*/, 38953 /*38953 - 49414*/, 38938 /*38938 - 49414*/, 39027 /*39027 - 65017*/, 38440 /*38440 - 65017*/, 38966 /*38966 - 49414*/, 39007 /*39007*/, 39008 /*39008*/, 62114 /*62114*/, 39033 /*39033*/, 38246 /*38246*/, 38279 /*38279 - 73299*/, 38243 /*38243*/, 38245 /*38245*/, 38278 /*38278 - 73299*/, 49743 /*49743*/, 90113 /*90113 - 133464*/, 38989 /*38989 - 65017*/, 39031 /*39031*/, 38442 /*38442 - 65017*/, 39004 /*39004*/, 38005 /*38005*/, 37960 /*37960*/, 39032 /*39032*/, 38217 /*38217 - 18950*/, 38988 /*38988*/, 38990 /*38990*/, 38282 /*38282*/, 38247 /*38247*/, 38280 /*38280 - 73299*/, 49837 /*49837*/, 47057 /*47057*/, 38987 /*38987*/, 63310 /*63310*/, 63309 /*63309*/, 38037 /*38037*/, 38244 /*38244*/, 39062 /*39062*/, 38141 /*38141 - 29266*/, 38272 /*38272*/, 38142 /*38142*/, 38003 /*38003*/, 38242 /*38242*/, 38268 /*38268*/, 42619 /*42619 - 73299*/, 42618 /*42618*/, 37956 /*37956*/, 38281 /*38281 - 73299*/, 38038 /*38038 - 71064, 83470*/, 38046 /*38046*/);
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `aiAnimKit`, `movementAnimKit`, `meleeAnimKit`, `auras`) VALUES
(38939, 0, 0, 0, 1, 0, 0, 0, 0, '49415'), -- 38939 - 49415
(38542, 0, 0, 0, 1, 0, 0, 0, 0, '72250'), -- 38542 - 72250
(6491, 0, 0, 65536, 1, 0, 0, 0, 0, '9036 10848'), -- 6491 - 9036, 10848
(38306, 0, 0, 0, 1, 0, 0, 0, 0, '22650'), -- 38306 - 22650
(38225, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38225
(38437, 0, 0, 0, 257, 0, 0, 0, 0, ''), -- 38437
(38423, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 38423
(38560, 0, 0, 0, 1, 0, 0, 0, 0, '72072'), -- 38560 - 72072
(38301, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38301
(38326, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38326
(38324, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38324
(38300, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38300
(38931, 0, 0, 65536, 1, 0, 0, 0, 0, '60921'), -- 38931 - 60921
(39028, 0, 14341, 65536, 1, 0, 0, 0, 0, '60921'), -- 39028 - 60921
(3107, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 3107
(39072, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39072
(37961, 0, 0, 0, 1, 0, 0, 0, 0, '79773'), -- 37961 - 79773
(39157, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39157
(37989, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 37989 - 49414
(37969, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37969
(37987, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37987
(6145, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 6145
(89713, 0, 0, 0, 1, 0, 0, 0, 0, '46598'), -- 89713 - 46598
(38953, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38953 - 49414
(38938, 0, 0, 0, 1, 0, 0, 0, 0, '49414'), -- 38938 - 49414
(39027, 0, 0, 65536, 257, 0, 0, 0, 0, '65017'), -- 39027 - 65017
(38440, 0, 0, 65536, 1, 0, 0, 0, 0, '65017'), -- 38440 - 65017
(38966, 0, 0, 65536, 1, 0, 0, 0, 0, '49414'), -- 38966 - 49414
(39007, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 39007
(39008, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39008
(62114, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 62114
(39033, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39033
(38246, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38246
(38279, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38279 - 73299
(38243, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38243
(38245, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38245
(38278, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38278 - 73299
(49743, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49743
(90113, 0, 0, 0, 1, 0, 0, 0, 0, '133464'), -- 90113 - 133464
(38989, 0, 0, 65536, 1, 0, 0, 0, 0, '65017'), -- 38989 - 65017
(39031, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39031
(38442, 0, 0, 65536, 0, 0, 0, 0, 0, '65017'), -- 38442 - 65017
(39004, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39004
(38005, 0, 0, 1, 1, 0, 0, 0, 0, ''), -- 38005
(37960, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37960
(39032, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39032
(38217, 0, 0, 0, 257, 0, 0, 0, 0, '18950'), -- 38217 - 18950
(38988, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38988
(38990, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38990
(38282, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38282
(38247, 0, 0, 0, 2, 0, 0, 0, 0, ''), -- 38247
(38280, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38280 - 73299
(49837, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 49837
(47057, 0, 0, 8, 257, 0, 0, 0, 0, ''), -- 47057
(38987, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38987
(63310, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 63310
(63309, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 63309
(38037, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38037
(38244, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38244
(39062, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 39062
(38141, 0, 0, 0, 1, 0, 0, 0, 0, '29266'), -- 38141 - 29266
(38272, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38272
(38142, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38142
(38003, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38003
(38242, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38242
(38268, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 38268
(42619, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 42619 - 73299
(42618, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 42618
(37956, 0, 0, 0, 1, 0, 0, 0, 0, ''), -- 37956
(38281, 0, 0, 0, 1, 0, 0, 0, 0, '73299'), -- 38281 - 73299
(38038, 0, 0, 0, 1, 0, 0, 0, 0, '71064 83470'), -- 38038 - 71064, 83470
(38046, 0, 0, 0, 1, 0, 0, 0, 0, ''); -- 38046


DELETE FROM `creature_template_scaling` WHERE `Entry` IN (39028, 3107, 38442, 47057);
INSERT INTO `creature_template_scaling` (`Entry`, `LevelScalingMin`, `LevelScalingMax`, `LevelScalingDeltaMin`, `LevelScalingDeltaMax`, `VerifiedBuild`) VALUES
(39028, 5, 20, 0, 0, 26365),
(3107, 5, 20, 0, 1, 26365),
(38442, 5, 20, 0, 0, 26365),
(47057, 5, 20, 0, 0, 26365);



DELETE FROM `npc_vendor` WHERE (`entry`=39032 AND `item`=4496 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39032 AND `item`=159 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39032 AND `item`=4540 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=8766 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=1645 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=1708 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=1205 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=1179 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=159 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=8952 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=4599 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=3771 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=3770 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=2287 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39031 AND `item`=117 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=714 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=1836 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=210 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=209 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=1835 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=85 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=711 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=3596 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=195 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=194 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=3595 AND `ExtendedCost`=0 AND `type`=1) OR (`entry`=39033 AND `item`=193 AND `ExtendedCost`=0 AND `type`=1);
INSERT INTO `npc_vendor` (`entry`, `slot`, `item`, `maxcount`, `ExtendedCost`, `type`, `PlayerConditionID`, `IgnoreFiltering`, `VerifiedBuild`) VALUES
(39032, 3, 4496, 0, 0, 1, 0, 0, 26365), -- 4496
(39032, 2, 159, 0, 0, 1, 0, 0, 26365), -- 159
(39032, 1, 4540, 0, 0, 1, 0, 0, 26365), -- 4540
(39031, 12, 8766, 0, 0, 1, 0, 0, 26365), -- 8766
(39031, 11, 1645, 0, 0, 1, 0, 0, 26365), -- 1645
(39031, 10, 1708, 0, 0, 1, 0, 0, 26365), -- 1708
(39031, 9, 1205, 0, 0, 1, 0, 0, 26365), -- 1205
(39031, 8, 1179, 0, 0, 1, 0, 0, 26365), -- 1179
(39031, 7, 159, 0, 0, 1, 0, 0, 26365), -- 159
(39031, 6, 8952, 0, 0, 1, 0, 0, 26365), -- 8952
(39031, 5, 4599, 0, 0, 1, 0, 0, 26365), -- 4599
(39031, 4, 3771, 0, 0, 1, 0, 0, 26365), -- 3771
(39031, 3, 3770, 0, 0, 1, 0, 0, 26365), -- 3770
(39031, 2, 2287, 0, 0, 1, 0, 0, 26365), -- 2287
(39031, 1, 117, 0, 0, 1, 0, 0, 26365), -- 117
(39033, 12, 714, 0, 0, 1, 0, 1, 26365), -- 714
(39033, 11, 1836, 0, 0, 1, 0, 1, 26365), -- 1836
(39033, 10, 210, 0, 0, 1, 0, 1, 26365), -- 210
(39033, 9, 209, 0, 0, 1, 0, 1, 26365), -- 209
(39033, 8, 1835, 0, 0, 1, 0, 1, 26365), -- 1835
(39033, 7, 85, 0, 0, 1, 0, 1, 26365), -- 85
(39033, 6, 711, 0, 0, 1, 0, 0, 26365), -- 711
(39033, 5, 3596, 0, 0, 1, 0, 0, 26365), -- 3596
(39033, 4, 195, 0, 0, 1, 0, 0, 26365), -- 195
(39033, 3, 194, 0, 0, 1, 0, 0, 26365), -- 194
(39033, 2, 3595, 0, 0, 1, 0, 0, 26365), -- 3595
(39033, 1, 193, 0, 0, 1, 0, 0, 26365); -- 193


DELETE FROM `creature_equip_template` WHERE (`CreatureID`=38939 AND `ID`=1) OR (`CreatureID`=38225 AND `ID`=1) OR (`CreatureID`=38437 AND `ID`=1) OR (`CreatureID`=38423 AND `ID`=1) OR (`CreatureID`=38301 AND `ID`=1) OR (`CreatureID`=38326 AND `ID`=1) OR (`CreatureID`=38324 AND `ID`=1) OR (`CreatureID`=38300 AND `ID`=1) OR (`CreatureID`=38931 AND `ID`=1) OR (`CreatureID`=39028 AND `ID`=1) OR (`CreatureID`=39072 AND `ID`=1) OR (`CreatureID`=38953 AND `ID`=1) OR (`CreatureID`=38938 AND `ID`=1) OR (`CreatureID`=39027 AND `ID`=1) OR (`CreatureID`=38440 AND `ID`=1) OR (`CreatureID`=38966 AND `ID`=1) OR (`CreatureID`=38246 AND `ID`=1) OR (`CreatureID`=38279 AND `ID`=1) OR (`CreatureID`=38243 AND `ID`=1) OR (`CreatureID`=38245 AND `ID`=1) OR (`CreatureID`=38278 AND `ID`=1) OR (`CreatureID`=38442 AND `ID`=1) OR (`CreatureID`=38217 AND `ID`=1) OR (`CreatureID`=38282 AND `ID`=1) OR (`CreatureID`=38247 AND `ID`=1) OR (`CreatureID`=38037 AND `ID`=1) OR (`CreatureID`=38244 AND `ID`=1) OR (`CreatureID`=39062 AND `ID`=1) OR (`CreatureID`=38272 AND `ID`=1) OR (`CreatureID`=38242 AND `ID`=1) OR (`CreatureID`=38268 AND `ID`=1) OR (`CreatureID`=42619 AND `ID`=1) OR (`CreatureID`=42618 AND `ID`=1) OR (`CreatureID`=38281 AND `ID`=1);
INSERT INTO `creature_equip_template` (`CreatureID`, `ID`, `ItemID1`, `AppearanceModID1`, `ItemVisual1`, `ItemID2`, `AppearanceModID2`, `ItemVisual2`, `ItemID3`, `AppearanceModID3`, `ItemVisual3`) VALUES
(38939, 1, 12183, 0, 0, 0, 0, 0, 0, 0, 0), -- 38939
(38225, 1, 14085, 0, 0, 0, 0, 0, 14118, 0, 0), -- 38225
(38437, 1, 19903, 0, 0, 13319, 0, 0, 0, 0, 0), -- 38437
(38423, 1, 52875, 0, 0, 0, 0, 0, 0, 0, 0), -- 38423
(38301, 1, 32841, 0, 0, 0, 0, 0, 5260, 0, 0), -- 38301
(38326, 1, 9477, 0, 0, 0, 0, 0, 0, 0, 0), -- 38326
(38324, 1, 17123, 0, 0, 12454, 0, 0, 0, 0, 0), -- 38324
(38300, 1, 15910, 0, 0, 0, 0, 0, 0, 0, 0), -- 38300
(38931, 1, 52875, 0, 0, 0, 0, 0, 0, 0, 0), -- 38931
(39028, 1, 28914, 0, 0, 0, 0, 0, 0, 0, 0), -- 39028
(39072, 1, 33493, 0, 0, 0, 0, 0, 0, 0, 0), -- 39072
(38953, 1, 14085, 0, 0, 0, 0, 0, 14118, 0, 0), -- 38953
(38938, 1, 23428, 0, 0, 23428, 0, 0, 0, 0, 0), -- 38938
(39027, 1, 19903, 0, 0, 13319, 0, 0, 0, 0, 0), -- 39027
(38440, 1, 36791, 0, 0, 0, 0, 0, 0, 0, 0), -- 38440
(38966, 1, 14085, 0, 0, 0, 0, 0, 14118, 0, 0), -- 38966
(38246, 1, 9482, 0, 0, 0, 0, 0, 0, 0, 0), -- 38246
(38279, 1, 1907, 0, 0, 0, 0, 0, 0, 0, 0), -- 38279
(38243, 1, 9477, 0, 0, 0, 0, 0, 0, 0, 0), -- 38243
(38245, 1, 18082, 0, 0, 0, 0, 0, 0, 0, 0), -- 38245
(38278, 1, 2813, 0, 0, 0, 0, 0, 0, 0, 0), -- 38278
(38442, 1, 33981, 0, 0, 19915, 0, 0, 0, 0, 0), -- 38442
(38217, 1, 28914, 0, 0, 0, 0, 0, 2507, 0, 0), -- 38217
(38282, 1, 8178, 0, 0, 0, 0, 0, 5260, 0, 0), -- 38282
(38247, 1, 0, 0, 0, 0, 0, 0, 5260, 0, 0), -- 38247
(38037, 1, 12469, 0, 0, 0, 0, 0, 0, 0, 0), -- 38037
(38244, 1, 9467, 0, 0, 9467, 0, 0, 0, 0, 0), -- 38244
(39062, 1, 44218, 0, 0, 0, 0, 0, 0, 0, 0), -- 39062
(38272, 1, 2184, 0, 0, 2184, 0, 0, 0, 0, 0), -- 38272
(38242, 1, 19903, 0, 0, 2040, 0, 0, 0, 0, 0), -- 38242
(38268, 1, 8178, 0, 0, 0, 0, 0, 0, 0, 0), -- 38268
(42619, 1, 1907, 0, 0, 0, 0, 0, 0, 0, 0), -- 42619
(42618, 1, 9482, 0, 0, 0, 0, 0, 0, 0, 0), -- 42618
(38281, 1, 2813, 0, 0, 1961, 0, 0, 0, 0, 0); -- 38281

DELETE FROM `gossip_menu` WHERE (`MenuId`=11126 AND `TextId`=15468) OR (`MenuId`=11107 AND `TextId`=15458) OR (`MenuId`=11020 AND `TextId`=15318) OR (`MenuId`=11137 AND `TextId`=15490) OR (`MenuId`=11131 AND `TextId`=15485) OR (`MenuId`=11139 AND `TextId`=15500) OR (`MenuId`=11130 AND `TextId`=15484) OR (`MenuId`=10972 AND `TextId`=15251);
INSERT INTO `gossip_menu` (`MenuId`, `TextId`) VALUES
(11126, 15468), -- 38966
(11107, 15458), -- 38437
(11020, 15318), -- 38225
(11137, 15490), -- 38442
(11131, 15485), -- 38989
(11139, 15500), -- 38931
(11130, 15484), -- 37987
(10972, 15251); -- 39062

DELETE FROM `gossip_menu_option` WHERE (`MenuId`=11107 AND `OptionIndex`=0) OR (`MenuId`=11020 AND `OptionIndex`=0) OR (`MenuId`=11131 AND `OptionIndex`=0) OR (`MenuId`=10972 AND `OptionIndex`=1);
INSERT INTO `gossip_menu_option` (`MenuId`, `OptionIndex`, `OptionIcon`, `OptionText`, `OptionBroadcastTextId`) VALUES
(11107, 0, 0, 'Ванира, если можешь, отправь меня обратно в крепость Черного Копья.', 0),
(11020, 0, 0, 'Я готов, Вол''джин.', 0),
(11131, 0, 0, 'Да. Не могу ли я одолжить у тебя верхового ящера, который может доставить меня туда?', 0),
(10972, 1, 0, 'Я готов принять вызов.', 0);

DELETE FROM `creature` WHERE `id`=37951;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210116156, 37951, 1, 0, 0, 1, 0, 0, 0, -1, 0, 0, -1172.24, -5262.84, 0.848508, 3.42226, 300, 0, 0, 112, 0, 0, 0, 0, 0, 0, 0, '', 26365);

DELETE FROM `creature` WHERE `id`=38247;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115439, 38247, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1128.12, -5510.07, 12.0599, 0.0174533, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);

DELETE FROM `creature` WHERE `id`=39062;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(251546, 39062, 1, 6453, 4865, 1, 0, 0, 0, -1, 31289, 0, -1143.19, -5429.96, 13.9727, 1.85005, 300, 0, 0, 1110, 0, 0, 0, 0, 0, 0, 0, '', 0),
(251547, 39062, 1, 6453, 4865, 1, 0, 0, 0, -1, 31289, 0, -1159.28, -5530.03, 11.9796, 6.19592, 300, 0, 0, 1110, 0, 0, 0, 0, 0, 0, 0, '', 0);

DELETE FROM `creature` WHERE `id`=38966;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210116142, 38966, 1, 6453, 4866, 1, 0, 0, 0, -1, 0, 0, -1318.08, -5603.77, 23.8027, 0.890118, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);
DELETE FROM `creature_addon` WHERE (`guid`=210115643);
DELETE FROM `creature_addon` WHERE (`guid`=210116142);
DELETE FROM `creature_addon` WHERE (`guid`=210115645);

DELETE FROM `creature` WHERE `id`=39007;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115636, 39007, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1282.2, -5585, 21.0731, 0.837758, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);
UPDATE `creature_template` SET `modelid1` = 15880, `modelid2` = 0 WHERE `entry` = 38003;
DELETE FROM `creature` WHERE `id`=39008;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115634, 39008, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1279.18, -5583.56, 21.0685, 3.1765, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);

DELETE FROM `creature` WHERE `id`=39072;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115794, 39072, 1, 6453, 0, 1, 0, 0, 0, -1, 0, 0, -1356.11, -5155.84, 13.7759, 5.52013, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);

UPDATE `creature_template` SET `gossip_menu_id` = 38988, `npcflag` = 1 WHERE `entry` = 38988;

REPLACE INTO `gossip_menu_option` (`MenuId`, `OptionIndex`, `OptionIcon`, `OptionText`, `OptionBroadcastTextId` ,`OptionType`, `OptionNpcFlag`, `VerifiedBuild`) VALUES('38988','0','0','Leave him..','0','1','1','29416');

SET @ENTRY := 38988;
UPDATE `creature_template` SET `AIName`="SmartAI" WHERE `entry`=@ENTRY;
DELETE FROM `smart_scripts` WHERE `entryorguid`=@ENTRY AND `source_type`=0;
INSERT INTO `smart_scripts` (`entryorguid`,`source_type`,`id`,`link`,`event_type`,`event_phase_mask`,`event_chance`,`event_flags`,`event_param1`,`event_param2`,`event_param3`,`event_param4`,`action_type`,`action_param1`,`action_param2`,`action_param3`,`action_param4`,`action_param5`,`action_param6`,`target_type`,`target_param1`,`target_param2`,`target_param3`,`target_x`,`target_y`,`target_z`,`target_o`,`comment`) VALUES
(@ENTRY,0,0,1,62,0,100,0,38988,0,0,0,33,38002,0,0,0,0,0,7,0,0,0,0,0,0,0,"Orgus - On Gossip - Kill Credit");
DELETE FROM `creature` WHERE `id`=38005;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115491, 38005, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1291.92, -5518.06, 20.8503, 4.76475, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);

DELETE FROM `creature` WHERE `id`=38931;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210115897, 38931, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1327.42, -5557.94, 21.5484, 2.18307, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);
UPDATE `quest_template` SET `RewardSpell` = 59073 WHERE `Id` = 24626;
UPDATE `creature` SET `spawndist` = 0, `MovementType` = 0 WHERE `id` IN (38988);

DELETE FROM `creature` WHERE `id`=37951;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210116159, 37951, 1, 0, 0, 1, 0, 0, 0, -1, 0, 0, -1166.47, -5264.97, 0.826812, 2.80494, 300, 0, 0, 112, 0, 0, 0, 0, 0, 0, 0, '', 0);

DELETE FROM `creature` WHERE `id`=38966;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(210116160, 38966, 1, 0, 0, 1, 0, 0, 0, -1, 0, 1, -1318.37, -5603.65, 23.7197, 0.850076, 300, 0, 0, 2326480, 66290, 0, 0, 0, 0, 0, 0, '', 0);
UPDATE `creature_template` SET `flags_extra`=0 WHERE `entry`=39027; 
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=39027; 
UPDATE `creature` SET `phaseId`=0 WHERE `id`=39027; 
UPDATE `creature_addon` SET `auras`='' WHERE `guid` IN (SELECT `guid` FROM `creature` WHERE `id`=39027);

UPDATE `creature_template` SET `flags_extra`=0 WHERE `entry`=38966; 
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=38966; 
UPDATE `creature` SET `phaseId`=0 WHERE `id`=38966; 
UPDATE `creature_addon` SET `auras`='' WHERE `guid` IN (SELECT `guid` FROM `creature` WHERE `id`=38966);


UPDATE `creature_template` SET `flags_extra`=0 WHERE `entry`=38440; 
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=38440; 
UPDATE `creature` SET `phaseId`=0 WHERE `id`=38440; 
UPDATE `creature_addon` SET `auras`='' WHERE `guid` IN (SELECT `guid` FROM `creature` WHERE `id`=38440);

UPDATE `creature_template` SET `flags_extra`=0 WHERE `entry`=38989; 
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=38989; 
UPDATE `creature` SET `phaseId`=0 WHERE `id`=38989; 
UPDATE `creature_addon` SET `auras`='' WHERE `guid` IN (SELECT `guid` FROM `creature` WHERE `id`=38989);

UPDATE `creature_template` SET `flags_extra`=0 WHERE `entry`=38931; 
UPDATE `creature_template_addon` SET `auras`='' WHERE `entry`=38931; 
UPDATE `creature` SET `phaseId`=0 WHERE `id`=38931; 
UPDATE `creature_addon` SET `auras`='' WHERE `guid` IN (SELECT `guid` FROM `creature` WHERE `id`=38931);

DELETE FROM `creature` WHERE `id`=38989;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(251556, 38989, 1, 6453, 4866, 1, 0, 0, 0, -1, 30939, 0, -1330.82, -5558.85, 21.4903, 0.244346, 300, 0, 0, 102, 0, 0, 0, 0, 0, 0, 0, '', 0),
(210115505, 38989, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1330.82, -5558.85, 21.4903, 0.244346, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);

DELETE FROM `creature` WHERE `id`=38440;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(10591708, 38440, 1, 6453, 4866, 1, 0, 0, 0, -1, 0, 0, -1330.55, -5555.74, 21.4692, 6.20901, 300, 0, 0, 399350, 0, 0, 0, 0, 0, 0, 0, '', 0),
(210115643, 38440, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1313.46, -5609.68, 23.8027, 1.37881, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210116023, 38440, 1, 6453, 4867, 1, 0, 0, 0, -1, 0, 0, -776.399, -5636.85, 14.9651, 2.47837, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);


DELETE FROM `creature` WHERE `id`=38987;
INSERT INTO `creature` (`guid`,`id`,`map`,`zoneId`,`areaId`,`spawnMask`,`phaseUseFlags`,`PhaseId`,`PhaseGroup`,`terrainSwapMap`,`modelid`,`equipment_id`,`position_x`,`position_y`,`position_z`,`orientation`,`spawntimesecs`,`spawndist`,`currentwaypoint`,`curhealth`,`curmana`,`MovementType`,`npcflag`,`unit_flags`,`unit_flags2`,`unit_flags3`,`dynamicflags`,`ScriptName`,`VerifiedBuild`) VALUES
(251555, 38987, 1, 6453, 4866, 1, 0, 0, 0, -1, 14341, 0, -1328.4, -5561.9, 21.3823, 0.122173, 300, 0, 0, 102, 0, 0, 0, 0, 0, 0, 0, '', 0),
(210115389, 38987, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1262.45, -5373.6, 14.859, 3.59538, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115391, 38987, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1256.56, -5372.53, 14.5945, 4.29351, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115467, 38987, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1290.56, -5444.48, 14.5945, 3.4383, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115470, 38987, 1, 6453, 4865, 1, 0, 0, 0, -1, 0, 0, -1295.81, -5439.9, 14.7245, 3.80482, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115509, 38987, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1342.42, -5557.66, 20.9017, 5.89921, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115510, 38987, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1337.81, -5564.8, 20.9891, 0.610865, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365),
(210115512, 38987, 1, 6453, 4875, 1, 0, 0, 0, -1, 0, 0, -1342.34, -5562.29, 20.6657, 0.314159, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 26365);
UPDATE `creature_template` SET `InhabitType` = 3 WHERE `entry` = 38301;
UPDATE `creature_template` SET `modelid1` = 15880, `modelid2` = 0 WHERE `entry` = 38560;
UPDATE `creature_template` SET `modelid1` = 15880, `modelid2` = 0 WHERE `entry` = 38452;
UPDATE `creature_template` SET `InhabitType` = 3 WHERE `entry` = 38306;
UPDATE `creature_template` SET `minlevel` = 5, `maxlevel` = 5, `npcflag` = 0, `unit_flags` = 32832 WHERE `entry` = 38306;