SET NAMES 'utf8';
DELETE FROM `creature_template_locale` WHERE `locale`='ruRU' AND `entry` IN (133934, 133783, 133755, 133754, 133743, 133744, 133741, 133740, 133739, 133704, 133695, 133675, 133672, 133548, 133547, 133546, 133545, 133544, 133543, 133542, 133535, 133534, 133533, 133532, 133523, 133522, 133521, 133520, 133519, 133509, 133497, 133496, 133494, 133467, 133466, 133458, 133452, 133441, 133433, 133431, 133422, 133411, 133409, 133408, 133407, 133396, 133395, 133394, 133388, 133387, 133369, 133367, 133364, 133363, 133362, 133355, 133344, 133342, 133334, 133332, 133326, 133322, 133315, 133314, 133313, 133312, 133311, 133276, 133274, 133271, 133270, 133269, 133267, 133266, 133265, 133263, 133262, 133261, 133254, 133241, 133239, 133236, 133228, 133225, 133224, 133223, 133222, 133221, 133220, 133218, 133209, 133198, 133197, 133196, 133188, 133186, 133185, 133180, 133178, 133177, 133176, 133168, 133164, 133153, 133127, 133114, 133109, 133108, 133106, 133104, 133091, 133090, 133089, 133088, 133087, 133086, 133085, 133084, 133083, 133082, 133081, 133080, 133071, 133066, 133064, 133059, 133056, 133053, 133049, 133048, 133047, 133046, 133045, 133044, 133043, 133042, 133039, 133038, 133022, 133019, 133012, 133011, 132999, 132995, 132972, 132971, 132970, 132969, 132960, 132863, 132800, 132739, 132738, 132730, 132721, 132718, 132705, 132702, 132688, 132684, 132682, 132676, 132675, 132674, 132672, 132671, 132659, 132657, 132648, 132632, 132627, 132623, 132622, 132621, 132620, 132616, 132606, 132594, 132593, 132591, 132584, 132580, 132578, 132537, 132526, 132483, 132467, 132466, 132465, 132464, 132463, 132462, 132460, 132459, 132458, 132457, 132456, 132455, 132435, 132418, 132415, 132407, 132400, 132397, 132387, 132386, 132385, 132382, 132380, 132371, 132366, 132358, 132357, 132353, 132351, 132340, 132334, 132328, 132325, 132323, 132293, 132291, 132290, 132289, 132287, 132281, 132274, 132266, 132262, 132255, 132254, 132225, 132224, 132222, 132221, 132220, 132219, 132218, 132216, 132215, 132214, 132212, 132210, 132208, 132203, 132199, 132192, 132190, 132184, 132183, 132169, 132167, 132164, 132159, 132149, 132148, 132147, 132145, 132144, 132142, 132141, 132140, 132139, 132138, 132129, 132128, 132100, 132099, 132090, 132081, 132064, 132062, 132058, 132055, 132045, 132042, 132040, 132035, 132034, 132033, 132032, 132029, 132027, 132026, 132024, 131971, 131963, 131957, 131953, 131952, 131950, 131947, 131946, 131943, 131942, 131941, 131940, 131933, 131928, 131927, 131923, 131915, 131914, 131909, 131908, 131907, 131906, 131904, 131903, 131897, 131896, 131895, 131893, 131892, 131890, 131889, 131888, 131839, 131838, 131837, 131779, 131776, 131773, 131479, 131478, 131429, 131428, 131427, 131426, 131425, 131424, 131423, 131422, 131421, 131420, 131419, 131418, 131417, 131416, 131415, 131414, 131413, 131401, 131371, 131347, 131345, 131334, 131328, 131326, 131309, 131308, 131203, 131201, 131149, 131076, 131074, 131072, 131069, 131032, 130993, 130986, 130982, 130943, 130937, 130935, 130931, 130926, 130925, 130924, 130923, 130919, 130911, 130907, 130906, 130894, 130893, 130892, 130891, 130890, 130888, 130886, 130885, 130884, 130883, 130882, 130881, 130877, 130862, 130861, 130860, 130859, 130858, 130857, 130856, 130855, 130854, 130853, 130852, 130851, 130828, 130810, 130773, 130758, 130726, 130682, 130677, 130676, 130675, 130654, 130598, 130560, 130559, 130558, 130549, 130547, 130542, 130540, 130537, 130535, 130532, 130511, 130426, 130425, 130423, 130418, 130384, 130383, 130382, 130381, 130275, 130274, 130273, 130272, 130245, 130243, 130241, 130216, 130215, 130213, 130201, 130200, 130193, 130183, 130178, 130151, 130145, 130142, 130139, 130135, 130134, 130133, 130129, 130128, 130080, 130076, 130069, 130063, 130049, 130033, 130032, 130030, 129963, 129955, 129930, 129917, 129915, 129914, 129912, 129862, 129792, 129789, 129770, 129767, 129679, 129659, 129644, 129629, 129468, 129428, 129422, 129356, 129344, 129268, 129263, 129251, 129250, 129248, 129247, 129244, 129141, 129049, 129026, 129024, 129023, 129022, 128980, 128970, 128939, 128915, 128877, 128836, 128818, 128816, 128815, 128814, 128813, 128812, 128767, 128713, 128657, 128656, 128655, 128622, 128612, 128566, 128563, 128562, 128561, 128560, 128558, 128550, 128488, 128487, 128486, 128485, 128484, 128483, 128482, 128481, 128427, 128425, 128424, 128423, 128416, 128415, 128412, 128411, 128133, 128131, 128130, 128125, 128120, 128115, 128099, 128081, 128038, 128036, 128032, 128030, 128028, 127983, 127964, 127924, 127923, 127827, 127785, 127619, 127555, 127521, 127520, 127295, 127071, 127070, 127018, 126972, 126964, 126799, 126789, 126788, 126773, 126646, 126639, 126630, 126604, 126602, 126589, 126559, 126538, 126537, 126536, 126493, 126492, 126491, 126489, 126470, 126370, 126365, 126364, 126354, 126344, 126332, 126328, 126327, 126326, 126324, 126323, 126319, 126321, 126315, 126306, 126305, 126302, 126301, 126231, 126134, 126081, 126078, 126077, 126076, 126068, 126067, 126066, 126065, 126062, 126012, 126011, 126001, 126000, 125999, 125998, 125997, 125951, 125949, 125832, 125829, 125826, 125825, 125778, 125470, 125466, 125463, 125459, 125456, 125454, 125397, 125356, 125287, 125285, 125269, 125253, 125193, 125192, 125181, 125180, 125141, 125136, 124267, 124252, 103976);
INSERT INTO `creature_template_locale` (`entry`, `locale`, `Name`, `NameAlt`, `Title`, `TitleAlt`, `VerifiedBuild`) VALUES
(133934, 'ruRU', 'Навигатор силовых линий', 'Навигатор силовых линий', NULL, NULL, 26365),
(133783, 'ruRU', 'Целительница душ', NULL, NULL, NULL, 26365),
(133755, 'ruRU', 'Стражник Альянса', 'Стражница Альянса', NULL, NULL, 26365),
(133754, 'ruRU', 'Рубака Орды', 'Рубака Орды', NULL, NULL, 26365),
(133743, 'ruRU', 'Кренк Рубирук', NULL, 'Учитель первой помощи', NULL, 26365),
(133744, 'ruRU', 'Пазик Хозавз', NULL, 'Хозяйственные товары', NULL, 26365),
(133741, 'ruRU', 'Ниви Заплетайминс', NULL, 'Учительница портняжного дела', NULL, 26365),
(133740, 'ruRU', 'Гиззик Рудохап', NULL, 'Учитель горного дела', NULL, 26365),
(133739, 'ruRU', 'Карк Шлемоплав', NULL, 'Учитель кузнечного дела', NULL, 26365),
(133704, 'ruRU', 'Чародейка высших эльфов', NULL, NULL, NULL, 26365),
(133695, 'ruRU', 'Марибет', NULL, 'Хозяйка таверны', NULL, 26365),
(133675, 'ruRU', 'Крестьянин-работник', NULL, NULL, NULL, 26365),
(133672, 'ruRU', 'Мастер-чародей', 'Мастерица-чародейка', NULL, NULL, 26365),
(133548, 'ruRU', 'Релакс', NULL, NULL, NULL, 26365),
(133547, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133546, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133545, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133544, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133543, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133542, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133535, 'ruRU', 'Магистр Умбрий', NULL, NULL, NULL, 26365),
(133534, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133533, 'ruRU', 'Сброшенный груз', NULL, NULL, NULL, 26365),
(133532, 'ruRU', 'Сброшенный груз', NULL, NULL, NULL, 26365),
(133523, 'ruRU', 'Цзи Огненная Лапа', NULL, 'Мастер Хоцзинь', NULL, 26365),
(133522, 'ruRU', 'Торговый принц Галливикс', NULL, NULL, NULL, 26365),
(133521, 'ruRU', 'Натанос Гнилостень', NULL, 'Защитник королевы банши', NULL, 26365),
(133520, 'ruRU', 'Верховный воевода Саурфанг', NULL, NULL, NULL, 26365),
(133519, 'ruRU', 'Рокхан', NULL, NULL, NULL, 26365),
(133509, 'ruRU', 'Страж разлома - послушник', 'Страж разлома - послушник', NULL, NULL, 26365),
(133497, 'ruRU', 'Убитый тюремный ружейник', NULL, NULL, NULL, 26365),
(133496, 'ruRU', 'Убитый тюремный стражник', NULL, NULL, NULL, 26365),
(133494, 'ruRU', 'Дюил', NULL, NULL, NULL, 26365),
(133467, 'ruRU', 'Анари Лунарх', NULL, NULL, NULL, 26365),
(133466, 'ruRU', 'Анари Лунарх', NULL, NULL, NULL, 26365),
(133458, 'ruRU', 'Ровир', NULL, NULL, NULL, 26365),
(133452, 'ruRU', 'Аудитор Привратник Рассвета', NULL, NULL, NULL, 26365),
(133441, 'ruRU', 'Опытный копейщик Света', 'Опытная копейщица Света', NULL, NULL, 26365),
(133433, 'ruRU', 'Призрачный клинок - разведчик', 'Призрачный клинок - разведчица', NULL, NULL, 26365),
(133431, 'ruRU', 'Озаренный - солнечный защитник', 'Озаренная - солнечная защитница', NULL, NULL, 26365),
(133422, 'ruRU', 'Шадрин', NULL, 'Наблюдательница', NULL, 26365),
(133411, 'ruRU', 'Далия Небесный Цветок', NULL, 'Учительница кулинарии', NULL, 26365),
(133409, 'ruRU', 'Грифон Альянса', NULL, NULL, NULL, 26365),
(133408, 'ruRU', 'Эшли Янтарный Лист', NULL, 'Смотрительница стойл', NULL, 26365),
(133407, 'ruRU', 'Консул Темнослов', NULL, NULL, NULL, 26365),
(133396, 'ruRU', 'Хандрос Террес', NULL, 'Учитель первой помощи', NULL, 26365),
(133395, 'ruRU', 'Магни Бронзобород', NULL, 'Вестник', NULL, 26365),
(133394, 'ruRU', 'Элестра Осколок Зари', NULL, 'Учительница наложения чар', NULL, 26365),
(133388, 'ruRU', 'Магни Бронзобород', NULL, 'Вестник', NULL, 26365),
(133387, 'ruRU', 'Магни Бронзобород', NULL, 'Вестник', NULL, 26365),
(133369, 'ruRU', 'Друбен Крепкорук', NULL, 'Учитель горного дела', NULL, 26365),
(133367, 'ruRU', 'Виверна Орды', NULL, NULL, NULL, 26365),
(133364, 'ruRU', 'Виверна Орды', NULL, NULL, NULL, 26365),
(133363, 'ruRU', 'Эведос', NULL, 'Учитель портняжного дела', NULL, 26365),
(133362, 'ruRU', 'Консул Мургард', NULL, NULL, NULL, 26365),
(133355, 'ruRU', 'Кало Широкорогий', NULL, NULL, NULL, 26365),
(133344, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(133342, 'ruRU', 'Союзная раса', NULL, NULL, NULL, 26365),
(133334, 'ruRU', 'Рохана Огненный Коготь', NULL, 'Укротительница ветрокрылов', NULL, 26365),
(133332, 'ruRU', 'Статикс Быстропал', NULL, 'Инженерные материалы', NULL, 26365),
(133326, 'ruRU', 'Механолог Фаруд', NULL, 'Учитель инженерного дела', NULL, 26365),
(133322, 'ruRU', 'Эля', NULL, 'Учительница кузнечного дела', NULL, 26365),
(133315, 'ruRU', 'Разоритель с боевого корабля', 'Разорительница с боевого корабля', NULL, NULL, 26365),
(133314, 'ruRU', 'Батрак', NULL, NULL, NULL, 26365),
(133313, 'ruRU', 'Страж боевого корабля', 'Страж боевого корабля', NULL, NULL, 26365),
(133312, 'ruRU', 'Заступник Цитадели Ночи', NULL, NULL, NULL, 26365),
(133311, 'ruRU', 'Инженер боевого корабля', 'Инженер боевого корабля', NULL, NULL, 26365),
(133276, 'ruRU', 'Ощетиненная зубатка', NULL, NULL, NULL, 26365),
(133274, 'ruRU', 'Грифон Альянса', NULL, NULL, NULL, 26365),
(133271, 'ruRU', 'Землепроходец Крутогорья', 'Землепроходец Крутогорья', NULL, NULL, 26365),
(133270, 'ruRU', 'Джала Железный Рог', NULL, NULL, NULL, 26365),
(133269, 'ruRU', 'Верховная жрица Ишана', NULL, 'Хозяйка таверны', NULL, 26365),
(133267, 'ruRU', 'Байрон Холунго', NULL, NULL, NULL, 26365),
(133266, 'ruRU', 'Байрон Холунго', NULL, NULL, NULL, 26365),
(133265, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(133263, 'ruRU', 'Ронорму', NULL, NULL, NULL, 26365),
(133262, 'ruRU', 'Грифон Альянса', NULL, NULL, NULL, 26365),
(133261, 'ruRU', 'Фэн Су', NULL, 'Учитель кулинарии', NULL, 26365),
(133254, 'ruRU', 'Кейли Бенсон', NULL, 'Укротительница грифонов', NULL, 26365),
(133241, 'ruRU', 'Банот', NULL, NULL, NULL, 26365),
(133239, 'ruRU', 'Ткачиха-чародейка Ауриэль', NULL, NULL, NULL, 26365),
(133236, 'ruRU', 'Лейла Камнелом', NULL, NULL, NULL, 26365),
(133228, 'ruRU', 'Рыболов Оперенная Леска', NULL, NULL, NULL, 26365),
(133225, 'ruRU', 'Лягушка', NULL, NULL, NULL, 26365),
(133224, 'ruRU', 'Жук', NULL, NULL, NULL, 26365),
(133223, 'ruRU', 'Аспид', NULL, NULL, NULL, 26365),
(133222, 'ruRU', 'Паук', NULL, NULL, NULL, 26365),
(133221, 'ruRU', 'Стремительный мягкопанцирник', NULL, NULL, NULL, 26365),
(133220, 'ruRU', 'Гоблинский воздушный шар', NULL, NULL, NULL, 26365),
(133218, 'ruRU', 'Храбрец Крутогорья', 'Храбрец Крутогорья', NULL, NULL, 26365),
(133209, 'ruRU', 'Энергичный путешественник', 'Энергичная путешественница', NULL, NULL, 26365),
(133198, 'ruRU', 'Шадрин', NULL, 'Наблюдатель', NULL, 26365),
(133197, 'ruRU', 'Мойра Тауриссан', NULL, NULL, NULL, 26365),
(133196, 'ruRU', 'Исказитель пространства Сле\'шал', NULL, 'Обмен жетонов', NULL, 26365),
(133188, 'ruRU', 'Морпех Небесной стражи', 'Морпех Небесной стражи', NULL, NULL, 26365),
(133186, 'ruRU', 'Навигатор силовых линий', 'Навигатор силовых линий', NULL, NULL, 26365),
(133185, 'ruRU', 'Ночнорожденный-путешественник', 'Ночнорожденная-путешественница', NULL, NULL, 26365),
(133180, 'ruRU', 'Матрос Небесной стражи', 'Матрос Небесной стражи', NULL, NULL, 26365),
(133178, 'ruRU', 'Рыцарь-капитан Понорофф', NULL, NULL, NULL, 26365),
(133177, 'ruRU', 'Маг-защитник Небесной стражи', 'Маг-защитница Небесной стражи', NULL, NULL, 26365),
(133176, 'ruRU', 'Инженер Небесной стражи', 'Инженер Небесной стражи', NULL, NULL, 26365),
(133168, 'ruRU', 'Оргриммарский костолом', NULL, NULL, NULL, 26365),
(133164, 'ruRU', 'Нелли Песнь Красоты', NULL, 'Рубашки и гербовые накидки', NULL, 26365),
(133153, 'ruRU', 'Большой орел', NULL, NULL, NULL, 26365),
(133127, 'ruRU', 'Талуриэль', NULL, NULL, NULL, 26365),
(133114, 'ruRU', 'Урос Крепкое Копыто', NULL, NULL, NULL, 26365),
(133109, 'ruRU', 'Лекарь Джессара', NULL, NULL, NULL, 26365),
(133108, 'ruRU', 'Хёрн Дрожащий Утес', NULL, NULL, NULL, 26365),
(133106, 'ruRU', 'Аресса', NULL, NULL, NULL, 26365),
(133104, 'ruRU', 'Культиватор рощи Кадос', NULL, 'Травник', NULL, 26365),
(133091, 'ruRU', 'Эйтригг', NULL, NULL, NULL, 26365),
(133090, 'ruRU', 'Ритцун Хмурый Огонь', NULL, NULL, NULL, 26365),
(133089, 'ruRU', 'Регар Ярость Земли', NULL, NULL, NULL, 26365),
(133088, 'ruRU', 'Валира Сангвинар', NULL, NULL, NULL, 26365),
(133087, 'ruRU', 'Верховная жрица Ишана', NULL, NULL, NULL, 26365),
(133086, 'ruRU', 'Леди Лиадрин', NULL, NULL, NULL, 26365),
(133085, 'ruRU', 'Железный Поньшу', NULL, NULL, NULL, 26365),
(133084, 'ruRU', 'Верховный маг Варгот', NULL, NULL, NULL, 26365),
(133083, 'ruRU', 'Халдарон Светлое Крыло', NULL, NULL, NULL, 26365),
(133082, 'ruRU', 'Ренсар Большое Копыто', NULL, NULL, NULL, 26365),
(133081, 'ruRU', 'Кор\'вас Кровавый Шип', NULL, NULL, NULL, 26365),
(133080, 'ruRU', 'Верховный лорд Дарион Могрейн', NULL, NULL, NULL, 26365),
(133071, 'ruRU', 'Раненый воздаятель', 'Раненый воздаятель', NULL, NULL, 26365),
(133066, 'ruRU', 'Связка динамита', NULL, NULL, NULL, 26365),
(133064, 'ruRU', 'Мини-танк силитидов', NULL, NULL, NULL, 26365),
(133059, 'ruRU', 'Генерал Харрис', NULL, NULL, NULL, 26365),
(133056, 'ruRU', 'Зандер Зильберман', NULL, 'Полевой алхимик', NULL, 26365),
(133053, 'ruRU', 'Письмо', NULL, NULL, NULL, 26365),
(133049, 'ruRU', 'Страж боевого корабля', 'Страж боевого корабля', NULL, NULL, 26365),
(133048, 'ruRU', 'Тевс Ржавомолот', NULL, 'Картель Трюмных Вод', NULL, 26365),
(133047, 'ruRU', 'Батрак', NULL, NULL, NULL, 26365),
(133046, 'ruRU', 'Корабельное орудие Орды', NULL, NULL, NULL, 26365),
(133045, 'ruRU', 'Военный барабанщик', 'Военная барабанщица', NULL, NULL, 26365),
(133044, 'ruRU', 'Главнокомандующий Тремблейд', NULL, 'Капитан Небесной стражи', NULL, 26365),
(133043, 'ruRU', 'Верховный полководец Волрат', NULL, 'Капитан боевого корабля', NULL, 26365),
(133042, 'ruRU', 'Офицер воздушных войск Габриэль', NULL, NULL, NULL, 26365),
(133039, 'ruRU', 'Kill Credit Large', NULL, NULL, NULL, 26365),
(133038, 'ruRU', 'Kill Credit Small', NULL, NULL, NULL, 26365),
(133022, 'ruRU', 'Неактивный крошшер', NULL, NULL, NULL, 26365),
(133019, 'ruRU', 'Ленивый геолог', 'Ленивый геолог', NULL, NULL, 26365),
(133012, 'ruRU', 'Магни Бронзобород', NULL, 'Вестник', NULL, 26365),
(133011, 'ruRU', 'Буйная тень', NULL, NULL, NULL, 26365),
(132999, 'ruRU', 'Повелитель Нексуса Ашаал', NULL, NULL, NULL, 26365),
(132995, 'ruRU', 'Лоретта Ройстон', NULL, 'Распорядительница полетов', NULL, 26365),
(132972, 'ruRU', 'Канонир Небесной стражи', NULL, NULL, NULL, 26365),
(132971, 'ruRU', 'Нуль-змей', NULL, NULL, NULL, 26365),
(132970, 'ruRU', 'Свежее порождение Бездны', NULL, NULL, NULL, 26365),
(132969, 'ruRU', 'Кэти Штемпельпупс', NULL, NULL, NULL, 26365),
(132960, 'ruRU', 'Полевой алхимик Броудок', NULL, NULL, NULL, 26365),
(132863, 'ruRU', 'Voidstalker Pen Visual Bunny', NULL, NULL, NULL, 26365),
(132800, 'ruRU', 'Маввит Имбирный Хруст', NULL, 'Лига исследователей', NULL, 26365),
(132739, 'ruRU', 'Физзель Имбирный Хруст', NULL, 'Лига исследователей', NULL, 26365),
(132738, 'ruRU', 'Bunny', NULL, NULL, NULL, 26365),
(132730, 'ruRU', 'Voidstorm Visual Bunny', NULL, NULL, NULL, 26365),
(132721, 'ruRU', 'Delivery Boy (PH)', NULL, NULL, NULL, 26365),
(132718, 'ruRU', 'Офицер воздушных войск Дамаркус', NULL, NULL, NULL, 26365),
(132705, 'ruRU', 'Данесса', NULL, 'Ремонт', NULL, 26365),
(132702, 'ruRU', 'Корабельное орудие Альянса', NULL, NULL, NULL, 26365),
(132688, 'ruRU', 'Матрос', 'Матрос', NULL, NULL, 26365),
(132684, 'ruRU', 'Ангус Грозовой Отвар', NULL, NULL, NULL, 26365),
(132682, 'ruRU', 'Тотем целительного прилива', NULL, NULL, NULL, 26365),
(132676, 'ruRU', 'Прыгуана Бездны', NULL, 'Питомец темного следопыта', 'Питомец темного следопыта', 26365),
(132675, 'ruRU', 'Громовой плоскохвост', NULL, NULL, NULL, 26365),
(132674, 'ruRU', 'Бурый медведь', NULL, NULL, NULL, 26365),
(132672, 'ruRU', 'Большой орел', NULL, NULL, NULL, 26365),
(132671, 'ruRU', 'Высший эльф - искатель', 'Высшая эльфийка - искательница', NULL, NULL, 26365),
(132659, 'ruRU', 'Клинок Бездны', 'Клинок Бездны', NULL, NULL, 26365),
(132657, 'ruRU', 'Атинар', NULL, 'Хозяин таверны', NULL, 26365),
(132648, 'ruRU', 'Клинок Бездны', 'Клинок Бездны', NULL, NULL, 26365),
(132632, 'ruRU', 'Инструктор Сумеречный Странник', NULL, NULL, NULL, 26365),
(132627, 'ruRU', 'Эльф Бездны - послушник', 'Эльфийка Бездны - послушница', NULL, NULL, 26365),
(132623, 'ruRU', 'Манапард ночнорожденных', NULL, NULL, NULL, 26365),
(132622, 'ruRU', 'Звездный крылобег Бездны', NULL, NULL, NULL, 26365),
(132621, 'ruRU', 'Сквернодав озаренных', NULL, NULL, NULL, 26365),
(132620, 'ruRU', 'Громокопыт Крутогорья', NULL, NULL, NULL, 26365),
(132616, 'ruRU', 'Исследователь из Луносвета', 'Исследовательница из Луносвета', NULL, NULL, 26365),
(132606, 'ruRU', 'Тамми Шестевертка', NULL, 'Исследовательница силитидов', NULL, 26365),
(132594, 'ruRU', 'Экзоскелет озаренных', NULL, NULL, NULL, 26365),
(132593, 'ruRU', 'Рало\'шал Вечная Стражница', NULL, NULL, NULL, 26365),
(132591, 'ruRU', 'Огмот Безумный', NULL, 'Сумеречный Молот', NULL, 26365),
(132584, 'ruRU', 'Ксааршедж', NULL, NULL, NULL, 26365),
(132580, 'ruRU', 'Ссинкрикс', NULL, NULL, NULL, 26365),
(132578, 'ruRU', 'Крошекс', NULL, NULL, NULL, 26365),
(132537, 'ruRU', 'Ууна', NULL, NULL, NULL, 26365),
(132526, 'ruRU', 'Стервятник-шкуродер', NULL, NULL, NULL, 26365),
(132483, 'ruRU', 'Поговорите с Магни Бронзобородом', NULL, NULL, NULL, 26365),
(132467, 'ruRU', 'Предсказатель Нобундо', NULL, 'Служители Земли', NULL, 26365),
(132466, 'ruRU', 'Ренсар Большое Копыто', NULL, 'Верховный друид рощи', NULL, 26365),
(132465, 'ruRU', 'Верховный лорд Дарион Могрейн', NULL, NULL, NULL, 26365),
(132464, 'ruRU', 'Лорд Джорах Черный Ворон', NULL, NULL, NULL, 26365),
(132463, 'ruRU', 'Мерил Буря Скверны', NULL, NULL, NULL, 26365),
(132462, 'ruRU', 'Хави', NULL, NULL, NULL, 26365),
(132460, 'ruRU', 'Кор\'вас Кровавый Шип', NULL, 'Иллидари', NULL, 26365),
(132459, 'ruRU', 'Железный Поньшу', NULL, 'Старший мастер школы Быка', NULL, 26365),
(132458, 'ruRU', 'Ритцун Хмурый Огонь', NULL, NULL, NULL, 26365),
(132457, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(132456, 'ruRU', 'Эммарель Стражница Тени', NULL, 'Незримый путь', NULL, 26365),
(132455, 'ruRU', 'Алонсий Фаол', NULL, 'Епископ Тайн', NULL, 26365),
(132435, 'ruRU', 'Highmountain Protector (IGC)', 'Highmountain Protector (IGC)', NULL, NULL, 26365),
(132418, 'ruRU', 'Injured Warbrave (IGC)', 'Injured Warbrave (IGC)', NULL, NULL, 26365),
(132415, 'ruRU', 'Rivermane Shaman (IGC)', NULL, NULL, NULL, 26365),
(132407, 'ruRU', 'Темный следопыт', 'Темная следопытка', NULL, NULL, 26365),
(132400, 'ruRU', 'Любопытный охотник Бездны', NULL, NULL, NULL, 26365),
(132397, 'ruRU', 'Void Suppression Visual Bunny', NULL, NULL, NULL, 26365),
(132387, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(132386, 'ruRU', 'Страж разлома', 'Стражница разлома', NULL, NULL, 26365),
(132385, 'ruRU', 'Исследователь Бездны', 'Исследовательница Бездны', NULL, NULL, 26365),
(132382, 'ruRU', 'Магистр Умбрий', NULL, NULL, NULL, 26365),
(132380, 'ruRU', 'Майла Крутогор', NULL, 'Верховный вождь', NULL, 26365),
(132371, 'ruRU', 'Обычный ловец', NULL, NULL, NULL, 26365),
(132366, 'ruRU', 'Почтоменталь', NULL, NULL, NULL, 26365),
(132358, 'ruRU', 'Энстраа', NULL, 'Кожевничество (мастер)', NULL, 26365),
(132357, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(132353, 'ruRU', 'Магистр Умбрий', NULL, NULL, NULL, 26365),
(132351, 'ruRU', 'Панель управления', NULL, NULL, NULL, 26365),
(132340, 'ruRU', 'Уничтожьте гоблинское оборудование', NULL, NULL, NULL, 26365),
(132334, 'ruRU', 'Верховный механолог Ромуул', NULL, NULL, NULL, 26365),
(132328, 'ruRU', 'Солдат Армии Света', 'Солдат Армии Света', NULL, NULL, 26365),
(132325, 'ruRU', 'Ярус', NULL, 'Ювелирное дело (ученик)', NULL, 26365),
(132323, 'ruRU', 'Ялия', NULL, 'Поставщица', NULL, 26365),
(132293, 'ruRU', 'Настырная белка', NULL, NULL, NULL, 26365),
(132291, 'ruRU', 'Дренейский смотритель', 'Дренейская смотрительница', NULL, NULL, 26365),
(132290, 'ruRU', 'Поговорите с Натаносом Гнилостенем', NULL, NULL, NULL, 26365),
(132289, 'ruRU', 'Дренейский ребенок', NULL, NULL, NULL, 26365),
(132287, 'ruRU', 'Пожиратель душ', NULL, NULL, NULL, 26365),
(132281, 'ruRU', 'Ууна', NULL, NULL, NULL, 26365),
(132274, 'ruRU', 'Поговорите с Матиасом Шоу', NULL, NULL, NULL, 26365),
(132266, 'ruRU', 'Озаренная-защитница', NULL, NULL, NULL, 26365),
(132262, 'ruRU', 'Озаренный-защитник', NULL, NULL, NULL, 26365),
(132255, 'ruRU', 'Мастер Матиас Шоу', NULL, 'Глава ШРУ', NULL, 26365),
(132254, 'ruRU', 'Натанос Гнилостень', NULL, 'Защитник королевы банши', NULL, 26365),
(132225, 'ruRU', 'Озаренный-механолог', 'Озаренный-механолог', NULL, NULL, 26365),
(132224, 'ruRU', 'Дюраэль', NULL, 'Ремонт', NULL, 26365),
(132222, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132221, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132220, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132219, 'ruRU', 'Highmountain Protector KILL CREDIT', 'Highmountain Protector KILL CREDIT', NULL, NULL, 26365),
(132218, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132216, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132215, 'ruRU', 'Озаренный-воздаятель', 'Озаренная-воздаятельница', NULL, NULL, 26365),
(132214, 'ruRU', 'Озаренный анахорет', 'Озаренная анахоретка', NULL, NULL, 26365),
(132212, 'ruRU', 'Заступник Крутогорья', 'Заступница Крутогорья', NULL, NULL, 26365),
(132210, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(132208, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(132203, 'ruRU', 'Мишиэль Скиталец Бездны', NULL, 'Сумеречный властитель', NULL, 26365),
(132199, 'ruRU', 'Сумеречный землелом', NULL, 'Сумеречный Молот', NULL, 26365),
(132192, 'ruRU', 'Харг Каменная Мантия', NULL, 'Минералог', NULL, 26365),
(132190, 'ruRU', 'Рабочий Альянса', 'Работница Альянса', NULL, NULL, 26365),
(132184, 'ruRU', 'Работник виноградников', NULL, NULL, NULL, 26365),
(132183, 'ruRU', 'Служитель винокурни', 'Служительница винокурни', NULL, NULL, 26365);

INSERT INTO `creature_template_locale` (`entry`, `locale`, `Name`, `NameAlt`, `Title`, `TitleAlt`, `VerifiedBuild`) VALUES
(132169, 'ruRU', 'Преданный служитель Цитадели Ночи', 'Преданная служительница Цитадели Ночи', NULL, NULL, 26365),
(132167, 'ruRU', 'REUSe', NULL, NULL, NULL, 26365),
(132164, 'ruRU', 'Крошшер картеля Трюмных Вод', NULL, NULL, NULL, 26365),
(132159, 'ruRU', 'T.B. Bret', NULL, NULL, NULL, 26365),
(132149, 'ruRU', 'Ночнорожденный-ученик', NULL, NULL, NULL, 26365),
(132148, 'ruRU', 'Ночнорожденная-ученица', NULL, NULL, NULL, 26365),
(132147, 'ruRU', 'Грол Боевой Клинок', NULL, 'Ордынский командир', NULL, 26365),
(132145, 'ruRU', 'Юный Су', NULL, NULL, NULL, 26365),
(132144, 'ruRU', 'Цзи-Сунь', NULL, NULL, NULL, 26365),
(132142, 'ruRU', 'Механик картеля Трюмных Вод', NULL, NULL, NULL, 26365),
(132141, 'ruRU', 'Рабочий картеля Трюмных Вод', 'Рабочий картеля Трюмных Вод', NULL, NULL, 26365),
(132140, 'ruRU', 'Урок Разрубатель Ветра', NULL, 'Распорядитель полетов', NULL, 26365),
(132139, 'ruRU', 'Хаграс Пожиратель Войны', NULL, 'Кузнец', NULL, 26365),
(132138, 'ruRU', 'Гала Яростный Топор', NULL, 'Мясник', NULL, 26365),
(132129, 'ruRU', 'Путешественник ночнорожденных', 'Путешественница ночнорожденных', NULL, NULL, 26365),
(132128, 'ruRU', 'Путешественник ночнорожденных', 'Путешественница ночнорожденных', NULL, NULL, 26365),
(132100, 'ruRU', 'Щупальце Уула', NULL, NULL, NULL, 26365),
(132099, 'ruRU', 'Частица Уула', NULL, NULL, NULL, 26365),
(132090, 'ruRU', 'Тень Мрака', NULL, NULL, NULL, 26365),
(132081, 'ruRU', 'Сильверин', NULL, 'Винодел', NULL, 26365),
(132064, 'ruRU', 'Рубака Орды', 'Рубака Орды', NULL, NULL, 26365),
(132062, 'ruRU', 'Работник картеля Трюмных Вод', NULL, NULL, NULL, 26365),
(132058, 'ruRU', 'Штейгер Золотык', NULL, NULL, NULL, 26365),
(132055, 'ruRU', 'Геолог картеля Трюмных Вод', 'Геолог картеля Трюмных Вод', NULL, NULL, 26365),
(132045, 'ruRU', 'Гизмакс Жирострел', NULL, 'Картель Трюмных Вод', NULL, 26365),
(132042, 'ruRU', 'Вышибала картеля Трюмных Вод', NULL, NULL, NULL, 26365),
(132040, 'ruRU', 'Пиксни Ржавобамс', NULL, 'Исследовательница силитидов', NULL, 26365),
(132035, 'ruRU', 'Странник дола Фародин', NULL, NULL, NULL, 26365),
(132034, 'ruRU', 'Виктория', NULL, 'Первый клинок Сумеречной стражи', NULL, 26365),
(132033, 'ruRU', 'Терин', NULL, NULL, NULL, 26365),
(132032, 'ruRU', 'Ли\'лет Лунарх', NULL, NULL, NULL, 26365),
(132029, 'ruRU', 'Силгрин', NULL, NULL, NULL, 26365),
(132027, 'ruRU', 'Чародейка Вальтруа', NULL, NULL, NULL, 26365),
(132026, 'ruRU', 'Главный телемант Окулет', NULL, NULL, NULL, 26365),
(132024, 'ruRU', 'Арлуэль', NULL, NULL, NULL, 26365),
(131971, 'ruRU', 'Зверолов из племени Кровавого Тотема', 'Зверолов из племени Кровавого Тотема', NULL, NULL, 26365),
(131963, 'ruRU', 'Нолан Быстрый', NULL, 'Офицер ШРУ', NULL, 26365),
(131957, 'ruRU', 'Агент ШРУ', 'Агент ШРУ', NULL, NULL, 26365),
(131953, 'ruRU', 'Выживший из племени Кровавого Тотема', 'Выжившая из племени Кровавого Тотема', NULL, NULL, 26365),
(131952, 'ruRU', 'Эдмунд Хакни', NULL, 'Кузнец', NULL, 26365),
(131950, 'ruRU', 'Гвенла Скалобой', NULL, 'Ремонт', NULL, 26365),
(131947, 'ruRU', 'Клиффорд Бентам', NULL, 'Поставщик', NULL, 26365),
(131946, 'ruRU', 'Стражник Альянса', 'Стражница Альянса', NULL, NULL, 26365),
(131943, 'ruRU', 'Верховный лорд Демитриан', NULL, NULL, NULL, 26365),
(131942, 'ruRU', 'Франкал Каменный Мост', NULL, NULL, NULL, 26365),
(131941, 'ruRU', 'Глибб', NULL, 'Обезьянка Бранна Бронзоборода', NULL, 26365),
(131940, 'ruRU', 'Рутгар Знакописец', NULL, NULL, NULL, 26365),
(131933, 'ruRU', 'Новобранец Крутогорья', NULL, NULL, NULL, 26365),
(131928, 'ruRU', 'Манящий цветок', NULL, NULL, NULL, 26365),
(131927, 'ruRU', 'Новобранец Крутогорья', NULL, NULL, NULL, 26365),
(131923, 'ruRU', 'Фэй Лау', NULL, NULL, NULL, 26365),
(131915, 'ruRU', 'Чэн Лиш', NULL, NULL, NULL, 26365),
(131914, 'ruRU', 'Тау Ли', NULL, NULL, NULL, 26365),
(131909, 'ruRU', 'Крушитель из пустошей', NULL, NULL, NULL, 26365),
(131908, 'ruRU', 'Сумеречный выживший', 'Сумеречная выжившая', 'Сумеречный Молот', NULL, 26365),
(131907, 'ruRU', 'Сумеречный ритуалист', 'Сумеречная ритуалистка', 'Сумеречный Молот', NULL, 26365),
(131906, 'ruRU', 'Развеиватель песка', NULL, NULL, NULL, 26365),
(131904, 'ruRU', 'Шипастая ящерица', NULL, NULL, NULL, 26365),
(131903, 'ruRU', 'Личинка силитида', NULL, NULL, NULL, 26365),
(131897, 'ruRU', 'Камнехвостый клешневик', NULL, NULL, NULL, 26365),
(131896, 'ruRU', 'Скорпид-быстролап', NULL, NULL, NULL, 26365),
(131895, 'ruRU', 'Силитид-огнеполох', NULL, NULL, NULL, 26365),
(131893, 'ruRU', 'Силитид-трутень', NULL, NULL, NULL, 26365),
(131892, 'ruRU', 'Силитид-страж', NULL, NULL, NULL, 26365),
(131890, 'ruRU', 'Скальный паук-скакун', NULL, NULL, NULL, 26365),
(131889, 'ruRU', 'Верховный экзарх Туралион', NULL, NULL, NULL, 26365),
(131888, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(131839, 'ruRU', 'Лайо Звездный Всполох', NULL, 'Круг Кенария', NULL, 26365),
(131838, 'ruRU', 'Джанруд Отважный Странник', NULL, 'Круг Кенария', NULL, 26365),
(131837, 'ruRU', 'Заннок Проткни-Шкуру', NULL, 'Товары для кожевников', NULL, 26365),
(131779, 'ruRU', 'Кровавый страж', 'Кровавый страж', NULL, NULL, 26365),
(131776, 'ruRU', 'Джерон Углепад', NULL, NULL, NULL, 26365),
(131773, 'ruRU', 'Натанос Гнилостень', NULL, 'Защитник королевы банши', NULL, 26365),
(131479, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(131478, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(131429, 'ruRU', 'Темночешуйчатый змей', NULL, NULL, NULL, 26365),
(131428, 'ruRU', 'Шал\'дорай - верховный маг', NULL, NULL, NULL, 26365),
(131427, 'ruRU', 'Шал\'дорай-натуралист', NULL, NULL, NULL, 26365),
(131426, 'ruRU', 'Мерцающий манаспин', NULL, NULL, NULL, 26365),
(131425, 'ruRU', 'Садовник с Террасы шал\'дорай', 'Садовник с Террасы шал\'дорай', NULL, NULL, 26365),
(131424, 'ruRU', 'Дрессированный темночешуйчатый змей', NULL, NULL, NULL, 26365),
(131423, 'ruRU', 'Призрак времени', NULL, NULL, NULL, 26365),
(131422, 'ruRU', 'Прирученный манапард', NULL, NULL, NULL, 26365),
(131421, 'ruRU', 'Боевой маг из Сумеречной стражи', 'Боевой маг из Сумеречной стражи', NULL, NULL, 26365),
(131420, 'ruRU', 'Наблюдатель из Сумеречной стражи', 'Наблюдательница из Сумеречной стражи', NULL, NULL, 26365),
(131419, 'ruRU', 'Охранник из Сумеречной стражи', NULL, NULL, NULL, 26365),
(131418, 'ruRU', 'Заклинатель из Сумеречной стражи', 'Заклинатель из Сумеречной стражи', NULL, NULL, 26365),
(131417, 'ruRU', 'Ночнорожденный-мудрец', 'Ночнорожденный-мудрец', NULL, NULL, 26365),
(131416, 'ruRU', 'Житель Цитадели Ночи', 'Житель Цитадели Ночи', NULL, NULL, 26365),
(131415, 'ruRU', 'Заступник Цитадели Ночи', NULL, NULL, NULL, 26365),
(131414, 'ruRU', 'Аристократ-исказитель', 'Аристократ-исказитель', NULL, NULL, 26365),
(131413, 'ruRU', 'Страж променада', 'Страж променада', NULL, NULL, 26365),
(131401, 'ruRU', 'Натанос Гнилостень', NULL, 'Защитник королевы банши', NULL, 26365),
(131371, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(131347, 'ruRU', 'Кейра Ониксовая Ворона', NULL, 'Эмиссар эльфов Бездны', NULL, 26365),
(131345, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(131334, 'ruRU', 'Воздаятель Минки', NULL, 'Эмиссар озаренных', NULL, 26365),
(131328, 'ruRU', 'Мелитье Валуран', NULL, 'Эмиссар ночнорожденных', NULL, 26365),
(131326, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(131309, 'ruRU', 'Силгрин', NULL, NULL, NULL, 26365),
(131308, 'ruRU', 'Чародейка Вальтруа', NULL, NULL, NULL, 26365),
(131203, 'ruRU', 'Халиан Хлавахок', NULL, NULL, NULL, 26365),
(131201, 'ruRU', 'Халиан Хлавахок', NULL, 'Эмиссар племен Крутогорья', NULL, 26365),
(131149, 'ruRU', 'Ветролет', NULL, NULL, NULL, 26365),
(131076, 'ruRU', 'Большой орел', NULL, NULL, NULL, 26365),
(131074, 'ruRU', 'Талбук озаренных', NULL, NULL, NULL, 26365),
(131072, 'ruRU', 'Прыгуана Бездны', NULL, NULL, NULL, 26365),
(131069, 'ruRU', 'Манапард', NULL, NULL, NULL, 26365),
(131032, 'ruRU', 'Cata/MoP Choice Credit', NULL, NULL, NULL, 26365),
(130993, 'ruRU', 'Капитан Фария', NULL, 'Клинок полумесяца', NULL, 26365),
(130986, 'ruRU', 'Дозорный Кворам', NULL, 'Страж врат', NULL, 26365),
(130982, 'ruRU', 'BC/LK Choice Credit', NULL, NULL, NULL, 26365),
(130943, 'ruRU', 'Древняя пантара-призрак', NULL, NULL, NULL, 26365),
(130937, 'ruRU', 'Тенескат-альбинос', NULL, NULL, NULL, 26365),
(130935, 'ruRU', 'Неуловимый панцирный талбук', NULL, NULL, NULL, 26365),
(130931, 'ruRU', 'Painmaster Thundrak Slain Kill Credit', NULL, NULL, NULL, 26365),
(130926, 'ruRU', 'Тотем воздуха Крутогорья', NULL, NULL, NULL, 26365),
(130925, 'ruRU', 'Тотем земли Крутогорья', NULL, NULL, NULL, 26365),
(130924, 'ruRU', 'Тотем огня Крутогорья', NULL, NULL, NULL, 26365),
(130923, 'ruRU', 'Тотем воды Крутогорья', NULL, NULL, NULL, 26365),
(130919, 'ruRU', 'Высший эльф - следопыт', NULL, NULL, NULL, 26365),
(130911, 'ruRU', 'Чарльз Гастли', NULL, 'Товары из Подгорода', NULL, 26365),
(130907, 'ruRU', 'Яйцо', NULL, NULL, NULL, 26365),
(130906, 'ruRU', 'Go to the Ghostlands Kill Credit', NULL, NULL, NULL, 26365),
(130894, 'ruRU', 'NPC - Nightborne Elf Male Noble', NULL, NULL, NULL, 26365),
(130893, 'ruRU', 'NPC - Nightborne Elf Male Military', NULL, NULL, NULL, 26365),
(130892, 'ruRU', 'NPC - Nightborne Elf Male Civilian', NULL, NULL, NULL, 26365),
(130891, 'ruRU', 'NPC - Nightborne Elf Female Noble', NULL, NULL, NULL, 26365),
(130890, 'ruRU', 'NPC - Nightborne Elf Female Military', NULL, NULL, NULL, 26365),
(130888, 'ruRU', 'NPC - Nightborne Elf Female Civilian', NULL, NULL, NULL, 26365),
(130886, 'ruRU', 'NPC - Void Elf Female Noble (Leader)', NULL, NULL, NULL, 26365),
(130885, 'ruRU', 'NPC - Void Elf Female Military (Melee/Guard)', NULL, NULL, NULL, 26365),
(130884, 'ruRU', 'NPC - Void Elf Female Civilian (Caster)', NULL, NULL, NULL, 26365),
(130883, 'ruRU', 'NPC - Void Elf Male Noble (Leader)', NULL, NULL, NULL, 26365),
(130882, 'ruRU', 'NPC - Void Elf Male Military (Melee/Guard)', NULL, NULL, NULL, 26365),
(130881, 'ruRU', 'NPC - Void Elf Male Civilian (Caster)', NULL, NULL, NULL, 26365),
(130877, 'ruRU', 'Разлом в Телогрус', NULL, NULL, NULL, 26365),
(130862, 'ruRU', 'NPC - Lightforged Draenei Male Noble (Commander)', NULL, NULL, NULL, 26365),
(130861, 'ruRU', 'NPC - Lightforged Draenei Male Military (Officer)', NULL, NULL, NULL, 26365),
(130860, 'ruRU', 'NPC - Lightforged Draenei Male Civilian (Grunt)', NULL, NULL, NULL, 26365),
(130859, 'ruRU', 'NPC - Lightforged Draenei Female Noble (Commander)', NULL, NULL, NULL, 26365),
(130858, 'ruRU', 'NPC - Lightforged Draenei Female Military (Officer)', NULL, NULL, NULL, 26365),
(130857, 'ruRU', 'NPC - Lightforged Draenei Female Civilian (Grunt)', NULL, NULL, NULL, 26365),
(130856, 'ruRU', 'NPC - Highmountain Tauren Male Noble', NULL, NULL, NULL, 26365),
(130855, 'ruRU', 'NPC - Highmountain Tauren Male Military', NULL, NULL, NULL, 26365),
(130854, 'ruRU', 'NPC - Highmountain Tauren Male Civilian', NULL, NULL, NULL, 26365),
(130853, 'ruRU', 'NPC - Highmountain Tauren Female Military', NULL, NULL, NULL, 26365),
(130852, 'ruRU', 'NPC - Highmountain Tauren Female Noble', NULL, NULL, NULL, 26365),
(130851, 'ruRU', 'NPC - Highmountain Tauren Female Civilian', NULL, NULL, NULL, 26365),
(130828, 'ruRU', 'Гордон Маккелар', NULL, 'Помощник управляющего пушкой конфетти', NULL, 26365),
(130810, 'ruRU', 'Верховный экзарх Туралион', NULL, NULL, NULL, 26365),
(130773, 'ruRU', 'Отважный страж', NULL, NULL, NULL, 26365),
(130758, 'ruRU', 'Маяк озаренных', NULL, NULL, NULL, 26365),
(130726, 'ruRU', 'Ки\'тилек', NULL, 'Глашатай Уул\'гинета', NULL, 26365),
(130682, 'ruRU', 'Рилая Бушующая Волна', NULL, NULL, NULL, 26365),
(130677, 'ruRU', 'Рубака боевого корабля', 'Рубака боевого корабля', NULL, NULL, 26365),
(130676, 'ruRU', 'Гримнир Суровый Молот', NULL, 'Лига исследователей', NULL, 26365),
(130675, 'ruRU', 'Мизирин Пивохлеб', NULL, 'Лига исследователей', NULL, 26365),
(130654, 'ruRU', 'Ворму', NULL, 'Путешествия во времени', NULL, 26365),
(130598, 'ruRU', 'Хрустальный матриарх', NULL, NULL, NULL, 26365),
(130560, 'ruRU', 'Марас', NULL, NULL, NULL, 26365),
(130559, 'ruRU', 'Воздаятельница Джаэлаана', NULL, NULL, NULL, 26365),
(130558, 'ruRU', 'Адъютант Ворт', NULL, NULL, NULL, 26365),
(130549, 'ruRU', 'Капитан Фария', NULL, 'Клинок полумесяца', NULL, 26365),
(130547, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(130542, 'ruRU', 'Матрос', 'Матрос', NULL, NULL, 26365),
(130540, 'ruRU', 'Морпех Небесной стражи', 'Морпех Небесной стражи', NULL, NULL, 26365),
(130537, 'ruRU', 'Сержант Блэквелл', NULL, NULL, NULL, 26365),
(130535, 'ruRU', 'Сержант Шмидт', NULL, NULL, NULL, 26365),
(130532, 'ruRU', 'Мастер Матиас Шоу', NULL, 'Глава ШРУ', NULL, 26365),
(130511, 'ruRU', 'Маяк озаренных', NULL, NULL, NULL, 26365),
(130426, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(130425, 'ruRU', 'Темное щупальце', NULL, NULL, NULL, 26365),
(130423, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(130418, 'ruRU', 'Теневое щупальце', NULL, NULL, NULL, 26365),
(130384, 'ruRU', 'Присягнувший Свету новобранец', 'Присягнувший Свету новобранец', NULL, NULL, 26365),
(130383, 'ruRU', 'Присягнувший Свету новобранец', 'Присягнувший Свету новобранец', NULL, NULL, 26365),
(130382, 'ruRU', 'Присягнувший Свету новобранец', 'Присягнувший Свету новобранец', NULL, NULL, 26365),
(130381, 'ruRU', 'Присягнувший Свету новобранец', 'Присягнувший Свету новобранец', NULL, NULL, 26365),
(130275, 'ruRU', 'Сестра Келебраса', NULL, NULL, NULL, 26365),
(130274, 'ruRU', 'Ползучий слякоч', NULL, NULL, NULL, 26365),
(130273, 'ruRU', 'Селебрийская дриада', NULL, NULL, NULL, 26365),
(130272, 'ruRU', 'Удушающая лоза', NULL, NULL, NULL, 26365),
(130245, 'ruRU', 'Зандаларский берсерк', NULL, NULL, NULL, 26365),
(130243, 'ruRU', 'Зандаларский иерофант', NULL, NULL, NULL, 26365),
(130241, 'ruRU', 'Зандаларский архонт', NULL, NULL, NULL, 26365),
(130216, 'ruRU', 'Магни Бронзобород', NULL, 'Вестник', NULL, 26365),
(130215, 'ruRU', 'Магни Бронзобород', NULL, NULL, NULL, 26365),
(130213, 'ruRU', 'Мегз Жестекрошшер', NULL, 'Картель Трюмных Вод', NULL, 26365),
(130201, 'ruRU', 'Силгрин', NULL, NULL, NULL, 26365),
(130200, 'ruRU', 'Чародейка Вальтруа', NULL, NULL, NULL, 26365),
(130193, 'ruRU', 'Верховный магистр Роммат', NULL, NULL, NULL, 26365),
(130183, 'ruRU', 'Лор\'темар Терон', NULL, 'Лорд-регент Кель\'Таласа', NULL, 26365),
(130178, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(130151, 'ruRU', 'Принц Пустоты Дурзаан', NULL, NULL, NULL, 26365),
(130145, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(130142, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(130139, 'ruRU', 'Выброс Бездны', NULL, NULL, NULL, 26365),
(130135, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(130134, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(130133, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(130129, 'ruRU', 'Мастер Матиас Шоу', NULL, 'Глава ШРУ', NULL, 26365),
(130128, 'ruRU', 'Верховный магистр Роммат', NULL, NULL, NULL, 26365),
(130080, 'ruRU', 'HolderMcHolderson4', NULL, NULL, NULL, 26365),
(130076, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(130069, 'ruRU', 'Воодушевленный анахорет', 'Воодушевленная анахоретка', NULL, NULL, 26365),
(130063, 'ruRU', 'HolderMcHolderson2', NULL, NULL, NULL, 26365),
(130049, 'ruRU', 'HolderMcHolderson', NULL, NULL, NULL, 26365),
(130033, 'ruRU', 'Верховный маг Кадгар', NULL, NULL, NULL, 26365),
(130032, 'ruRU', 'Верховный маг Кадгар', NULL, NULL, NULL, 26365),
(130030, 'ruRU', 'Келси Стализвон', NULL, 'Секретная служба Гномрегана', NULL, 26365),
(129963, 'ruRU', 'Майла Крутогор', NULL, 'Верховный вождь', NULL, 26365),
(129955, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(129930, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(129917, 'ruRU', 'Верховный друид Хамуул Рунический Тотем', NULL, NULL, NULL, 26365),
(129915, 'ruRU', 'Майла Крутогор', NULL, 'Верховный вождь', NULL, 26365),
(129914, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(129912, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(129862, 'ruRU', 'Капитан Фария', NULL, 'Клинок полумесяца', NULL, 26365),
(129792, 'ruRU', 'Глашатай вождя', NULL, NULL, NULL, 26365),
(129789, 'ruRU', 'Майла Крутогор', NULL, NULL, NULL, 26365),
(129770, 'ruRU', 'Батрак', NULL, NULL, NULL, 26365),
(129767, 'ruRU', 'Магистр Умбрий', NULL, NULL, NULL, 26365),
(129679, 'ruRU', 'Шани Уорд', NULL, 'Хозяйка таверны', NULL, 26365),
(129659, 'ruRU', 'Аруун Вестник Тьмы', NULL, NULL, NULL, 26365),
(129644, 'ruRU', 'Домашний питомец', NULL, NULL, NULL, 26365),
(129629, 'ruRU', 'Обычный ловец', NULL, NULL, NULL, 26365),
(129468, 'ruRU', 'Портал Бездны', NULL, NULL, NULL, 26365),
(129428, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(129422, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(129356, 'ruRU', 'Мистический гримуар', NULL, NULL, NULL, 26365),
(129344, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(129268, 'ruRU', 'Хранитель Солнца', NULL, NULL, NULL, 26365),
(129263, 'ruRU', 'Страж Солнечного Колодца', NULL, NULL, NULL, 26365),
(129251, 'ruRU', 'Почетный страж Солнечного Колодца', NULL, NULL, NULL, 26365),
(129250, 'ruRU', 'Кель\'Делар', NULL, NULL, NULL, 26365),
(129248, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(129247, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(129244, 'ruRU', 'Хранитель Солнечного Колодца', 'Хранительница Солнечного Колодца', NULL, NULL, 26365),
(129141, 'ruRU', 'Тонрак', NULL, 'Копейщик', NULL, 26365),
(129049, 'ruRU', 'Тортик', NULL, NULL, NULL, 26365),
(129026, 'ruRU', 'Верховный магистр Роммат', NULL, NULL, NULL, 26365),
(129024, 'ruRU', 'Лор\'темар Терон', NULL, 'Лорд-регент Кель\'Таласа', NULL, 26365),
(129023, 'ruRU', 'Первая чародейка Талисра', NULL, NULL, NULL, 26365),
(129022, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(128980, 'ruRU', 'General Purpose Stalker (RKS)', NULL, NULL, NULL, 26365),
(128970, 'ruRU', 'Хранитель Солнца', NULL, NULL, NULL, 26365),
(128939, 'ruRU', 'Страж Солнечного Колодца', NULL, NULL, NULL, 26365),
(128915, 'ruRU', 'Маг Солнечного Колодца', 'Маг Солнечного Колодца', NULL, NULL, 26365),
(128877, 'ruRU', 'Разрушитель чар Солнечного Колодца', NULL, NULL, NULL, 26365);

INSERT INTO `creature_template_locale` (`entry`, `locale`, `Name`, `NameAlt`, `Title`, `TitleAlt`, `VerifiedBuild`) VALUES
(128836, 'ruRU', 'Сильвана Ветрокрылая', NULL, NULL, NULL, 26365),
(128818, 'ruRU', 'Зараженное поганище', NULL, NULL, NULL, 26365),
(128816, 'ruRU', 'Восставшая аберрация', NULL, NULL, NULL, 26365),
(128815, 'ruRU', 'Жутекостный скелет', NULL, NULL, NULL, 26365),
(128814, 'ruRU', 'Гнилокост-провидец', NULL, NULL, NULL, 26365),
(128813, 'ruRU', 'Темный призрак', NULL, NULL, NULL, 26365),
(128812, 'ruRU', 'Гниющий каннибал', NULL, NULL, NULL, 26365),
(128767, 'ruRU', 'Змея', NULL, NULL, NULL, 26365),
(128713, 'ruRU', 'Страх', NULL, NULL, NULL, 26365),
(128657, 'ruRU', 'Житель Экзодара', 'Жительница Экзодара', NULL, NULL, 26365),
(128656, 'ruRU', 'Житель Экзодара', 'Жительница Экзодара', NULL, NULL, 26365),
(128655, 'ruRU', 'Пылающее исчадие', NULL, NULL, NULL, 26365),
(128622, 'ruRU', 'Болотный уж', NULL, NULL, NULL, 26365),
(128612, 'ruRU', 'Пещерный паук', NULL, NULL, NULL, 26365),
(128566, 'ruRU', 'Т\'паартос', NULL, 'Неадекватный', NULL, 26365),
(128563, 'ruRU', 'Т\'паартос', NULL, 'Пугливый', NULL, 26365),
(128562, 'ruRU', 'Т\'паартос', NULL, 'Хвастливый', NULL, 26365),
(128561, 'ruRU', 'Т\'паартос', NULL, 'Смелый', NULL, 26365),
(128560, 'ruRU', 'Т\'паартос', NULL, 'Сильный', NULL, 26365),
(128558, 'ruRU', 'Детеныш элекка', NULL, NULL, NULL, 26365),
(128550, 'ruRU', 'Т\'паартос', NULL, 'Добрый', NULL, 26365),
(128488, 'ruRU', 'PC - Lightforged Draenei Male', NULL, NULL, NULL, 26365),
(128487, 'ruRU', 'PC - Lightforged Draenei Female', NULL, NULL, NULL, 26365),
(128486, 'ruRU', 'PC - Highmountain Tauren Male', NULL, NULL, NULL, 26365),
(128485, 'ruRU', 'PC - Highmountain Tauren Female', NULL, NULL, NULL, 26365),
(128484, 'ruRU', 'PC - Nightborne Elf Male', NULL, NULL, NULL, 26365),
(128483, 'ruRU', 'PC - Nightborne Elf Female', NULL, NULL, NULL, 26365),
(128482, 'ruRU', 'PC - Void Elf Male', NULL, NULL, NULL, 26365),
(128481, 'ruRU', 'PC - Void Elf Female', NULL, NULL, NULL, 26365),
(128427, 'ruRU', 'Ужас', NULL, NULL, NULL, 26365),
(128425, 'ruRU', 'Растерянность', NULL, NULL, NULL, 26365),
(128424, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(128423, 'ruRU', 'Темный наару', NULL, NULL, NULL, 26365),
(128416, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(128415, 'ruRU', 'Древний проводник', NULL, NULL, NULL, 26365),
(128412, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(128411, 'ruRU', 'Древний проводник', NULL, NULL, NULL, 26365),
(128133, 'ruRU', 'Безумец', NULL, NULL, NULL, 26365),
(128131, 'ruRU', 'Бледнокожий повелитель пауков', NULL, NULL, NULL, 26365),
(128130, 'ruRU', 'Паучья кладка', NULL, NULL, NULL, 26365),
(128125, 'ruRU', 'Искушение', NULL, NULL, NULL, 26365),
(128120, 'ruRU', 'Сомнение', NULL, NULL, NULL, 26365),
(128115, 'ruRU', 'Болотная змея', NULL, NULL, NULL, 26365),
(128099, 'ruRU', 'Болотная жаба', NULL, NULL, NULL, 26365),
(128081, 'ruRU', 'Болотная жаба', NULL, NULL, NULL, 26365),
(128038, 'ruRU', 'Кристальная ярость', NULL, NULL, NULL, 26365),
(128036, 'ruRU', 'Кристалл', NULL, NULL, NULL, 26365),
(128032, 'ruRU', 'Эрлани', NULL, NULL, NULL, 26365),
(128030, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(128028, 'ruRU', 'Ралуун', NULL, NULL, NULL, 26365),
(127983, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(127964, 'ruRU', 'Маяк озаренных', NULL, NULL, NULL, 26365),
(127924, 'ruRU', 'Т\'паартос Падший', NULL, NULL, NULL, 26365),
(127923, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(127827, 'ruRU', 'Т\'паартос', NULL, NULL, NULL, 26365),
(127785, 'ruRU', 'Разлом в Штормград', NULL, NULL, NULL, 26365),
(127619, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(127555, 'ruRU', 'General Purpose Stalker (RKS)', NULL, NULL, NULL, 26365),
(127521, 'ruRU', 'Разлом Бездны', NULL, NULL, NULL, 26365),
(127520, 'ruRU', 'Разлом Бездны', NULL, NULL, NULL, 26365),
(127295, 'ruRU', 'Проекция Бездны', NULL, NULL, NULL, 26365),
(127071, 'ruRU', 'Помраченный-мятежник', 'Помраченная-мятежница', NULL, NULL, 26365),
(127070, 'ruRU', 'Ночнорожденное дитя', 'Ночнорожденное дитя', NULL, NULL, 26365),
(127018, 'ruRU', 'Разлом Бездны', NULL, NULL, NULL, 26365),
(126972, 'ruRU', 'Охранник крепости Северной стражи', NULL, NULL, NULL, 26365),
(126964, 'ruRU', 'Охранник крепости Северной стражи', NULL, NULL, NULL, 26365),
(126799, 'ruRU', 'Мерцающий повелитель Бездны', NULL, NULL, NULL, 26365),
(126789, 'ruRU', 'Горнило Бездны', NULL, NULL, NULL, 26365),
(126788, 'ruRU', 'Темный змей Бездны', NULL, NULL, NULL, 26365),
(126773, 'ruRU', 'Странник', NULL, NULL, NULL, 26365),
(126646, 'ruRU', 'Магистр Умбрий', NULL, NULL, NULL, 26365),
(126639, 'ruRU', 'Чернокнижник Бездны', 'Чернокнижница Бездны', NULL, NULL, 26365),
(126630, 'ruRU', 'Чародей Бездны', 'Чародейка Бездны', NULL, NULL, 26365),
(126604, 'ruRU', 'Любопытный охотник Бездны', NULL, NULL, NULL, 26365),
(126602, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(126589, 'ruRU', 'Нр\'геш', NULL, NULL, NULL, 26365),
(126559, 'ruRU', 'Воплощение тьмы', NULL, NULL, NULL, 26365),
(126538, 'ruRU', 'Фрагмент Бездны', NULL, NULL, NULL, 26365),
(126537, 'ruRU', 'Страж прорыва', NULL, NULL, NULL, 26365),
(126536, 'ruRU', 'Wave Event Portal Stalker', NULL, NULL, NULL, 26365),
(126493, 'ruRU', 'Трансмогрификатор из Стражи Пустоты', NULL, NULL, NULL, 26365),
(126492, 'ruRU', 'Адепт из Стражи Пустоты', NULL, NULL, NULL, 26365),
(126491, 'ruRU', 'Фазовый клинок из Стражи Пустоты', NULL, NULL, NULL, 26365),
(126489, 'ruRU', 'Ползучая Бездна', NULL, NULL, NULL, 26365),
(126470, 'ruRU', 'Принц Пустоты Дурзаан', NULL, NULL, NULL, 26365),
(126370, 'ruRU', 'Сфера Бездны', NULL, NULL, NULL, 26365),
(126365, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(126364, 'ruRU', 'Столп Бездны', NULL, NULL, NULL, 26365),
(126354, 'ruRU', 'Загадочный контейнер', NULL, NULL, NULL, 26365),
(126344, 'ruRU', 'Лор\'темар Терон', NULL, 'Лорд-регент Кель\'Таласа', NULL, 26365),
(126332, 'ruRU', 'Аиса Воспевающая Облака', NULL, 'Мастер Тушуй', NULL, 26365),
(126328, 'ruRU', 'Тиранда Шелест Ветра', NULL, 'Верховная жрица Элуны', NULL, 26365),
(126327, 'ruRU', 'Мурадин Бронзобород', NULL, NULL, NULL, 26365),
(126326, 'ruRU', 'Гелбин Меггакрут', NULL, 'Главный механик, король гномов', NULL, 26365),
(126324, 'ruRU', 'Генн Седогрив', NULL, 'Король Гилнеаса', NULL, 26365),
(126323, 'ruRU', 'Пророк Велен', NULL, NULL, NULL, 26365),
(126319, 'ruRU', 'Верховный экзарх Туралион', NULL, NULL, NULL, 26365),
(126321, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(126315, 'ruRU', 'Гневион', NULL, 'Черный принц', NULL, 26365),
(126306, 'ruRU', 'Андуин Ринн', NULL, 'Король Штормграда', NULL, 26365),
(126305, 'ruRU', 'Верховный экзарх Туралион', NULL, NULL, NULL, 26365),
(126302, 'ruRU', 'Аллерия Ветрокрылая', NULL, NULL, NULL, 26365),
(126301, 'ruRU', 'Андуин Ринн', NULL, 'Король Штормграда', NULL, 26365),
(126231, 'ruRU', 'Безумный заразитель', NULL, NULL, NULL, 26365),
(126134, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(126081, 'ruRU', 'Натанос Гнилостень', NULL, 'Защитник королевы банши', NULL, 26365),
(126078, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(126077, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(126076, 'ruRU', 'Леди Сильвана Ветрокрылая', NULL, 'Вождь', NULL, 26365),
(126068, 'ruRU', 'Морин Ловец Облаков', NULL, NULL, NULL, 26365),
(126067, 'ruRU', 'Этель Мудрая Вода', NULL, NULL, NULL, 26365),
(126066, 'ruRU', 'Эйтригг', NULL, NULL, NULL, 26365),
(126065, 'ruRU', 'Леди Сильвана Ветрокрылая', NULL, 'Вождь', NULL, 26365),
(126062, 'ruRU', 'Леди Лиадрин', NULL, 'Повелительница рыцарей крови', NULL, 26365),
(126012, 'ruRU', 'Наваррогг', NULL, 'Предводитель племени Темного Камня', NULL, 26365),
(126011, 'ruRU', 'Верховный маг Кадгар', NULL, NULL, NULL, 26365),
(126001, 'ruRU', 'Уул\'гинет', NULL, 'Мрак', NULL, 26365),
(126000, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(125999, 'ruRU', 'Майла Крутогор', NULL, 'Верховный вождь', NULL, 26365),
(125998, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(125997, 'ruRU', 'Абиссиан', NULL, NULL, NULL, 26365),
(125951, 'ruRU', 'Обсидиановый страж смерти', NULL, NULL, NULL, 26365),
(125949, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(125832, 'ruRU', 'Халн Крутогор', NULL, NULL, NULL, 26365),
(125829, 'ruRU', 'Духостранник Серое Небо', NULL, NULL, NULL, 26365),
(125826, 'ruRU', 'Вода провидения', NULL, NULL, NULL, 26365),
(125825, 'ruRU', 'Вода провидения', NULL, NULL, NULL, 26365),
(125778, 'ruRU', 'Келари Легкая Поступь', NULL, 'Мастер громовых раскатов', NULL, 26365),
(125470, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(125466, 'ruRU', 'Духостранник Серое Небо', NULL, NULL, NULL, 26365),
(125463, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(125459, 'ruRU', 'Духостранник Серое Небо', NULL, NULL, NULL, 26365),
(125456, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(125454, 'ruRU', 'Духостранник Серое Небо', NULL, NULL, NULL, 26365),
(125397, 'ruRU', NULL, NULL, NULL, NULL, 26365),
(125356, 'ruRU', 'Игрул Губитель Драконов', NULL, NULL, NULL, 26365),
(125287, 'ruRU', 'Верховный друид Хамуул Рунический Тотем', NULL, NULL, NULL, 26365),
(125285, 'ruRU', 'Бейн Кровавое Копыто', NULL, 'Верховный вождь', NULL, 26365),
(125269, 'ruRU', 'Контроллер', NULL, NULL, NULL, 26365),
(125253, 'ruRU', 'Азеритовый разлом', NULL, NULL, NULL, 26365),
(125193, 'ruRU', 'Отважный страж', NULL, NULL, NULL, 26365),
(125192, 'ruRU', 'Страж утесов', 'Стражница утесов', NULL, NULL, 26365),
(125181, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(125180, 'ruRU', 'Майла Крутогор', NULL, 'Верховный вождь', NULL, 26365),
(125141, 'ruRU', 'Тень Уула', NULL, NULL, NULL, 26365),
(125136, 'ruRU', 'Темное щупальце', NULL, NULL, NULL, 26365),
(124267, 'ruRU', 'Ласан Небесный Рог', NULL, 'Вождь племени Небесного Рога', NULL, 26365),
(124252, 'ruRU', 'Духостранник Смоляной Рог', NULL, NULL, NULL, 26365),
(103976, 'ruRU', 'Почтальон', NULL, NULL, NULL, 26365);

UPDATE `creature_template_locale` SET `Name`='Курт', `VerifiedBuild`=26365 WHERE (`entry`=128624 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Йети из снежного шара', `VerifiedBuild`=26365 WHERE (`entry`=128156 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Слизон Последний из Змеев', `VerifiedBuild`=26365 WHERE (`entry`=126913 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Чародейка высших эльфов', `VerifiedBuild`=26365 WHERE (`entry`=123804 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Сваггис', `VerifiedBuild`=26365 WHERE (`entry`=123490 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Сондари', `VerifiedBuild`=26365 WHERE (`entry`=121307 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Торелл', `VerifiedBuild`=26365 WHERE (`entry`=121139 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Выброс Бездны', `VerifiedBuild`=26365 WHERE (`entry`=119759 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=118964 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повстанец Северных врат', `NameAlt`='Повстанец Северных врат', `VerifiedBuild`=26365 WHERE (`entry`=116234 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Детеныш стража святилища', `VerifiedBuild`=26365 WHERE (`entry`=115141 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=112590 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=111935 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=111895 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=111462 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=111115 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=111106 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=111105 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=110589 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=110519 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=109071 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Агент\" из клана Песчаного Молота', `VerifiedBuild`=26365 WHERE (`entry`=108550 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=108458 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стражница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=108323 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стромгардская защитница', `VerifiedBuild`=26365 WHERE (`entry`=107812 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стромгардская кавалеристка', `VerifiedBuild`=26365 WHERE (`entry`=107810 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=106040 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Идол Культа Смерти', `VerifiedBuild`=26365 WHERE (`entry`=105233 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Духостранник Смоляной Рог', `VerifiedBuild`=26365 WHERE (`entry`=105213 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Канир Небесный Рог', `VerifiedBuild`=26365 WHERE (`entry`=105210 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Потревоженный дух из племени Небесного Рога', `VerifiedBuild`=26365 WHERE (`entry`=105194 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Духостранник Серое Небо', `VerifiedBuild`=26365 WHERE (`entry`=105085 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Духостранник Смоляной Рог', `VerifiedBuild`=26365 WHERE (`entry`=105010 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Некрогг Темноуст', `VerifiedBuild`=26365 WHERE (`entry`=104890 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Осквернитель из Культа Смерти', `VerifiedBuild`=26365 WHERE (`entry`=104888 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Тень Мрака', `VerifiedBuild`=26365 WHERE (`entry`=104873 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Обсидиановый страж смерти', `VerifiedBuild`=26365 WHERE (`entry`=104733 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Служитель Серого из Культа Смерти', `VerifiedBuild`=26365 WHERE (`entry`=104565 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Духостранник Серое Небо', `VerifiedBuild`=26365 WHERE (`entry`=104518 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=103663 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Посланник помраченных', `VerifiedBuild`=26365 WHERE (`entry`=103030 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=101146 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=101019 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=100852 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=100832 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=100766 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=100636 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Маладат, рунический клинок черных драконов', `VerifiedBuild`=26365 WHERE (`entry`=100139 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Тувисс', `VerifiedBuild`=26365 WHERE (`entry`=99867 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=99694 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=99174 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=99149 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Грозовой Вершины', `VerifiedBuild`=26365 WHERE (`entry`=97912 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=95448 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Ахеон Кор', `VerifiedBuild`=26365 WHERE (`entry`=94792 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=94356 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=93795 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=93791 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=93773 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=91498 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=91195 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=89805 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=89753 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Связанная кровью укротительница', `VerifiedBuild`=26365 WHERE (`entry`=88961 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Джасор', `VerifiedBuild`=26365 WHERE (`entry`=86395 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Джасор', `VerifiedBuild`=26365 WHERE (`entry`=86050 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Шал', `VerifiedBuild`=26365 WHERE (`entry`=85961 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Тувисс', `VerifiedBuild`=26365 WHERE (`entry`=85291 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Фаршлах', `VerifiedBuild`=26365 WHERE (`entry`=85289 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Детеныш смертоносного опустошителя', `VerifiedBuild`=26365 WHERE (`entry`=84521 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=82909 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Мортиция Краули', `VerifiedBuild`=26365 WHERE (`entry`=82784 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Лучник из клана Черной горы', `VerifiedBuild`=26365 WHERE (`entry`=81422 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Шаманка из клана Северного Волка', `NameAlt`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=79169 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78336 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница из клана Громоборцев', `VerifiedBuild`=26365 WHERE (`entry`=78235 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78186 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78182 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78164 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78163 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78162 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78112 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78111 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78110 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78099 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78080 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=78079 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница из клана Громоборцев', `VerifiedBuild`=26365 WHERE (`entry`=77717 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница из клана Громоборцев', `VerifiedBuild`=26365 WHERE (`entry`=77106 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница боровов из клана Громоборцев', `VerifiedBuild`=26365 WHERE (`entry`=77046 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница из клана Громоборцев', `NameAlt`='Укротительница из клана Громоборцев', `VerifiedBuild`=26365 WHERE (`entry`=76160 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Рубака Колючего холма', `VerifiedBuild`=26365 WHERE (`entry`=75685 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженка из Туурема', `NameAlt`='Беженка из Туурема', `VerifiedBuild`=26365 WHERE (`entry`=75681 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из Телмора', `VerifiedBuild`=26365 WHERE (`entry`=75322 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=74804 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=74622 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=74432 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=73897 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=73716 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=73602 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Орк-беженец', `NameAlt`='Орчиха-беженка', `VerifiedBuild`=26365 WHERE (`entry`=73125 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=72282 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Разведчик Краули', `VerifiedBuild`=26365 WHERE (`entry`=69754 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Эльфийка-обывательница из Похитителей Солнца', `VerifiedBuild`=26365 WHERE (`entry`=68695 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исследователь из Луносвета', `NameAlt`='Исследовательница из Луносвета', `VerifiedBuild`=26365 WHERE (`entry`=68482 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Эльфийка-обывательница из Похитителей Солнца', `VerifiedBuild`=26365 WHERE (`entry`=68052 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Шафийи', `VerifiedBuild`=26365 WHERE (`entry`=67014 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Рамахеш', `VerifiedBuild`=26365 WHERE (`entry`=64573 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Test Shadow Serpent', `VerifiedBuild`=26365 WHERE (`entry`=62446 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Укротительница змеев', `VerifiedBuild`=26365 WHERE (`entry`=62249 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Укротительница ястребов с Наблюдательного пункта', `VerifiedBuild`=26365 WHERE (`entry`=62126 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Раненая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=61498 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Раненый горожанин', `VerifiedBuild`=26365 WHERE (`entry`=61497 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Капитан Варо\'тен', `VerifiedBuild`=26365 WHERE (`entry`=57117 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Укротительница змеев', `VerifiedBuild`=26365 WHERE (`entry`=56788 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Душар', `VerifiedBuild`=26365 WHERE (`entry`=54473 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Исказитель пространства Гашем', `VerifiedBuild`=26365 WHERE (`entry`=54442 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженка из племени Гурубаши', `VerifiedBuild`=26365 WHERE (`entry`=52436 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Рубака Колючего холма', `VerifiedBuild`=26365 WHERE (`entry`=51911 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж огня Болот Печали', `VerifiedBuild`=26365 WHERE (`entry`=51602 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Берсерк из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=51451 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=51439 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=51429 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из стаи Кровавых Клыков', `NameAlt`='Охотница из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=51277 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Зараженная жительница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=51238 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Ополченка Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50910 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Ополченка Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50907 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Уцелевшая жительница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50771 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженка из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50521 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженка из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50520 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженка из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50519 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженец из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50518 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженец из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50517 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженец из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50516 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стражница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50474 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Зараженная жительница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=50471 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=48741 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Часовой из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=48484 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=47155 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Раненый стражник', `VerifiedBuild`=26365 WHERE (`entry`=47091 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=46961 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=46795 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Раненый тюремный ружейник', `VerifiedBuild`=26365 WHERE (`entry`=46408 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Тюремный ружейник', `VerifiedBuild`=26365 WHERE (`entry`=46406 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=46011 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=45195 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Б. Е. Барекус', `VerifiedBuild`=26365 WHERE (`entry`=44560 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Раненая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=44470 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=44399 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Ополченка Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=44388 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Злобный паутинник', `VerifiedBuild`=26365 WHERE (`entry`=44130 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Паникующая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=44086 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=43907 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Кровь Древнего бога', `VerifiedBuild`=26365 WHERE (`entry`=43707 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=43121 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница дракондоров', `VerifiedBuild`=26365 WHERE (`entry`=43114 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=43087 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=43073 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=43072 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Беженец из Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=42970 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=42426 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=41383 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=41332 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=41322 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повстанец Северных врат', `NameAlt`='Повстанец Северных врат', `VerifiedBuild`=26365 WHERE (`entry`=41015 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=40552 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=40367 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=39898 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Спасенная беженка из Гномрегана', `VerifiedBuild`=26365 WHERE (`entry`=39265 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Ополченка Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=39017 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Агент\" из клана Песчаного Молота', `VerifiedBuild`=26365 WHERE (`entry`=38856 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Уцелевшая жительница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=38781 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-сержант', `VerifiedBuild`=26365 WHERE (`entry`=38618 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-пехотинец', `VerifiedBuild`=26365 WHERE (`entry`=38616 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Мертвая беженка из Таурахо', `VerifiedBuild`=26365 WHERE (`entry`=38554 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Подчиненная банши', `VerifiedBuild`=26365 WHERE (`entry`=38473 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Освобожденная селянка', `VerifiedBuild`=26365 WHERE (`entry`=38425 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант', `VerifiedBuild`=26365 WHERE (`entry`=38380 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Отрекшийся-чумодел', `VerifiedBuild`=26365 WHERE (`entry`=38364 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Ополченка Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=38221 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-арбалетчица', `VerifiedBuild`=26365 WHERE (`entry`=38210 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-пехотинец', `VerifiedBuild`=26365 WHERE (`entry`=38192 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=38050 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Темная разведчица', `VerifiedBuild`=26365 WHERE (`entry`=37953 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=37946 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Всадник из клана Волчьей Пасти', `VerifiedBuild`=26365 WHERE (`entry`=37938 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Орчиха-налетчица', `VerifiedBuild`=26365 WHERE (`entry`=37916 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Capturing The Unknown - Bunny 4', `VerifiedBuild`=26365 WHERE (`entry`=37897 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Capturing The Unknown - Bunny 3', `VerifiedBuild`=26365 WHERE (`entry`=37896 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Capturing The Unknown - Bunny 2', `VerifiedBuild`=26365 WHERE (`entry`=37895 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Capturing The Unknown - Bunny 1', `VerifiedBuild`=26365 WHERE (`entry`=37872 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=37869 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Проекция разрушителя XT-002', `VerifiedBuild`=26365 WHERE (`entry`=37861 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Проекция повелителя горнов Игниса', `VerifiedBuild`=26365 WHERE (`entry`=37859 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Огненный Левиафан\"', `VerifiedBuild`=26365 WHERE (`entry`=37856 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-солдат', `VerifiedBuild`=26365 WHERE (`entry`=37805 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Дозорный Предела Бури', `VerifiedBuild`=26365 WHERE (`entry`=37716 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-пехотинец', `VerifiedBuild`=26365 WHERE (`entry`=37692 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=37499 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из Таурахо', `VerifiedBuild`=26365 WHERE (`entry`=37487 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=37187 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Уцелевший горожанин', `NameAlt`='Уцелевшая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=37067 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Матриарх злобных ползунов', `VerifiedBuild`=26365 WHERE (`entry`=37045 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Раненый горожанин', `NameAlt`='Раненая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=36962 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=36939 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Злобный ползун', `VerifiedBuild`=26365 WHERE (`entry`=36813 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Отрекшийся-пехотинец', `NameAlt`='Отрекшаяся-пехотинец', `VerifiedBuild`=26365 WHERE (`entry`=36810 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-захватчица', `VerifiedBuild`=26365 WHERE (`entry`=36809 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Работник картеля Трюмных Вод', `VerifiedBuild`=26365 WHERE (`entry`=36722 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=36690 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-разведчица', `VerifiedBuild`=26365 WHERE (`entry`=36671 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=36653 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=36602 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Выброшенный на берег Отрекшийся', `VerifiedBuild`=26365 WHERE (`entry`=36488 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Уцелевший Отрекшийся', `NameAlt`='Уцелевшая Отрекшаяся', `VerifiedBuild`=26365 WHERE (`entry`=36460 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Жительница Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=36453 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=36348 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=36347 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=36346 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Отрекшийся-пехотинец', `NameAlt`='Отрекшаяся-пехотинец', `VerifiedBuild`=26365 WHERE (`entry`=36236 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж Темной Гавани', `VerifiedBuild`=26365 WHERE (`entry`=36211 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-убийца', `VerifiedBuild`=26365 WHERE (`entry`=36207 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Агент ШРУ', `NameAlt`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=36103 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повстанец Северных врат', `NameAlt`='Повстанец Северных врат', `VerifiedBuild`=26365 WHERE (`entry`=36058 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повстанец Северных врат', `NameAlt`='Повстанец Северных врат', `VerifiedBuild`=26365 WHERE (`entry`=36057 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стражница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=35915 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Раненая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=35912 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Алхимик-подмастерье', `VerifiedBuild`=26365 WHERE (`entry`=35907 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Испуганная горожанка', `VerifiedBuild`=26365 WHERE (`entry`=35836 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Алхимик-подмастерье', `VerifiedBuild`=26365 WHERE (`entry`=35753 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из стаи Кровавых Клыков', `NameAlt`='Охотница из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=35629 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Взбешенный охотник', `VerifiedBuild`=26365 WHERE (`entry`=35627 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=35582 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Потрясенная горожанка', `VerifiedBuild`=26365 WHERE (`entry`=35554 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стражница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=35509 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стражница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=35504 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Молодой ворген', `VerifiedBuild`=26365 WHERE (`entry`=35456 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Уцелевшая жительница Гилнеаса', `VerifiedBuild`=26365 WHERE (`entry`=35233 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из стаи Кровавых Клыков', `NameAlt`='Охотница из стаи Кровавых Клыков', `VerifiedBuild`=26365 WHERE (`entry`=35229 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Молодой ворген', `VerifiedBuild`=26365 WHERE (`entry`=35188 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Испуганная горожанка', `VerifiedBuild`=26365 WHERE (`entry`=34981 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Паникующая горожанка', `VerifiedBuild`=26365 WHERE (`entry`=34851 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-захватчица', `VerifiedBuild`=26365 WHERE (`entry`=34511 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=34429 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Противопехотная мина', `VerifiedBuild`=26365 WHERE (`entry`=34362 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Левиафан II\"', `VerifiedBuild`=26365 WHERE (`entry`=34071 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж святилища', `VerifiedBuild`=26365 WHERE (`entry`=34014 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Рокотун из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=33754 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Саронитовый анимус', `VerifiedBuild`=26365 WHERE (`entry`=33524 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Дозорный из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=33453 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Левиафан II\"', `VerifiedBuild`=26365 WHERE (`entry`=33432 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=33388 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Сердце разрушителя', `VerifiedBuild`=26365 WHERE (`entry`=33329 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Древний хранитель', `VerifiedBuild`=26365 WHERE (`entry`=33203 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Сиденье механика', `VerifiedBuild`=26365 WHERE (`entry`=33167 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Пушка \"Огненного Левиафана\"', `VerifiedBuild`=26365 WHERE (`entry`=33139 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повелитель горнов Игнис', `VerifiedBuild`=26365 WHERE (`entry`=33118 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Огненный Левиафан\"', `VerifiedBuild`=26365 WHERE (`entry`=33113 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Прислужник из клана Темных Рун', `NameAlt`='Прислужница из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=33110 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из Аубердина', `VerifiedBuild`=26365 WHERE (`entry`=33106 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Прислужник из клана Темных Рун', `NameAlt`='Прислужница из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32957 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Пробудитель из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32924 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Обывательница из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32923 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Защитник из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32922 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Прислужник из клана Темных Рун', `NameAlt`='Прислужник из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32886 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Пробудитель из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32878 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Защитник из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=32876 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=32315 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Орчиха-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=31434 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=31416 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Интендант Талмерс', `VerifiedBuild`=26365 WHERE (`entry`=30438 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=29762 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Кровь Древнего бога', `VerifiedBuild`=26365 WHERE (`entry`=28854 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница стихий Дагода', `VerifiedBuild`=26365 WHERE (`entry`=28480 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Щенок из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28139 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Падальщик из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28081 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Копьеносец из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28080 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Охотник из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28079 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Ищейка из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28077 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Берсерк из племени Бешеного Сердца', `VerifiedBuild`=26365 WHERE (`entry`=28076 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Буревестник из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27984 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Заступник из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27983 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Резчик из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27965 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Чудотворец из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27963 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Повелитель стихий из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27962 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Рабочий из клана Темных Рун', `NameAlt`='Рабочий из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27961 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Воин из клана Темных Рун', `VerifiedBuild`=26365 WHERE (`entry`=27960 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Чародейка высших эльфов', `VerifiedBuild`=26365 WHERE (`entry`=27752 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница гиппогрифов', `VerifiedBuild`=26365 WHERE (`entry`=26881 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=26880 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=26853 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=26848 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=26846 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=26842 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница дракондоров', `VerifiedBuild`=26365 WHERE (`entry`=26560 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из Таунка\'ле', `VerifiedBuild`=26365 WHERE (`entry`=26184 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Хранитель огня Болота Печали', `VerifiedBuild`=26365 WHERE (`entry`=25941 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=25749 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=25751 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=25288 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=25256 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Убитая стражница', `VerifiedBuild`=26365 WHERE (`entry`=24962 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница ветра Бара', `VerifiedBuild`=26365 WHERE (`entry`=24730 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Бьорн Халгурдссон', `VerifiedBuild`=26365 WHERE (`entry`=24238 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница ветра', `VerifiedBuild`=26365 WHERE (`entry`=24236 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Укротительница ветрокрылов из лагеря Заиндевевшего Копыта', `VerifiedBuild`=26365 WHERE (`entry`=24142 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=24032 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-арбалетчица', `VerifiedBuild`=26365 WHERE (`entry`=23883 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница грифонов', `VerifiedBuild`=26365 WHERE (`entry`=23736 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница Ирена из Стражи Небес', `VerifiedBuild`=26365 WHERE (`entry`=23413 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротительница из Стражи Небес', `VerifiedBuild`=26365 WHERE (`entry`=23016 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Интендант Пест', `VerifiedBuild`=26365 WHERE (`entry`=20231 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Лучник из клана Ярости Солнца', `NameAlt`='Лучница из клана Ярости Солнца', `VerifiedBuild`=26365 WHERE (`entry`=20207 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Гоблин-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=20102 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=19558 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Интендант Изабель', `VerifiedBuild`=26365 WHERE (`entry`=19315 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Интендант Шандрия', `VerifiedBuild`=26365 WHERE (`entry`=19314 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Фотолюбительница', `NameAlt`='Фотолюбительница', `VerifiedBuild`=26365 WHERE (`entry`=19269 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19178 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Тролль-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19177 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Тауренка-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19176 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Орчиха-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19175 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Гномка-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19172 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Дренейка-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19171 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Эльф крови - обыватель', `NameAlt`='Эльфийка крови - обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19169 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Дворфийка-обывательница', `VerifiedBuild`=26365 WHERE (`entry`=19148 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Старая укротительница ящеров', `VerifiedBuild`=26365 WHERE (`entry`=19146 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Интендант Миллс', `VerifiedBuild`=26365 WHERE (`entry`=19038 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=18950 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=18942 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=18930 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=18808 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=18807 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Беженка из клана Кровавой Глазницы', `VerifiedBuild`=26365 WHERE (`entry`=18292 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Гигантская крыса', `VerifiedBuild`=26365 WHERE (`entry`=16930 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Вивика Суперкадр', `VerifiedBuild`=26365 WHERE (`entry`=16926 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Нико', `VerifiedBuild`=26365 WHERE (`entry`=16909 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Ариэль Ультравспышка', `VerifiedBuild`=26365 WHERE (`entry`=16908 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница дракондоров', `VerifiedBuild`=26365 WHERE (`entry`=16192 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант Лиги Аратора', `VerifiedBuild`=26365 WHERE (`entry`=15127 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант Осквернителей', `VerifiedBuild`=26365 WHERE (`entry`=15126 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Маршал южного оплота Дун Болдара', `VerifiedBuild`=26365 WHERE (`entry`=14763 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Маршал северного оплота Дун Болдара', `VerifiedBuild`=26365 WHERE (`entry`=14762 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Песни Войны', `VerifiedBuild`=26365 WHERE (`entry`=14754 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант Среброкрылых', `VerifiedBuild`=26365 WHERE (`entry`=14753 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Верховный воевода Саурфанг', `VerifiedBuild`=26365 WHERE (`entry`=14720 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=14242 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Инициатор Сквороц', `VerifiedBuild`=26365 WHERE (`entry`=14031 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Инициатор Макарч', `VerifiedBuild`=26365 WHERE (`entry`=14030 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Лучник из клана Северного Волка', `NameAlt`='Лучница из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=13359 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Лучник из клана Грозовой Вершины', `NameAlt`='Лучница из клана Грозовой Вершины', `VerifiedBuild`=26365 WHERE (`entry`=13358 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Шаманка из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=13284 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=13219 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=13218 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Грозовой Вершины', `VerifiedBuild`=26365 WHERE (`entry`=13217 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Интендант клана Грозовой Вершины', `VerifiedBuild`=26365 WHERE (`entry`=13216 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=12616 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Страж из клана Северного Волка', `NameAlt`='Стражница из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=12053 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Легионер из клана Северного Волка', `NameAlt`='Легионер из клана Северного Волка', `VerifiedBuild`=26365 WHERE (`entry`=12051 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=11899 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротитель из Некроситета', `NameAlt`='Укротительница из Некроситета', `VerifiedBuild`=26365 WHERE (`entry`=11257 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Укротитель драконов из легиона Чернорука', `NameAlt`='Укротительница драконов из легиона Чернорука', `VerifiedBuild`=26365 WHERE (`entry`=10742 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=8020 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Агент ШРУ', `VerifiedBuild`=26365 WHERE (`entry`=6946 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='\"Электрошокер-6000\"', `VerifiedBuild`=26365 WHERE (`entry`=6235 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Рубака Колючего холма', `VerifiedBuild`=26365 WHERE (`entry`=5953 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Name`='Канага Заклинатель Земли', `VerifiedBuild`=26365 WHERE (`entry`=5887 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=4317 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-разведчица', `VerifiedBuild`=26365 WHERE (`entry`=3893 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Отрекшаяся-убийца', `VerifiedBuild`=26365 WHERE (`entry`=3807 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=3305 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Оргриммарская рубака', `VerifiedBuild`=26365 WHERE (`entry`=3296 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `Title`='Укротительница ветрокрылов', `VerifiedBuild`=26365 WHERE (`entry`=2851 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стромгардская защитница', `VerifiedBuild`=26365 WHERE (`entry`=2584 AND `locale`='ruRU');
UPDATE `creature_template_locale` SET `NameAlt`='Стромгардская охотница на троллей', `VerifiedBuild`=26365 WHERE (`entry`=2583 AND `locale`='ruRU');
