DELETE FROM `broadcast_text_locale` WHERE `locale` = 'ruRU' AND `ID` IN (209968, 208581);
INSERT INTO `broadcast_text_locale` (`ID`, `locale`, `Text_lang`, `Text1_lang`, `VerifiedBuild`) VALUES
(209968, 'ruRU', '', 'Здравствуй. Тебя интересуют ключи?', 38134),
(208581, 'ruRU', 'Приветствую, ЮЗЕРНЕЙМ. Желаю СЛУЧАЙНОЕ ПОЛОЖИТЕЛЬНОЕ ПРИЛАГАТЕЛЬНОЕ дня.', '', 38134);

DELETE FROM `item_search_name_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `item_search_name_locale` (`ID`, `locale`, `Display_lang`, `VerifiedBuild`) VALUES
(52489, 'ruRU', 'Солнцезащитные очки со стразами', 38134);

DELETE FROM `currency_types_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `currency_types_locale` (`ID`, `locale`, `Name_lang`, `Description_lang`, `VerifiedBuild`) VALUES
(1191, 'ruRU', 'Доблесть', 'Валюта, с помощью которой усиливаются предметы, полученные в эпохальных подземельях.', 38134),
(1602, 'ruRU', 'Очки завоевания', 'Можно заслужить за участие в рейтинговых PvP-боях. Позволяет приобретать снаряжение в Орибосе.', 38134),
(1828, 'ruRU', 'Пепел душ', 'Источник энергии, найденный в Торгасте. Его можно использовать в покоях Резчика Рун.', 38134);

DELETE FROM `spell_name_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `spell_name_locale` (`ID`, `locale`, `Name_lang`, `VerifiedBuild`) VALUES
(328547, 'ruRU', 'Зазубренный костяной шип', 38134),
(335718, 'ruRU', 'Карательные меры', 38134),
(340882, 'ruRU', 'Призыв Газового Мешка', 38134),
(351967, 'ruRU', 'Призыв Гнилорозы', 38134),
(320914, 'ruRU', 'Песочные часы хрономанта', 38134),
(350249, 'ruRU', 'Искажение времени', 38134),
(320740, 'ruRU', 'Сосредоточение внимания', 38134),
(335161, 'ruRU', 'Выхлоп анимы', 38134),
(340433, 'ruRU', 'Благословение Грехопада', 38134),
(220358, 'ruRU', 'Порывы вихря', 38134),
(352329, 'ruRU', '[DNT] Learn Bananas', 38134),
(163708, 'ruRU', 'Зачарованный костер', 38134),
(34477, 'ruRU', 'Перенаправление', 38134),
(202335, 'ruRU', 'Пара бочек', 38134),
(209584, 'ruRU', 'Чай дзен-концентрации', 38134),
(235219, 'ruRU', 'Холодная хватка', 38134),
(243435, 'ruRU', 'Укрепляющий отвар', 38134),
(248518, 'ruRU', 'Вмешательство', 38134),
(321995, 'ruRU', 'Гипотермия', 38134),
(327193, 'ruRU', 'Минута славы', 38134),
(352497, 'ruRU', '[DNT] Teleport', 38134),
(294587, 'ruRU', 'Облероновые шипы x2', 38134),
(294588, 'ruRU', 'Облероновые шипы x3', 38134),
(322841, 'ruRU', 'Крыло неистовства', 38134),
(324919, 'ruRU', 'Крыло неистовства', 38134),
(352816, 'ruRU', '[DNT] Grant Keystone', 38134),
(341220, 'ruRU', 'Арбалет Верных Утробе', 38134),
(321136, 'ruRU', 'Яркий Свет', 38134),
(255260, 'ruRU', 'Печать хаоса', 38134),
(281242, 'ruRU', 'Печать хаоса', 38134),
(337541, 'ruRU', 'Пламя духа тьмы', 38134),
(71, 'ruRU', 'Авангард', 38134),
(48263, 'ruRU', 'Ветеран Третьей войны', 38134),
(245013, 'ruRU', 'Гармония хмелевара', 38134),
(300346, 'ruRU', 'Опытный медведь', 38134),
(316714, 'ruRU', 'Ветеран Третьей войны', 38134),
(319278, 'ruRU', 'Ветеран Четвертой войны', 38134),
(353367, 'ruRU', 'Эгида Света', 38134),
(337334, 'ruRU', 'Небесный путь Кифера', 38134),
(336061, 'ruRU', 'Рывок слизи', 38134),
(340271, 'ruRU', 'Сгустившаяся зараза', 38134),
(327332, 'ruRU', 'Усиление оружия', 38134),
(45525, 'ruRU', 'Чародейский интеллект', 38134),
(354135, 'ruRU', 'Bottom Barrier Visual', 38134),
(321828, 'ruRU', 'Ладушки', 38134),
(321832, 'ruRU', 'Выбивной', 38134),
(326180, 'ruRU', 'Ледяные салочки', 38134),
(322416, 'ruRU', 'Неровный разлом', 38134);

DELETE FROM `criteria_tree_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `criteria_tree_locale` (`ID`, `locale`, `Description_lang`, `VerifiedBuild`) VALUES
(91079, 'ruRU', 'Login with Bananas license (Charity Pet 2021)', 38134),
(91080, 'ruRU', '', 38134),
(91081, 'ruRU', 'Earn character-level Bananas achievement', 38134),
(91082, 'ruRU', '', 38134),
(91386, 'ruRU', 'Ve\'nari reputation is Apprehensive', 38134),
(91388, 'ruRU', 'Ve\'nari reputation is Tentative', 38134),
(91390, 'ruRU', 'Ve\'nari reputation is Ambivalent', 38134),
(91392, 'ruRU', 'Ve\'nari reputation is Cordial', 38134),
(91393, 'ruRU', '', 38134),
(91503, 'ruRU', 'Do You Have All Rank 1s in a Covenant Sanctum?', 38134),
(91504, 'ruRU', 'Login test for backporting of \"do you have all level 1 buildings\"', 38134),
(91505, 'ruRU', '', 38134),
(91506, 'ruRU', 'Do You Have All Rank 2s in a Covenant Sanctum?', 38134),
(91507, 'ruRU', 'Login test for backporting of \"do you have all level 2 buildings\"', 38134),
(91508, 'ruRU', '', 38134),
(91509, 'ruRU', 'Do You Have All Rank 3s in a Covenant Sanctum?', 38134),
(91510, 'ruRU', 'Login test for backporting of \"do you have all level 3 buildings\"', 38134),
(91511, 'ruRU', '', 38134),
(91387, 'ruRU', 'Ve\'nari reputation is Apprehensive', 38134),
(91389, 'ruRU', 'Ve\'nari reputation is Tentative', 38134),
(91391, 'ruRU', 'Ve\'nari reputation is Ambivalent', 38134),
(87404, 'ruRU', 'Побеждайте в рейтинговых PvP-матчах 1-го сезона Shadowlands с рейтингом 1000 или выше.', 38134),
(87408, 'ruRU', 'Побеждайте в рейтинговых PvP-матчах 1-го сезона Shadowlands с рейтингом 1000 или выше.', 38134);

DELETE FROM `specialization_spells_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `specialization_spells_locale` (`ID`, `locale`, `Description_lang`, `VerifiedBuild`) VALUES
(5164, 'ruRU', '', 38134),
(5369, 'ruRU', '', 38134),
(5480, 'ruRU', '', 38134),
(6271, 'ruRU', '', 38134),
(6285, 'ruRU', '', 38134),
(6286, 'ruRU', '', 38134),
(6287, 'ruRU', '', 38134),
(6288, 'ruRU', '', 38134),
(6289, 'ruRU', '', 38134),
(6292, 'ruRU', '', 38134),
(6293, 'ruRU', '', 38134),
(6294, 'ruRU', '', 38134),
(6295, 'ruRU', '', 38134),
(6298, 'ruRU', '', 38134),
(6299, 'ruRU', '', 38134),
(6306, 'ruRU', '', 38134),
(6377, 'ruRU', '', 38134),
(6455, 'ruRU', '', 38134),
(6457, 'ruRU', '', 38134),
(6463, 'ruRU', '', 38134),
(6478, 'ruRU', '', 38134),
(6531, 'ruRU', '', 38134),
(6532, 'ruRU', '', 38134),
(6533, 'ruRU', '', 38134),
(6534, 'ruRU', '', 38134),
(6535, 'ruRU', '', 38134),
(6608, 'ruRU', '', 38134),
(5262, 'ruRU', '', 38134),
(6609, 'ruRU', '', 38134),
(5320, 'ruRU', '', 38134),
(5521, 'ruRU', '', 38134),
(5580, 'ruRU', '', 38134),
(5938, 'ruRU', '', 38134),
(6113, 'ruRU', '', 38134),
(6114, 'ruRU', '', 38134),
(6193, 'ruRU', '', 38134),
(6195, 'ruRU', '', 38134),
(6324, 'ruRU', '', 38134),
(6400, 'ruRU', '', 38134),
(6434, 'ruRU', '', 38134),
(6447, 'ruRU', '', 38134),
(6515, 'ruRU', '', 38134),
(6516, 'ruRU', '', 38134),
(6610, 'ruRU', '', 38134);

DELETE FROM `battlemaster_list_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `battlemaster_list_locale` (`ID`, `locale`, `Name_lang`, `GameType_lang`, `ShortDescription_lang`, `LongDescription_lang`, `VerifiedBuild`) VALUES
(100, 'ruRU', 'Рейтинговое поле боя', '', '', '', 38134),
(866, 'ruRU', 'Все арены', 'Потасовка', '', '', 38134),
(1047, 'ruRU', 'Мугамбала', '', '', '', 38134),
(1048, 'ruRU', 'Рободром', '', '', '', 38134),
(1049, 'ruRU', 'Большой Крюк', '', '', '', 38134),
(1050, 'ruRU', 'Небесный домен', '', '', '', 38134);

DELETE FROM `area_table_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `area_table_locale` (`ID`, `locale`, `AreaName_lang`, `VerifiedBuild`) VALUES
(12876, 'ruRU', 'Престол Примаса', 38134),
(12917, 'ruRU', 'Грехопад', 38134),
(12924, 'ruRU', 'Арденвельд', 38134),
(13387, 'ruRU', 'Арденвельд', 38134),
(6852, 'ruRU', 'Арена испытаний', 38134);

DELETE FROM `char_titles_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `char_titles_locale` (`ID`, `locale`, `Name_lang`, `Name1_lang`, `VerifiedBuild`) VALUES
(679, 'ruRU', 'Барон %s', 'Барон %s', 38134),
(680, 'ruRU', 'Баронесса %s', 'Баронесса %s', 38134),
(682, 'ruRU', 'Граф %s', 'Граф %s', 38134),
(683, 'ruRU', 'Графиня %s', 'Графиня %s', 38134);

DELETE FROM `item_sparse_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `item_sparse_locale` (`ID`, `locale`, `Description_lang`, `Display3_lang`, `Display2_lang`, `Display1_lang`, `Display_lang`, `VerifiedBuild`) VALUES
(52489, 'ruRU', '', '', '', '', 'Солнцезащитные очки со стразами', 38134),
(180317, 'ruRU', '', '', '', '', 'Одухотворенное лечебное зелье', 38134),
(180318, 'ruRU', '', '', '', '', 'Одухотворенное зелье маны', 38134),
(155622, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(159570, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164580, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164581, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164582, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164583, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164584, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164585, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164586, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164587, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164950, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164951, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164952, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164953, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164954, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164955, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(164956, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164957, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164958, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(164959, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(168316, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(171090, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(171091, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(171092, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(171093, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(171095, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(171096, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(171097, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(171098, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(171099, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(172890, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(172891, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(172892, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(172893, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(172894, 'ruRU', '', '', '', '', 'Ратная печатка', 38134),
(172895, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(172896, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(172897, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(172898, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(172899, 'ruRU', '', '', '', '', 'Трофей военачальника', 38134),
(186099, 'ruRU', 'Это устройство создает миниатюрный разрыв в пространстве, делая в предмете снаряжения углубление, подходящее под самоцвет.', '', '', '', 'Аппарат пространственной реструктуризации', 38134),
(183122, 'ruRU', '', '', '', '', 'Плащ Смерти', 38134),
(183131, 'ruRU', '', '', '', '', 'Стигийский захват', 38134),
(183135, 'ruRU', '', '', '', '', 'Призыв падшего', 38134),
(183136, 'ruRU', '', '', '', '', 'Горючая крыса Утробы', 38134),
(183141, 'ruRU', '', '', '', '', 'Стигийская магма', 38134),
(183165, 'ruRU', '', '', '', '', 'Арбалет Верных Утробе', 38134),
(183187, 'ruRU', '', '', '', '', 'Чары заклинателя теней', 38134),
(174876, 'ruRU', '', '', '', '', 'Извлеченный глаз Н\'Зота', 38134),
(187116, 'ruRU', '', '', '', '', 'Манекен-мишень', 38134);

DELETE FROM `map_difficulty_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `map_difficulty_locale` (`ID`, `locale`, `Message_lang`, `VerifiedBuild`) VALUES
(4775, 'ruRU', '', 38134);

DELETE FROM `mount_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `mount_locale` (`ID`, `locale`, `Name_lang`, `SourceText_lang`, `Description_lang`, `VerifiedBuild`) VALUES
(1458, 'ruRU', 'Древень-скиталец', '|cFFFFD200Промоакция|r', 'Древние – надежные защитники лесов Азерота. Они известны своими прекрасными лиственными шевелюрами, меняющими цвет в зависимости от сезона.', 38134);

DELETE FROM `player_condition_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `player_condition_locale` (`ID`, `locale`, `FailureDescription_lang`, `VerifiedBuild`) VALUES
(90553, 'ruRU', '', 38134),
(90651, 'ruRU', '', 38134),
(90652, 'ruRU', '', 38134),
(78581, 'ruRU', '', 38134),
(87399, 'ruRU', 'Добейтесь, чтобы Ве\'нари относилась к вам с признанием или лучше.', 38134);

DELETE FROM `achievement_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `achievement_locale` (`ID`, `locale`, `Description_lang`, `Title_lang`, `Reward_lang`, `VerifiedBuild`) VALUES
(15010, 'ruRU', 'Hidden account-wide tracking achievement allowing access to Ve\'nari\'s goods which require Apprehensive standing [DNT]', 'Maw Tracking - Vendor - Items Unlocked - Apprehensive [DNT]', '', 38134),
(15011, 'ruRU', 'Hidden account-wide tracking achievement allowing access to Ve\'nari\'s goods which require Tentative standing [DNT]', 'Maw Tracking - Vendor - Items Unlocked - Tentative [DNT]', '', 38134),
(15012, 'ruRU', 'Hidden account-wide tracking achievement allowing access to Ve\'nari\'s goods which require Ambivalent standing [DNT]', 'Maw Tracking - Vendor - Items Unlocked - Ambivalent [DNT]', '', 38134),
(15013, 'ruRU', 'Hidden account-wide tracking achievement allowing access to Ve\'nari\'s goods which require Cordial standing [DNT]', 'Maw Tracking - Vendor - Items Unlocked - Cordial [DNT]', '', 38134),
(14340, 'ruRU', 'Победите босса на Пути Перерождения.', 'На Пути Перерождения 1', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14342, 'ruRU', 'Победите трех боссов на Пути Перерождения.', 'На Пути Перерождения 3', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14343, 'ruRU', 'Победите пятерых боссов на Пути Перерождения.', 'На Пути Перерождения 5', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14344, 'ruRU', 'Победите семерых боссов на Пути Перерождения.', 'На Пути Перерождения 7', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14345, 'ruRU', 'Победите 12 боссов на Пути Перерождения.', 'На Пути Перерождения 12', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14346, 'ruRU', 'Победите 16 боссов на Пути Перерождения.', 'На Пути Перерождения 16', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14348, 'ruRU', 'Победите 20 боссов на Пути Перерождения.', 'На Пути Перерождения 20', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14349, 'ruRU', 'Победите 24 босса на Пути Перерождения.', 'На Пути Перерождения 24', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14351, 'ruRU', 'Победите 39 боссов на Пути Перерождения.', 'На Пути Перерождения 39', 'Откройте дополнительные испытания на Пути Перерождения.', 38134),
(14502, 'ruRU', 'Пройдите первые восемь испытаний Верности.', 'Поиски Верности', '', 38134),
(14633, 'ruRU', 'Откройте 3-й уровень транспортной сети вашей обители ковенанта.', 'Мастер навигации', '', 38134),
(14636, 'ruRU', 'Откройте 3-й уровень командирского стола вашей обители ковенанта.', 'Главный по приключениям', '', 38134),
(14637, 'ruRU', 'Откройте 5-й уровень особенности вашей обители ковенанта.', 'Благосклонность ковенанта', '', 38134),
(14638, 'ruRU', 'Откройте все области, подключенные к проводнику анимы.', 'Поток анимы не должен иссякнуть', '', 38134),
(14639, 'ruRU', 'Воспользуйтесь проводником анимы 50 раз.', 'Последовательное восстановление', '', 38134),
(14670, 'ruRU', 'Пробудите по одному духу каждого типа в королевском зимнем саду.', 'Вот это настрой', '', 38134),
(14675, 'ruRU', 'Пробудите по одному могучему духу каждого типа в королевском зимнем саду.', 'Говорящий с духами', '', 38134),
(14676, 'ruRU', 'Пробудите божественных духов всех типов в королевском зимнем саду.', 'Спаситель божественных духов', '', 38134),
(14677, 'ruRU', 'Выполните все задания Фалира или Фалир по наблюдению за духами в королевском зимнем саду.', 'Наблюдения за духами', '', 38134),
(14678, 'ruRU', 'Заслужите благосклонность перечисленных ниже персонажей от имени Пепельного двора.', 'Благосклонность сильных мира иного', '', 38134),
(14679, 'ruRU', 'Откройте перечисленные ниже улучшения для Пепельного двора.', 'Дворец для приемов', '', 38134),
(14680, 'ruRU', 'Откройте перечисленные ниже особые программы для Пепельного двора.', 'Для каждого что-то найдется', '', 38134),
(14681, 'ruRU', 'Обучите помощника-землероя ремеслу дворецкого.', 'Академия землероев', '', 38134),
(14682, 'ruRU', 'Заработайте перечисленные ниже достижения Пепельного двора.', 'Глашатай вечеринки', 'Наградное звание: Глашатай вечеринки', 38134),
(14683, 'ruRU', 'Откройте перечисленные ниже варианты внешности для помощника-землероя.', 'Стильный землерой', '', 38134),
(14684, 'ruRU', 'Выполните перечисленные задания по сшиванию поганищ', 'За жизнь поганищ', '', 38134),
(14723, 'ruRU', 'Примите перечисленных ниже гостей при Пепельном дворе.', 'Будь нашим гостем', '', 38134),
(14724, 'ruRU', 'Приведите перечисленных ниже гостей в восторг на приеме при Пепельном дворе.', 'Всеобщий любимец', '', 38134),
(14725, 'ruRU', 'Проведите прием при Пепельном дворе с четырьмя восторженными гостями.', 'Избранные счастливчики', '', 38134),
(14726, 'ruRU', 'Проведите приемы при Пепельном дворе, повысив перечисленные ниже атрибуты до высоких значений.', 'Скучно не будет', '', 38134),
(14727, 'ruRU', 'Завершите 10 событий на одном приеме при Пепельном дворе.', 'Церемониймейстер', '', 38134),
(14748, 'ruRU', 'Создайте 25 перечисленных ниже модных аксессуаров с помощью сшивания поганищ.', 'Новый гардероб', '', 38134),
(14749, 'ruRU', 'Помогите Рендлу найти перечисленные ниже шляпы, чтобы щегольнуть на приемах при Пепельном дворе.', 'Выход Рендла', '', 38134),
(14751, 'ruRU', 'Соберите перечисленных ниже кадавров с помощью сшивания поганищ.', 'Как здорово, что все мы здесь', 'Награда: таурал дома Избранных', 38134),
(14752, 'ruRU', 'Заработайте перечисленные ниже достижения, связанные со сшиванием поганищ.', 'Чем заняться после смерти', 'Наградное звание \"Мастер поганищ\" и награда – бронированный таурал дома Избранных', 38134),
(14753, 'ruRU', 'Сдайте 100 усиленных анимой обмоток призывателю Жерару, чтобы помочь призвать Визектуса, призрака войны.', 'Обмотки войны', '', 38134),
(14764, 'ruRU', 'Найдите большую удачку с помощью Корди.', 'Большая удачка!', '', 38134),
(14775, 'ruRU', 'Добейтесь превознесения Чесночника.', 'Дружба с грибами', 'Наградное звание: смешной парень / смешная девчонка', 38134),
(14777, 'ruRU', 'Улучшите все функции обители ковенанта.', 'Эксперт по восстановлению', '', 38134),
(14780, 'ruRU', 'Выполните все задания Ом по медитации в королевском зимнем саду и достигните внутренней гармонии.', 'Мастер медитации', '', 38134),
(14789, 'ruRU', 'Выполните все задания Лии и восстановите всех духов животных в королевском зимнем саду.', 'Духи большие и маленькие', '', 38134),
(14833, 'ruRU', 'Создайте перечисленные ниже модные аксессуары с помощью сшивания поганищ.', 'Модное поганище', '', 38134),
(14839, 'ruRU', 'Повысьте уровень трех медиумов до 60-го в приключениях.', 'Тяга к приключениям', '', 38134),
(14840, 'ruRU', 'Повысьте уровень искателя приключений до 20-го.', 'Приключения: азы профессии', '', 38134),
(14841, 'ruRU', 'Повысьте уровень искателя приключений до 40-го.', 'Приключения: теперь ты в деле', '', 38134),
(14842, 'ruRU', 'Повысьте уровень искателя приключений до 60-го.', 'Приключения: сила и упорство', '', 38134),
(14843, 'ruRU', 'Соберите всех 12 искателей приключений ковенанта.', 'Приключения: общее предназначение', '', 38134),
(14844, 'ruRU', 'Завершите перечисленные ниже приключения в Утробе.', 'Приключения: все в атаку!', '', 38134),
(14845, 'ruRU', 'Завершите приключение.', 'Приключения: шаг в нужном направлении', '', 38134),
(14846, 'ruRU', 'Завершите 10 приключений.', 'Приключения: листья в лесу', '', 38134),
(14847, 'ruRU', 'Завершите 100 приключений.', 'Приключения: защитник Темных Земель', '', 38134),
(14851, 'ruRU', 'Победите Калисфену и Малодушного Коринфа, использовав выкованную духами эгиду.', 'Бастион защиты', '', 38134),
(14852, 'ruRU', 'Победите Альдерина и Мин\'ир и изломанный кошмар Миканикосом в испытании Верности.', 'Эй, ухнем', '', 38134),
(14853, 'ruRU', 'Победите Безумного Мортимера, подвергнувшись воздействию огненной крови, заморозки и неудержимой рвоты.', 'Все оттенки боли', '', 38134),
(14854, 'ruRU', 'Победите в испытании Верности, использовав все предметы снаряжения для медиумов.', 'Дело не в том, что ты носишь', '', 38134),
(14856, 'ruRU', 'Победите в испытании Мудрости, надев пять подвесок.', 'В подвешенном состоянии', '', 38134),
(14857, 'ruRU', 'Победите Эктру в испытании Мудрости, убив 20 ползунов.', 'Восьминогое воинство', '', 38134),
(14858, 'ruRU', 'Победите Малодушного Коринфа в испытании Мудрости после того, как он поглотит две сферы анимы.', 'Проклятие жажды', '', 38134),
(14859, 'ruRU', 'Победите \"Атаноса\" в испытании Мудрости, пережив пять \"Мощных замахов\".', 'Внутренний хоум-ран', '', 38134),
(14860, 'ruRU', 'Победите в испытании Мудрости, не используя снаряжение для медиумов.', 'Ничего лишнего', '', 38134),
(14861, 'ruRU', 'Победите Калисфену и \"Атаноса\" в испытании Мудрости Пелагием, Клейей и Миканикосом.', 'Учиться у мастеров', '', 38134),
(14862, 'ruRU', 'Победите в испытании Смирения, использовав все предметы снаряжения для медиумов.', 'Дело в том, как ты это носишь', '', 38134),
(14863, 'ruRU', 'Победите Тран\'тиок в испытании Мудрости, не нанося ей урон до того, как вы разрушите все филактерии.', 'Четыре лика одной личины', '', 38134),
(14864, 'ruRU', 'Победите Азаруукса в испытании Мудрости Пелагием, не трогая воспоминания.', 'Личный кошмар', '', 38134),
(14865, 'ruRU', 'Пройдите все десять испытаний Смирения Пелагием, Клейей и Миканикосом.', 'Послушник храма Смирения', '', 38134),
(14866, 'ruRU', 'Пройдите все десять испытаний Смирения, не используя подвески и не активируя жаровни.', 'Мастер Пути', '', 38134),
(14887, 'ruRU', 'Помашите \"Атаносу\" на прощание после того, как он помашет вам.', 'На Луну!', '', 38134),
(15023, 'ruRU', 'Откройте первый уровень улучшений для всех четырех ковенантов.', 'Еще не все потеряно', 'Награда: больше анимы за выполнение задач', 38134),
(15024, 'ruRU', 'Откройте второй уровень улучшений для всех четырех ковенантов.', 'Засуха – это временно', 'Награда: больше анимы за выполнение задач', 38134),
(15025, 'ruRU', 'Откройте третий уровень улучшений для всех четырех ковенантов.', 'Любитель обителей', 'Награда: больше анимы за выполнение задач', 38134);


DELETE FROM `hotfix_blob` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `hotfix_blob` (`TableHash`, `RecordId`, `locale`, `Blob`, `VerifiedBuild`) VALUES
(13330255, 89547, 'ruRU', 0xFB1E0200ECDA0200, 38134), -- ItemXItemEffect
(3865974254, 187116, 'ruRU', 0xECDA020000000000, 38134), -- ModifiedReagentItem
(3205218938, 34395, 'ruRU', 0x4C4F47494E5F504152454E54414C434F4E54524F4C00D094D0BED181D182D183D0BF20D0BA20D0B4D0B0D0BDD0BDD0BED0B920D183D187D0B5D182D0BDD0BED0B920D0B7D0B0D0BFD0B8D181D0B820D0BED0B3D180D0B0D0BDD0B8D187D0B5D0BD20D0BDD0B020D0BFD180D0B0D0B2D0B0D18520D180D0BED0B4D0B8D182D0B5D0BBD18CD181D0BAD0BED0B3D0BE20D0BAD0BED0BDD182D180D0BED0BBD18F2E20D098D0B7D0BCD0B5D0BDD0B8D182D18C20D0BFD0B0D180D0B0D0BCD0B5D182D180D18B20D0B4D0BED181D182D183D0BFD0B020D0BCD0BED0B6D0BDD0BE20D0BFD0BED181D180D0B5D0B4D181D182D0B2D0BED0BC20D0BCD0B5D0BDD18E20D183D0BFD180D0B0D0B2D0BBD0B5D0BDD0B8D18F20D183D187D0B5D182D0BDD18BD0BCD0B820D0B7D0B0D0BFD0B8D181D18FD0BCD0B82E0002, 38134), -- GlobalStrings
(3205218938, 33881, 'ruRU', 0x424E45545F4552524F525F313100D094D0BED181D182D183D0BF20D0BA20D0B4D0B0D0BDD0BDD0BED0B920D183D187D0B5D182D0BDD0BED0B920D0B7D0B0D0BFD0B8D181D0B820D0BED0B3D180D0B0D0BDD0B8D187D0B5D0BD20D0BDD0B020D0BFD180D0B0D0B2D0B0D18520D180D0BED0B4D0B8D182D0B5D0BBD18CD181D0BAD0BED0B3D0BE20D0BAD0BED0BDD182D180D0BED0BBD18F2E20D098D0B7D0BCD0B5D0BDD0B8D182D18C20D0BFD0B0D180D0B0D0BCD0B5D182D180D18B20D0B4D0BED181D182D183D0BFD0B020D0BCD0BED0B6D0BDD0BE20D0BFD0BED181D180D0B5D0B4D181D182D0B2D0BED0BC20D0BCD0B5D0BDD18E20D183D0BFD180D0B0D0B2D0BBD0B5D0BDD0B8D18F20D183D187D0B5D182D0BDD18BD0BCD0B820D0B7D0B0D0BFD0B8D181D18FD0BCD0B82E0002, 38134), -- GlobalStrings
(3205218938, 33838, 'ruRU', 0x415554485F504152454E54414C5F434F4E54524F4C00D094D0BED181D182D183D0BF20D0BA20D0B4D0B0D0BDD0BDD0BED0B920D183D187D0B5D182D0BDD0BED0B920D0B7D0B0D0BFD0B8D181D0B820D0BED0B3D180D0B0D0BDD0B8D187D0B5D0BD20D0BDD0B020D0BFD180D0B0D0B2D0B0D18520D180D0BED0B4D0B8D182D0B5D0BBD18CD181D0BAD0BED0B3D0BE20D0BAD0BED0BDD182D180D0BED0BBD18F2E20D098D0B7D0BCD0B5D0BDD0B8D182D18C20D0BFD0B0D180D0B0D0BCD0B5D182D180D18B20D0B4D0BED181D182D183D0BFD0B020D0BCD0BED0B6D0BDD0BE20D0BFD0BED181D180D0B5D0B4D181D182D0B2D0BED0BC20D0BCD0B5D0BDD18E20D183D0BFD180D0B0D0B2D0BBD0B5D0BDD0B8D18F20D183D187D0B5D182D0BDD18BD0BCD0B820D0B7D0B0D0BFD0B8D181D18FD0BCD0B82E0002, 38134), -- GlobalStrings
(1754233351, 4164, 'ruRU', 0x69ED040011C2B8323FF3665F3F00004843000048430000000000000000000000000000000000000000000000000000803F0000803F0000A040, 38134), -- SpellMissile
(240389885, 5745, 'ruRU', 0x005238383800000000020202020000000001000000080000000A0000000C00000000000000000000000000000000000000, 38134), -- UnitCondition
(3776013982, 322416, 'ruRU', 0x00D09FD0BED0B420D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD0B8D181D18F20D180D18FD0B4D0BED0BC20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BCD0B820D0BFD0BED18FD0B2D0BBD18FD18ED182D181D18F20D0BAD0B0D0BCD0B5D0BDD0BDD18BD0B520D180D0B0D0B7D0BBD0BED0BCD18B2C20D0BDD0B0D0BDD0BED181D18FD189D0B8D0B52024333232343138733120D0B5D0B42E20D184D0B8D0B7D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D180D0BED0BDD0B020D0B820D0BFD0BED0B4D0B1D180D0B0D181D18BD0B2D0B0D18ED189D0B8D0B520D186D0B5D0BBD0B82E0000, 38134), -- Spell
(3865974254, 174876, 'ruRU', 0x1CAB020000000000, 38134), -- ModifiedReagentItem
(3776013982, 326180, 'ruRU', 0x0024407370656C6C646573633332313837330D0A0000, 38134), -- Spell
(3776013982, 321832, 'ruRU', 0x0024407370656C6C646573633331303430360D0A0000, 38134), -- Spell
(3776013982, 321828, 'ruRU', 0x00D09FD180D0B8D0B7D18BD0B2D0B0D182D0B5D0BBD18CD0BDD0B8D186D0B020D0A2D183D0BCD0B0D0BDD0BED0B220D0B8D0B3D180D0B0D0B5D18220D18120D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0BED0BC20D0B220D0B8D0B3D180D183202224407370656C6C6E616D65333231383238222C20D0BDD0B0D0BDD0BED181D18F2024733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D181D0B8D0BB20D0BFD180D0B8D180D0BED0B4D18B20D0B820D0B2D18BD0B7D18BD0B2D0B0D18F20D180D0B0D181D182D0B5D180D18FD0BDD0BDD0BED181D182D18C20D0BDD0B02024642E20D0A6D0B5D0BBD18C20D0BCD0BED0B6D0B5D18220D0BFD180D0B5D180D0B2D0B0D182D18C20D0B4D0B5D0B9D181D182D0B2D0B8D0B520D18DD182D0BED0B3D0BE20D0B7D0B0D0BAD0BBD0B8D0BDD0B0D0BDD0B8D18F2E00D0A0D0B0D181D182D0B5D180D18FD0BDD0BDD0BED181D182D18C2E00, 38134), -- Spell
(2640972154, 324, 'ruRU', 0xD09FD0B5D0BFD0B5D0BBD18CD0BDD18BD0B920D0B4D0B2D0BED18000440100006F00000000000000050000000001000000000000000500000002000000, 38134), -- GarrTalentTree
(2640972154, 321, 'ruRU', 0xD0A4D0B0D0B1D180D0B8D0BAD0B020D0BFD0BED0B3D0B0D0BDD0B8D18900410100006F00000000000000050000000000000000000000000500000004000000, 38134), -- GarrTalentTree
(2640972154, 320, 'ruRU', 0xD09FD183D182D18C20D09FD0B5D180D0B5D180D0BED0B6D0B4D0B5D0BDD0B8D18F00400100006F00000000000000050000A31400000000000000000500000001000000, 38134), -- GarrTalentTree
(2640972154, 319, 'ruRU', 0xD09AD0BED180D0BED0BBD0B5D0B2D181D0BAD0B8D0B920D0B7D0B8D0BCD0BDD0B8D0B920D181D0B0D0B4003F0100006F00000000000000050000000000000000000000000500000003000000, 38134), -- GarrTalentTree
(4033975491, 441527, 'ruRU', 0x00000000666646C000005040000000000000000000000000B7BC06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF000000000000000000000000000000FA390200, 38134), -- SpellVisualKitModelAttach
(4033975491, 441526, 'ruRU', 0x000000006666464000005040000000000000000000000000B6BC06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF000000000000000000000000000000FA390200, 38134), -- SpellVisualKitModelAttach
(4033975491, 441525, 'ruRU', 0x000000000000000000005040000000000000000000000000B5BC06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF000000000000000000000000000000FA390200, 38134), -- SpellVisualKitModelAttach
(4033975491, 429002, 'ruRU', 0x00000000666646C000003040000000000000000000000000CA8B06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF00000000000000000000000000000009210200, 38134), -- SpellVisualKitModelAttach
(4033975491, 429001, 'ruRU', 0x000000006666464000003040000000000000000000000000C98B06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF00000000000000000000000000000009210200, 38134), -- SpellVisualKitModelAttach
(4033975491, 429000, 'ruRU', 0x000000000000000000003040000000000000000000000000C88B06008293FF0000DB0FC93FDB0FC9BF000000000000000000000000000000000000804000000000FFFFFFFFFFFF00000000000000000000000000000009210200, 38134), -- SpellVisualKitModelAttach
(1181150530, 381714, 'ruRU', 0x02000000B7BC0600FA390200, 38134), -- SpellVisualKitEffect
(1181150530, 381713, 'ruRU', 0x02000000B6BC0600FA390200, 38134), -- SpellVisualKitEffect
(1181150530, 381712, 'ruRU', 0x02000000B5BC0600FA390200, 38134), -- SpellVisualKitEffect
(3425193231, 280125, 'ruRU', 0x090000000A0000000000000000000000000000000000000003000000FA39020075A60100, 38134), -- SpellVisualEvent
(4146370265, 108149, 'ruRU', 0x0000000000000000000000000000000000000000000000000000000000000000FF22000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SpellVisual
(3776013982, 354135, 'ruRU', 0x000000, 38134), -- Spell
(2939349194, 723, 'ruRU', 0xD091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F2028D0A2D0B5D0BCD0BDD18BD0B520D097D0B5D0BCD0BBD0B82900D091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F00030000002301000000008C4E0100AE08000000280000000000, 38134), -- GroupFinderActivity
(2939349194, 722, 'ruRU', 0xD097D0B0D0BCD0BED0BA20D09DD0B0D184D180D0B8D18F2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90003020B0123000000D7008C4E0100F8080F00001E0000000000, 38134), -- GroupFinderActivity
(2939349194, 721, 'ruRU', 0xD097D0B0D0BCD0BED0BA20D09DD0B0D184D180D0B8D18F2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B90003030B0123000000E6008C4E0100F808100000140000000000, 38134), -- GroupFinderActivity
(2939349194, 720, 'ruRU', 0xD097D0B0D0BCD0BED0BA20D09DD0B0D184D180D0B8D18F2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90003010B0123000000C8008C4E0100F8080E00001E0000000000, 38134), -- GroupFinderActivity
(2939349194, 719, 'ruRU', 0xD0A2D0B5D0B0D182D18020D091D0BED0BBD0B82028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90002010A016300000073008C4E0100F508020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 718, 'ruRU', 0xD0A2D0B5D0B0D182D18020D091D0BED0BBD0B82028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B90002010A016300000073008C4E0100F508170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 717, 'ruRU', 0xD0A2D0B5D0B0D182D18020D091D0BED0BBD0B82028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010A01C300000073008C4E0100F508080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 716, 'ruRU', 0xD0A2D0B5D0B0D182D18020D091D0BED0BBD0B82028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90002010A016300000000008C4E0100F508010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 715, 'ruRU', 0xD0A1D0BCD0B5D180D182D0B5D0BBD18CD0BDD0B0D18F20D182D180D0B8D0B7D0BDD0B02028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020109016300000073008C4E0100EE08020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 714, 'ruRU', 0xD0A1D0BCD0B5D180D182D0B5D0BBD18CD0BDD0B0D18F20D182D180D0B8D0B7D0BDD0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020109016300000073008C4E0100EE08170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 713, 'ruRU', 0xD0A1D0BCD0B5D180D182D0B5D0BBD18CD0BDD0B0D18F20D182D180D0B8D0B7D0BDD0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010901C300000073008C4E0100EE08080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 712, 'ruRU', 0xD0A1D0BCD0B5D180D182D0B5D0BBD18CD0BDD0B0D18F20D182D180D0B8D0B7D0BDD0B02028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020109016300000000008C4E0100EE08010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 711, 'ruRU', 0xD0A8D0BFD0B8D0BBD0B820D09FD0B5D180D0B5D180D0BED0B6D0B4D0B5D0BDD0B8D18F2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020108016300000073008C4E0100ED08020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 710, 'ruRU', 0xD0A8D0BFD0B8D0BBD0B820D09FD0B5D180D0B5D180D0BED0B6D0B4D0B5D0BDD0B8D18F2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020108016300000073008C4E0100ED08170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 709, 'ruRU', 0xD0A8D0BFD0B8D0BBD0B820D09FD0B5D180D0B5D180D0BED0B6D0B4D0B5D0BDD0B8D18F2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010801C300000073008C4E0100ED08080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 708, 'ruRU', 0xD0A8D0BFD0B8D0BBD0B820D09FD0B5D180D0B5D180D0BED0B6D0B4D0B5D0BDD0B8D18F2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020108016300000000008C4E0100ED08010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 707, 'ruRU', 0xD09AD180D0BED0B2D0B0D0B2D18BD0B520D0BAD0B0D182D0B0D0BAD0BED0BCD0B1D18B2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020107016300000073008C4E0100EC08020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 706, 'ruRU', 0xD09AD180D0BED0B2D0B0D0B2D18BD0B520D0BAD0B0D182D0B0D0BAD0BED0BCD0B1D18B2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020107016300000073008C4E0100EC08170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 705, 'ruRU', 0xD09AD180D0BED0B2D0B0D0B2D18BD0B520D0BAD0B0D182D0B0D0BAD0BED0BCD0B1D18B2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010701C300000073008C4E0100EC08080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 704, 'ruRU', 0xD09AD180D0BED0B2D0B0D0B2D18BD0B520D0BAD0B0D182D0B0D0BAD0BED0BCD0B1D18B2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020107016300000000008C4E0100EC08010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 703, 'ruRU', 0xD0A2D183D0BCD0B0D0BDD18B20D0A2D0B8D180D0BDD0B020D0A1D0BAD0B8D182D182D0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010601C300000073008C4E0100F208080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 702, 'ruRU', 0xD0A2D183D0BCD0B0D0BDD18B20D0A2D0B8D180D0BDD0B020D0A1D0BAD0B8D182D182D0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020106016300000073008C4E0100F208170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 701, 'ruRU', 0xD0A2D183D0BCD0B0D0BDD18B20D0A2D0B8D180D0BDD0B020D0A1D0BAD0B8D182D182D0B02028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020106016300000073008C4E0100F208020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 700, 'ruRU', 0xD0A2D183D0BCD0B0D0BDD18B20D0A2D0B8D180D0BDD0B020D0A1D0BAD0B8D182D182D0B02028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020106016300000000008C4E0100F208010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 699, 'ruRU', 0xD0A7D0B5D180D182D0BED0B3D0B820D09FD0BED0BAD0B0D18FD0BDD0B8D18F2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010501C300000073008C4E0100EF08080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 698, 'ruRU', 0xD0A7D0B5D180D182D0BED0B3D0B820D09FD0BED0BAD0B0D18FD0BDD0B8D18F2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020105016300000073008C4E0100EF08170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 697, 'ruRU', 0xD0A7D0B5D180D182D0BED0B3D0B820D09FD0BED0BAD0B0D18FD0BDD0B8D18F2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020105016300000073008C4E0100EF08020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 696, 'ruRU', 0xD0A7D0B5D180D182D0BED0B3D0B820D09FD0BED0BAD0B0D18FD0BDD0B8D18F2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020105016300000000008C4E0100EF08010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 695, 'ruRU', 0xD0A2D0B020D0A1D182D0BED180D0BED0BDD0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010401C300000073008C4E0100F308080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 694, 'ruRU', 0xD0A2D0B020D0A1D182D0BED180D0BED0BDD0B02028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020104016300000073008C4E0100F308170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 693, 'ruRU', 0xD0A2D0B020D0A1D182D0BED180D0BED0BDD0B02028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020104016300000073008C4E0100F308020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 692, 'ruRU', 0xD0A2D0B020D0A1D182D0BED180D0BED0BDD0B02028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020104016300000000008C4E0100F308010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 691, 'ruRU', 0xD0A7D183D0BCD0BDD18BD0B520D0BAD0B0D181D0BAD0B0D0B4D18B2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D0BAD0BBD18ED1872900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B92B0002010301C300000073008C4E0100F108080000050100000000, 38134), -- GroupFinderActivity
(2939349194, 690, 'ruRU', 0xD0A7D183D0BCD0BDD18BD0B520D0BAD0B0D181D0BAD0B0D0B4D18B2028D18DD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D0ADD0BFD0BED185D0B0D0BBD18CD0BDD18BD0B900020103016300000073008C4E0100F108170000050100000000, 38134), -- GroupFinderActivity
(2939349194, 689, 'ruRU', 0xD0A7D183D0BCD0BDD18BD0B520D0BAD0B0D181D0BAD0B0D0B4D18B2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B900020103016300000073008C4E0100F108020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 688, 'ruRU', 0xD0A7D183D0BCD0BDD18BD0B520D0BAD0B0D181D0BAD0B0D0B4D18B2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B900020103016300000000008C4E0100F108010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 657, 'ruRU', 0xD091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F2028426174746C6520666F7220417A65726F74682900D091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F0003000000230100000000BF5300000000000000280000000000, 38134), -- GroupFinderActivity
(2939349194, 498, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B520426174746C6520666F7220417A65726F74682028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90002028800620000003A00BF5300006A06020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 497, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B520426174746C6520666F7220417A65726F74682028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90002008800620000000000BF5300006A06010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 458, 'ruRU', 0xD091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F20284C6567696F6E2900D091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F0003000000230100000000BF530000C404000000280000000000, 38134), -- GroupFinderActivity
(2939349194, 418, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5204C6567696F6E2028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90002026F00620000003200BF530000C404020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 417, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5204C6567696F6E2028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90002006F00620000000000BF530000C404010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 398, 'ruRU', 0xD091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F2028D094D180D0B5D0BDD0BED1802900D091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F0003000000230100000000BF5300005C04000000280000000000, 38134), -- GroupFinderActivity
(2939349194, 397, 'ruRU', 0xD091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F2028D09FD0B0D0BDD0B4D0B0D180D0B8D18F2900D091D0BED181D181D18B20D0B2D0BDD0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD18F0003000000230100000000BF5300006603000000280000000000, 38134), -- GroupFinderActivity
(2939349194, 396, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5205761726C6F726473206F6620447261656E6F722028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90002006D00620000000000BF5300005C04020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 395, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5205761726C6F726473206F6620447261656E6F722028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90002006D00620000000000BF5300005C04010000050100000000, 38134), -- GroupFinderActivity
(2939349194, 364, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5204D69737473206F662050616E64617269612028D0B3D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B920D180D0B5D0B6D0B8D0BC2900D093D0B5D180D0BED0B8D187D0B5D181D0BAD0B8D0B90002005400620000000000BF5300006603020000050100000000, 38134), -- GroupFinderActivity
(2939349194, 363, 'ruRU', 0xD0A1D0BBD183D187D0B0D0B9D0BDD0BED0B520D0BFD0BED0B4D0B7D0B5D0BCD0B5D0BBD18CD0B5204D69737473206F662050616E64617269612028D0BED0B1D18BD187D0BDD18BD0B920D180D0B5D0B6D0B8D0BC2900D09ED0B1D18BD187D0BDD18BD0B90002005400620000000000BF5300006603010000050100000000, 38134), -- GroupFinderActivity
(3776013982, 45525, 'ruRU', 0x00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B8D0BDD182D0B5D0BBD0BBD0B5D0BAD18220D181D0BED18ED0B7D0BDD0B8D0BAD0B020D0BDD0B0202473312520D0BDD0B02024642E00D098D0BDD182D0B5D0BBD0BBD0B5D0BAD18220D0BFD0BED0B2D18BD188D0B5D0BD20D0BDD0B020247331252E00, 38134), -- Spell
(3776013982, 327332, 'ruRU', 0x00D0A3D181D0B8D0BBD0B8D0B2D0B0D0B5D18220D0BED180D183D0B6D0B8D0B520D0B0D0BDD0B8D0BCD0BED0B92E20D0A1D0BBD0B5D0B4D183D18ED189D0B8D0B5203520D0B0D182D0B0D0BA2C20D181D0BED0B2D0B5D180D188D0B5D0BDD0BDD18BD18520D0B220D182D0B5D187D0B5D0BDD0B8D0B52024642E2C20D0BDD0B0D0BDD0BED181D18FD18220D0B4D0BED0BFD0BED0BBD0BDD0B8D182D0B5D0BBD18CD0BDD18BD0B920D183D180D0BED0BD20D0BED18220D182D0B0D0B9D0BDD0BED0B920D0BCD0B0D0B3D0B8D0B82E00D090D182D0B0D0BAD0B820D0BED180D183D0B6D0B8D0B5D0BC20D0BDD0B0D0BDD0BED181D18FD1822024333237333331733120D0B5D0B42E20D0B4D0BED0BFD0BED0BBD0BDD0B8D182D0B5D0BBD18CD0BDD0BED0B3D0BE20D183D180D0BED0BDD0B020D0BED18220D182D0B0D0B9D0BDD0BED0B920D0BCD0B0D0B3D0B8D0B82E00, 38134), -- Spell
(3776013982, 340271, 'ruRU', 0x00D0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D183D180D0BED0BD2C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D181D0BED18ED0B7D0BDD0B8D0BAD0B0D0BCD0B820D0B220D180D0B0D0B4D0B8D183D181D0B520313520D0BC2C20D0BDD0B020243334303237337331252E00D0A3D0BCD0B5D0BDD18CD188D0B5D0BDD0B8D0B520D183D180D0BED0BDD0B02C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B3D0BE20D181D0BED18ED0B7D0BDD0B8D0BAD0B0D0BCD0B820D0B220D180D0B0D0B4D0B8D183D181D0B520313520D0BC2C20D0BDD0B02024243334303237337331252E00, 38134), -- Spell
(3776013982, 336061, 'ruRU', 0x000000, 38134), -- Spell
(603412935, 28771, 'ruRU', 0xE4B8ADE59BBDE9AB98E5B182E4BABAE4BA8BE58F98E58AA80004, 38134), -- ChatProfanity
(603412935, 28770, 'ruRU', 0xE4B8ADE59BBDE9AB98E5B182E69D83E58A9BE69697E4BA890004, 38134), -- ChatProfanity
(603412935, 28769, 'ruRU', 0xE4B8ADE59BBDE5AE98E59CBAE68385E69D80E6A1880004, 38134), -- ChatProfanity
(603412935, 28768, 'ruRU', 0xE69CB1E6BAB6E59FBA0004, 38134), -- ChatProfanity
(603412935, 28767, 'ruRU', 0xE69CB1E6BAB6E9B8A10004, 38134), -- ChatProfanity
(603412935, 28766, 'ruRU', 0xE5AFACE8A1A3E5B89D0004, 38134), -- ChatProfanity
(603412935, 28765, 'ruRU', 0xE7A588E7BFA00004, 38134), -- ChatProfanity
(603412935, 28764, 'ruRU', 0xE5B08FE5ADA6E58D9AE5A3ABE7BFA00004, 38134), -- ChatProfanity
(603412935, 28763, 'ruRU', 0xE694BFE59D9BE9BB91E9A9AC0004, 38134), -- ChatProfanity
(603412935, 28762, 'ruRU', 0xE694BFE6B2BBE6B581E6B0930004, 38134), -- ChatProfanity
(603412935, 28761, 'ruRU', 0xE788B1E59BBDE88085E5908CE79B9FE7BD91E7AB990004, 38134), -- ChatProfanity
(603412935, 28760, 'ruRU', 0xE6AF9BE79A87E5B89D0004, 38134), -- ChatProfanity
(603412935, 28759, 'ruRU', 0xE999A4E58C85E5AD900004, 38134), -- ChatProfanity
(603412935, 28758, 'ruRU', 0xE89BA4E79A870004, 38134), -- ChatProfanity
(603412935, 28757, 'ruRU', 0xE89BA4E89F86E698AFE8B0810004, 38134), -- ChatProfanity
(603412935, 28756, 'ruRU', 0xE89BA4E89F86E698AFE8AAB00004, 38134), -- ChatProfanity
(603412935, 28755, 'ruRU', 0xE680BBE4B9A6E8AEB0E79785E58DB10004, 38134), -- ChatProfanity
(603412935, 28754, 'ruRU', 0xE88081E6B19FE79785E58DB10004, 38134), -- ChatProfanity
(603412935, 28753, 'ruRU', 0xE6B19FE9A9BEE5B4A90004, 38134), -- ChatProfanity
(603412935, 28752, 'ruRU', 0xE6B19FE5898DE79A870004, 38134), -- ChatProfanity
(603412935, 28751, 'ruRU', 0xE6B19FE4B88AE79A870004, 38134), -- ChatProfanity
(603412935, 28750, 'ruRU', 0xE99995E8A5BFE5B8A6E5A4B4E5A4A7E593A50004, 38134), -- ChatProfanity
(603412935, 28749, 'ruRU', 0xE68A97E9BAA6E9838E0004, 38134), -- ChatProfanity
(603412935, 28748, 'ruRU', 0xE6A0BCE890A8E5B094E78E8B0004, 38134), -- ChatProfanity
(603412935, 28747, 'ruRU', 0xE890A8E6A0BCE5B094E78E8B0004, 38134), -- ChatProfanity
(3776013982, 337334, 'ruRU', 0x0022D09BD0B0D0BFD0B020D182D0B8D0B3D180D0B02220D0BFD180D0B8D0BCD0B5D0BDD18FD0B5D182D181D18F20D18120D180D0B0D181D181D182D0BED18FD0BDD0B8D18F20247B246D312B357D20D0BC2E20D09FD180D0B820D0B8D181D0BFD0BED0BBD18CD0B7D0BED0B2D0B0D0BDD0B8D0B820D0B2D18B20D0BCD0B3D0BDD0BED0B2D0B5D0BDD0BDD0BE20D181D0BED0B2D0B5D180D188D0B0D0B5D182D0B520D180D18BD0B2D0BED0BA20D0BA20D186D0B5D0BBD0B82E0D0A0D0A22D09BD0B0D0BFD0B020D182D0B8D0B3D180D0B02220D182D0B0D0BAD0B6D0B520D0B4D0B0D0B5D18220D0B2D0B0D0BC20D18DD184D184D0B5D0BAD1822C20D0BFD0BED0B2D18BD188D0B0D18ED189D0B8D0B920D0B2D0B5D180D0BED18FD182D0BDD0BED181D182D18C20D0BAD180D0B8D182D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D0B4D0B0D180D0B020D0BFD180D0BED182D0B8D0B220D186D0B5D0BBD0B820D0BDD0B020243334343032316D312520D0BDD0B02024333434303231642E2C20D0BAD0BED182D0BED180D18BD0B920D181D180D0B0D0B1D0B0D182D18BD0B2D0B0D0B5D18220D0BDD0B520D187D0B0D189D0B520D180D0B0D0B7D0B020D0B22024333337333431642E20D0B4D0BBD18F20D0BAD0B0D0B6D0B4D0BED0B920D186D0B5D0BBD0B82E0000, 38134), -- Spell
(813076512, 80114, 'ruRU', 0x2401000057640500, 38134), -- SpellLabel
(813076512, 80113, 'ruRU', 0x1A00000057640500, 38134), -- SpellLabel
(813076512, 80112, 'ruRU', 0x1000000057640500, 38134), -- SpellLabel
(3776013982, 353367, 'ruRU', 0x00D0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247331252E0000, 38134), -- Spell
(3776013982, 319278, 'ruRU', 0x00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B2D18BD0BDD0BED181D0BBD0B8D0B2D0BED181D182D18C20D0BDD0B020247331252E0D0A243F733331363731345BD0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247333252E5D5B5D0000, 38134), -- Spell
(3776013982, 316714, 'ruRU', 0x322DD0B920D183D180D0BED0B2D0B5D0BDD18C00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B2D18BD0BDD0BED181D0BBD0B8D0B2D0BED181D182D18C20D0BDD0B020247331252E0D0AD0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247B2461627328247332297D252E0000, 38134), -- Spell
(3776013982, 300346, 'ruRU', 0x0022D09BD183D0BDD0BDD18BD0B920D0BED0B3D0BED0BDD18C222C2022D0A3D0BCD0B8D180D0BED182D0B2D0BED180D0B5D0BDD0B8D0B5222C2022D0A1D0BDD18FD182D0B8D0B520D0BFD0BED180D187D0B82220D0B82022D092D0BED0B7D180D0BED0B6D0B4D0B5D0BDD0B8D0B52220D0BCD0BED0B6D0BDD0BE20D0BFD180D0B8D0BCD0B5D0BDD18FD182D18C20D0B220D0BED0B1D0BBD0B8D0BAD0B520D0BCD0B5D0B4D0B2D0B5D0B4D18F2E0D0A0D0AD0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247332252E0000, 38134), -- Spell
(3776013982, 245013, 'ruRU', 0x00D0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B0202473322520D0B820D183D181D0B8D0BBD0B8D0B2D0B0D0B5D18220D0B1D180D0BED0BDD18E20D0BDD0B020247331252E0000, 38134), -- Spell
(3776013982, 48263, 'ruRU', 0x00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B2D18BD0BDD0BED181D0BBD0B8D0B2D0BED181D182D18C20D0BDD0B020247331252E0D0A243F733331363731345BD0A3D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247333252E5D5B5D0000, 38134), -- Spell
(3776013982, 71, 'ruRU', 0x00D09ED0BFD18BD18220D0BCD0BDD0BED0B3D0BED187D0B8D181D0BBD0B5D0BDD0BDD18BD18520D0B1D0BED0B5D0B220D183D0BCD0B5D0BDD18CD188D0B0D0B5D18220D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B020247333252C20D0BFD0BED0B2D18BD188D0B0D0B5D18220D0B2D18BD0BDD0BED181D0BBD0B8D0B2D0BED181D182D18C20D0BDD0B0202473322520D0B820D183D181D0B8D0BBD0B8D0B2D0B0D0B5D18220D0B1D180D0BED0BDD18E20D0BDD0B0202473312520D181D0B8D0BBD18B2E0000, 38134), -- Spell
(3776013982, 337541, 'ruRU', 0x0022D09ED0B3D0BDD0B5D0BDD0BDD0BED0B520D0BAD0BBD0B5D0B9D0BCD0BE2220D0B2D0BED181D0BFD0BED0BBD0BDD18FD0B5D18220D0B2D0B0D0BC20D0B7D0B4D0BED180D0BED0B2D18CD0B520D0B220D0BED0B1D18AD0B5D0BCD0B5202473312520D0B8D0B7D0BDD0B0D187D0B0D0BBD18CD0BDD0BED0B3D0BE20D183D180D0BED0BDD0B020D0B7D0B02024333337353433642E2C20D0B020D0BAD0B0D0B6D0B4D18BD0B920D0BFD0BED180D0B0D0B6D0B5D0BDD0BDD18BD0B92022D09FD0B5D187D0B0D182D18CD18E20D0BED0B3D0BDD18F2220D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BA20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BCD0B3D0BDD0BED0B2D0B5D0BDD0BDD18BD0B920D183D180D0BED0BD2C20D0BDD0B0D0BDD0BED181D0B8D0BCD18BD0B920D181D0BBD0B5D0B4D183D18ED189D0B8D0BC2022D09ED0B3D0BDD0B5D0BDD0BDD18BD0BC20D0BAD0BBD0B5D0B9D0BCD0BED0BC222C20D0BDD0B020243333373534327331252E20D0A1D183D0BCD0BCD0B8D180D183D0B5D182D181D18F20D0B4D0BE20243333373534327520D180D0B0D0B72E0000, 38134), -- Spell
(3776013982, 281242, 'ruRU', 0x00D09DD0B0D0BDD0BED181D0B8D0BCD18BD0B920D0B2D0B0D0BCD0B820D183D180D0BED0BD20D0BED182D0BCD0B5D187D0B0D0B5D18220D186D0B5D0BBD18C2C20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D18F20D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D0B5D18E20D0BCD0B0D0B3D0B8D187D0B5D181D0BAD0B8D0B920D183D180D0BED0BD20D0BDD0B02024313439307331252E0000, 38134), -- Spell
(3776013982, 255260, 'ruRU', 0x00D09DD0B0D0BDD0BED181D0B8D0BCD18BD0B920D0B2D0B0D0BCD0B820D183D180D0BED0BD20D0BED182D0BCD0B5D187D0B0D0B5D18220D186D0B5D0BBD18C2C20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D18F20D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D0B5D18E20D0BCD0B0D0B3D0B8D187D0B5D181D0BAD0B8D0B920D183D180D0BED0BD20D0BDD0B02024313439307331252E0000, 38134), -- Spell
(603412935, 28746, 'ruRU', 0x5C62725C733F615C733F705C733F655C733F5C620000, 38134), -- ChatProfanity
(603412935, 28745, 'ruRU', 0x5C62725C733F655C733F745C733F615C733F725C733F64285C733F737C5C733F655C733F64293F5C620000, 38134), -- ChatProfanity
(4033975491, 436804, 'ruRU', 0x00000000000000000000000000000000000000000000000044AA06000A59FF0E030000000000000000000000000000000000000000000000000000803F00000000FFFFFFFFFFFF00000000000000CDCC4C3DCDCC4C3DCC0B0200, 38134), -- SpellVisualKitModelAttach
(3386943305, 171057, 'ruRU', 0x07787800000000000000004A00B20200000000081000000000000400000000000000000001000040000000000000000000E05A0200, 38134), -- CreatureDifficulty
(3386943305, 170644, 'ruRU', 0x07787800000000000000001000B2020000000008100000000000000000000000000000000100000000000000000000000068590200, 38134), -- CreatureDifficulty
(3899321669, 4791, 'ruRU', 0xB71200000101180B0300, 38134), -- SpellAuraVisibility
(3899321669, 4790, 'ruRU', 0xB61200000001180B0300, 38134), -- SpellAuraVisibility
(4033975491, 440494, 'ruRU', 0x0000000000000000CDCC4C3E000000000000000000000000AEB80600D058FF00000000000000000000000000000000000000000000000000003333333F0000000000009E009F0000000000000000000000000000000051160200, 38134), -- SpellVisualKitModelAttach
(4033975491, 440493, 'ruRU', 0x0000000000000000CDCCCC3D000000000000000000000000ADB806007F87FF00000000000000000000000000000000000000000000000000003333333F0000000000009E009F0000000000000000000000000000000051160200, 38134), -- SpellVisualKitModelAttach
(4033975491, 417672, 'ruRU', 0x000000000000000000000000000000000000000000000000885F06000F5AFF00000000000000000000000000000000000000000000000000000000C03F00000000FFFFFFFFFFFF00000800000000000000000000000021030200, 38134), -- SpellVisualKitModelAttach
(4033975491, 417626, 'ruRU', 0x0000000000000000000000000000000000000000000000005A5F0600E64BFF0000000000000000000000000000000000000000000000000000333373400000000000009E009F0000000000000000000000000000000009030200, 38134), -- SpellVisualKitModelAttach
(1181150530, 380178, 'ruRU', 0x02000000AEB8060051160200, 38134), -- SpellVisualKitEffect
(1181150530, 380177, 'ruRU', 0x02000000ADB8060051160200, 38134), -- SpellVisualKitEffect
(3776013982, 321136, 'ruRU', 0x00D09AD0B0D0B6D0B4D18BD0B9202473312DD0B92022D0A9D0B8D18220D0BFD180D0B0D0B2D0B5D0B4D0BDD0B8D0BAD0B02220D0BFD0BED0B7D0B2D0BED0BBD18FD0B5D18220D0BFD180D0B8D0BCD0B5D0BDD0B8D182D18C20D181D0BBD0B5D0B4D183D18ED189D0B5D0B52022D0A2D0BED180D0B6D0B5D181D182D0B2D0BE2220D0B1D0B5D0B720D0B7D0B0D182D180D0B0D18220D180D0B5D181D183D180D181D0B02E0000, 38134), -- Spell
(3776013982, 341220, 'ruRU', 0x000024407370656C6C6465736333343132313200, 38134), -- Spell
(3865974254, 183187, 'ruRU', 0x93CB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183165, 'ruRU', 0x7DCB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183141, 'ruRU', 0x65CB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183136, 'ruRU', 0x60CB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183135, 'ruRU', 0x5FCB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183131, 'ruRU', 0x5BCB020000000000, 38134), -- ModifiedReagentItem
(3865974254, 183122, 'ruRU', 0x52CB020000000000, 38134), -- ModifiedReagentItem
(3776013982, 352816, 'ruRU', 0x000000, 38134), -- Spell
(600565378, 300040, 'ruRU', 0xA06D01000000803F0000803F0074BA0200, 38134), -- CreatureXDisplayInfo
(813076512, 79920, 'ruRU', 0x9703000075A80400, 38134), -- SpellLabel
(13330255, 73366, 'ruRU', 0x081D0200F3D60200, 38134), -- ItemXItemEffect
(3865974254, 186099, 'ruRU', 0xF3D6020000000000, 38134), -- ModifiedReagentItem
(600565378, 299890, 'ruRU', 0x4A6400000000803F0000803F001CBA0200, 38134), -- CreatureXDisplayInfo
(600565378, 299885, 'ruRU', 0x0A6F01000000803F0000803F0017BA0200, 38134), -- CreatureXDisplayInfo
(3865974254, 172899, 'ruRU', 0x63A3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172898, 'ruRU', 0x62A3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172897, 'ruRU', 0x61A3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172896, 'ruRU', 0x60A3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172895, 'ruRU', 0x5FA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172894, 'ruRU', 0x5EA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172893, 'ruRU', 0x5DA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172892, 'ruRU', 0x5CA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172891, 'ruRU', 0x5BA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 172890, 'ruRU', 0x5AA3020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171099, 'ruRU', 0x5B9C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171098, 'ruRU', 0x5A9C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171097, 'ruRU', 0x599C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171096, 'ruRU', 0x589C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171095, 'ruRU', 0x579C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171094, 'ruRU', 0x569C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171093, 'ruRU', 0x559C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171092, 'ruRU', 0x549C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171091, 'ruRU', 0x539C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 171090, 'ruRU', 0x529C020000000000, 38134), -- ModifiedReagentItem
(3865974254, 168316, 'ruRU', 0x7C91020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164959, 'ruRU', 0x5F84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164958, 'ruRU', 0x5E84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164957, 'ruRU', 0x5D84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164956, 'ruRU', 0x5C84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164955, 'ruRU', 0x5B84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164954, 'ruRU', 0x5A84020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164953, 'ruRU', 0x5984020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164952, 'ruRU', 0x5884020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164951, 'ruRU', 0x5784020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164950, 'ruRU', 0x5684020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164587, 'ruRU', 0xEB82020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164586, 'ruRU', 0xEA82020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164585, 'ruRU', 0xE982020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164584, 'ruRU', 0xE882020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164583, 'ruRU', 0xE782020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164582, 'ruRU', 0xE682020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164581, 'ruRU', 0xE582020000000000, 38134), -- ModifiedReagentItem
(3865974254, 164580, 'ruRU', 0xE482020000000000, 38134), -- ModifiedReagentItem
(3865974254, 159570, 'ruRU', 0x526F020000000000, 38134), -- ModifiedReagentItem
(3865974254, 155622, 'ruRU', 0xE65F020000000000, 38134), -- ModifiedReagentItem
(3205218938, 43871, 'ruRU', 0x43555252454E43595F534541534F4E5F544F54414C5F4D4158494D554D00D09CD0B0D0BAD181D0B8D0BCD183D0BC20D0B7D0B020D181D0B5D0B7D0BED0BD3A20257325732F25730001, 38134), -- GlobalStrings
(3776013982, 324919, 'ruRU', 0x0024407370656C6C646573633332323834310000, 38134), -- Spell
(3776013982, 322841, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D183D180D0BED0BD20D0BED18220243F613231323631325B22D0A0D18BD0B2D0BAD0B020D0A1D0BAD0B2D0B5D180D0BDD18B225D3F613231323631335B22D098D0BDD184D0B5D180D0BDD0B0D0BBD18CD0BDD0BED0B3D0BE20D183D0B4D0B0D180D0B0225D5B5D20D0BDD0B020247331252E00D0A3D180D0BED0BD20D0BED18220243F613231323631325B22D0A0D18BD0B2D0BAD0B020D0A1D0BAD0B2D0B5D180D0BDD18B225D3F613231323631335B22D098D0BDD184D0B5D180D0BDD0B0D0BBD18CD0BDD0BED0B3D0BE20D183D0B4D0B0D180D0B0225D5B5D20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 38134), -- Spell
(3776013982, 294588, 'ruRU', 0x00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B2D0B5D180D0BED18FD182D0BDD0BED181D182D18C20D0BAD180D0B8D182D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D0B4D0B0D180D0B020D0BDD0B020247B2473312A2432393435373873317D252E0000, 38134), -- Spell
(3776013982, 294587, 'ruRU', 0x00D09FD0BED0B2D18BD188D0B0D0B5D18220D0B2D0B5D180D0BED18FD182D0BDD0BED181D182D18C20D0BAD180D0B8D182D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D0B4D0B0D180D0B020D0BDD0B020247B2473312A2432393435373873317D252E0000, 38134), -- Spell
(3865974254, 180318, 'ruRU', 0x5EC0020000000000, 38134), -- ModifiedReagentItem
(3865974254, 180317, 'ruRU', 0x5DC0020000000000, 38134), -- ModifiedReagentItem
(3865974254, 176406, 'ruRU', 0x16B1020000000000, 38134), -- ModifiedReagentItem
(3865974254, 168564, 'ruRU', 0x7492020000000000, 38134), -- ModifiedReagentItem
(3776013982, 352497, 'ruRU', 0x000000, 38134), -- Spell
(3776013982, 327193, 'ruRU', 0x00D092D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D1822022D0A9D0B8D18220D0BCD181D182D0B8D182D0B5D0BBD18F222E20D09FD180D0B820246E20246CD181D0BBD0B5D0B4D183D18ED189D0B5D0BC20D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D0B83AD181D0BBD0B5D0B4D183D18ED189D0B8D18520D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D18FD1853AD181D0BBD0B5D0B4D183D18ED189D0B8D18520D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D18FD1853B2022D0A9D0B8D18220D0BCD181D182D0B8D182D0B5D0BBD18F2220D0BDD0B520D0BFD0BED182D180D0B5D0B1D183D0B5D18220D0B2D0BED181D181D182D0B0D0BDD0BED0B2D0BBD0B5D0BDD0B8D18F20D0B820D0BDD0B0D0BDD0B5D181D0B5D18220D0BDD0B0202473322520D0B1D0BED0BBD18CD188D0B520D183D180D0BED0BDD0B02E00D09FD180D0B820246E20246CD181D0BBD0B5D0B4D183D18ED189D0B5D0BC20D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D0B83AD181D0BBD0B5D0B4D183D18ED189D0B8D18520D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D18FD1853AD181D0BBD0B5D0B4D183D18ED189D0B8D18520D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D18FD1853B2022D0A9D0B8D18220D0BCD181D182D0B8D182D0B5D0BBD18F2220D0BDD0B520D0BFD0BED182D180D0B5D0B1D183D0B5D18220D0B2D0BED181D181D182D0B0D0BDD0BED0B2D0BBD0B5D0BDD0B8D18F20D0B820D0BDD0B0D0BDD0B5D181D0B5D18220D0BDD0B0202477322520D0B1D0BED0BBD18CD188D0B520D183D180D0BED0BDD0B02E00, 38134), -- Spell
(3776013982, 321995, 'ruRU', 0x00D09DD0B02024642E20D181D0BDD0B8D0B6D0B0D0B5D18220D0B7D0B0D182D180D0B0D182D18B20D181D0B8D0BBD18B20D180D183D0BD20D0BDD0B020D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D0B520D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D0B5D0B920D0BDD0B020247331252E20D09DD0B520D0B7D0B0D0BFD183D181D0BAD0B0D0B5D18220D0BED0B1D189D0B5D0B520D0B2D180D0B5D0BCD18F20D0B2D0BED181D181D182D0B0D0BDD0BED0B2D0BBD0B5D0BDD0B8D18F2E00D097D0B0D182D180D0B0D182D18B20D181D0B8D0BBD18B20D180D183D0BD20D0BDD0B020D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D0B820D181D0BDD0B8D0B6D0B5D0BDD18B20D0BDD0B020247331252E00, 38134), -- Spell
(3776013982, 248518, 'ruRU', 0x5076502DD182D0B0D0BBD0B0D0BDD18200D09220D182D0B5D187D0B5D0BDD0B8D0B52024733120D181D0B5D0BA2E20D0BFD0BED181D0BBD0B520D0BFD180D0B8D0BCD0B5D0BDD0B5D0BDD0B8D18F20D0BA20D186D0B5D0BBD0B820D181D0BBD0B5D0B4D183D18ED189D0B5D0B3D0BE20D0B2D180D0B5D0B4D0BED0BDD0BED181D0BDD0BED0B3D0BE20D0B7D0B0D0BAD0BBD0B8D0BDD0B0D0BDD0B8D18F20D0B2D181D0B520D0B7D0B0D0BAD0BBD0B8D0BDD0B0D0BDD0B8D18F20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B02C20D0BDD0B0D0BFD180D0B0D0B2D0BBD0B5D0BDD0BDD18BD0B520D0BFD180D0BED182D0B8D0B220D0BDD0B5D0B52C20D0BFD0B5D180D0B5D0BDD0B0D0BFD180D0B0D0B2D0BBD18FD18ED182D181D18F20D0BDD0B020D0B2D0B0D188D0B5D0B3D0BE20D0BFD0B8D182D0BED0BCD186D0B02E0D0A0D0AD094D0BBD18F20D181D180D0B0D0B1D0B0D182D18BD0B2D0B0D0BDD0B8D18F20D18DD182D0BED0B3D0BE20D18DD184D184D0B5D0BAD182D0B020D0B2D0B0D18820D0BFD0B8D182D0BED0BCD0B5D18620D0B4D0BED0BBD0B6D0B5D0BD20D0B1D18BD182D18C20D0BDD0B520D0B4D0B0D0BBD18CD188D0B52C20D187D0B5D0BC20D0B22024323438353139613120D0BC20D0BED18220D186D0B5D0BBD0B82E0000, 38134), -- Spell
(3776013982, 243435, 'ruRU', 0x00D09FD180D0B5D0B2D180D0B0D189D0B0D0B5D18220D0B2D0B0D188D18320D0BAD0BED0B6D18320D0B220D0BAD0B0D0BCD0B5D0BDD18C2C20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D18F20D182D0B5D0BAD183D189D0B8D0B920D0B820D0BCD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD18BD0B920D0B7D0B0D0BFD0B0D18120D0B7D0B4D0BED180D0BED0B2D18CD18F20D0BDD0B0202473312520D0B820D183D0BCD0B5D0BDD18CD188D0B0D18F20D0BFD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D0BDD0B0202473322520D0BDD0B02024642E00D09CD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD18BD0B920D0B7D0B0D0BFD0B0D18120D0B7D0B4D0BED180D0BED0B2D18CD18F20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247731252E0D0AD09FD0BED0BBD183D187D0B0D0B5D0BCD18BD0B920D183D180D0BED0BD20D183D0BCD0B5D0BDD18CD188D0B5D0BD20D0BDD0B020247732252E243F2477343E315B0D0AD09FD0BED0B3D0BBD0BED189D0B0D0B5D1822024773420D0B5D0B42E20D183D180D0BED0BDD0B02E5D5B5D00, 38134), -- Spell
(3776013982, 235219, 'ruRU', 0x00D09CD0B3D0BDD0BED0B2D0B5D0BDD0BDD0BE20D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D1822022D09BD0B5D0B4D18FD0BDD183D18E20D0BFD180D0B5D0B3D180D0B0D0B4D183222C2022D09AD0BED0BBD18CD186D0BE20D0BBD18CD0B4D0B0222C2022D09AD0BED0BDD183D18120D185D0BED0BBD0BED0B4D0B02220D0B82022D09BD0B5D0B4D18FD0BDD183D18E20D0B3D0BBD18BD0B1D183222E0000, 38134), -- Spell
(3776013982, 209584, 'ruRU', 0x5076502DD182D0B0D0BBD0B0D0BDD18200D094D0B0D0B5D18220D0BDD0B5D0B2D0BED181D0BFD180D0B8D0B8D0BCD187D0B8D0B2D0BED181D182D18C20D0BA20D18DD184D184D0B5D0BAD182D0B0D0BC20D0BDD0B5D0BCD0BED182D18B20D0B820D0BFD180D0B5D180D18BD0B2D0B0D0BDD0B8D18F20D0BDD0B02024642E00D09DD0B5D0B2D0BED181D0BFD180D0B8D0B8D0BCD187D0B8D0B2D0BED181D182D18C20D0BA20D18DD184D184D0B5D0BAD182D18320D0BDD0B5D0BCD0BED182D18B20D0B820D0BFD180D0B5D180D18BD0B2D0B0D0BDD0B8D18FD0BC2E00, 38134), -- Spell
(3776013982, 202335, 'ruRU', 0x5076502DD182D0B0D0BBD0B0D0BDD18200D092D0B0D18820D181D0BBD0B5D0B4D183D18ED189D0B8D0B92022D0A3D0B4D0B0D18020D0B1D0BED187D0BED0BDD0BAD0BED0BC2220D0BDD0B0D0BDD0BED181D0B8D18220D0BDD0B0202473312520D0B1D0BED0BBD18CD188D0B520D183D180D0BED0BDD0B020D0B820D0BED0B3D0BBD183D188D0B0D0B5D18220D186D0B5D0BBD0B820D0BDD0B02024323032333436642E0022D0A3D0B4D0B0D18020D0B1D0BED187D0BED0BDD0BAD0BED0BC2220D0BDD0B0D0BDD0BED181D0B8D18220D0BDD0B0202473312520D0B1D0BED0BBD18CD188D0B520D183D180D0BED0BDD0B020D0B820D0BED0B3D0BBD183D188D0B0D0B5D18220D186D0B5D0BBD0B820D0BDD0B02024323032333436642E00, 38134), -- Spell
(3776013982, 34477, 'ruRU', 0x00D09FD0B5D180D0B5D0BDD0BED181D0B8D18220D181D0BED0B7D0B4D0B0D0B2D0B0D0B5D0BCD183D18E20D0B2D0B0D0BCD0B820D183D0B3D180D0BED0B7D18320D0BDD0B020D183D0BAD0B0D0B7D0B0D0BDD0BDD0BED0B3D0BE20D183D187D0B0D181D182D0BDD0B8D0BAD0B020D0B3D180D183D0BFD0BFD18B20D0B8D0BBD0B820D180D0B5D0B9D0B4D0B020D0BDD0B020243335303739642E20D09ED182D181D187D0B5D18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0B4D0B5D0B9D181D182D0B2D0B8D18F20D0BDD0B0D187D0B8D0BDD0B0D0B5D182D181D18F20D0BFD0BED181D0BBD0B520D0BFD0B5D180D0B2D0BED0B920D0B0D182D0B0D0BAD0B82C20D181D0BED0B2D0B5D180D188D0B5D0BDD0BDD0BED0B920D0B220D182D0B5D187D0B5D0BDD0B8D0B520D181D0BBD0B5D0B4D183D18ED189D0B8D1852024642E00D09FD0B5D180D0B5D0BDD0B0D0BFD180D0B0D0B2D0BBD0B5D0BDD0B8D0B520D183D0B3D180D0BED0B7D18B20D0BED18220D0BED185D0BED182D0BDD0B8D0BAD0B02E00, 38134), -- Spell
(3359787322, 19830, 'ruRU', 0x764D0000, 38134), -- WorldState
(3359787322, 19710, 'ruRU', 0xFE4C0000, 38134), -- WorldState
(3359787322, 19709, 'ruRU', 0xFD4C0000, 38134), -- WorldState
(3359787322, 19384, 'ruRU', 0xB84B0000, 38134), -- WorldState
(368401261, 5214, 'ruRU', 0x5B8800000000000000000000000000000000000000000000, 38134), -- CombatCondition
(368401261, 4771, 'ruRU', 0x848400000000000000000000000000000000000000000000, 38134), -- CombatCondition
(3776013982, 163708, 'ruRU', 0x00D0A3D180D0BED0BD20D0BED18220D0B7D0B0D0BAD0BBD0B8D0BDD0B0D0BDD0B8D0B920D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B0203230252E0D0A0D0AD09FD0BED0B7D0B2D0BED0BBD18FD0B5D18220D181D0B5D182D0B5D0BAD0BAD181D0BAD0B8D0BC20D0B0D180D0B0D0BAD0BAD0BED0B020D0BFD180D0B8D0BCD0B5D0BDD18FD182D18C20D0B7D0B0D187D0B0D180D0BED0B2D0B0D0BDD0BDD0BED0B520D0BFD0BBD0B0D0BCD18F2E00D0A3D180D0BED0BD20D0BED18220D0B7D0B0D0BAD0BBD0B8D0BDD0B0D0BDD0B8D0B920D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B0203230252E0D0A0D0AD09FD0BED0B7D0B2D0BED0BBD18FD0B5D18220D181D0B5D182D0B5D0BAD0BAD181D0BAD0B8D0BC20D0B0D180D0B0D0BAD0BAD0BED0B020D0BFD180D0B8D0BCD0B5D0BDD18FD182D18C20D0B7D0B0D187D0B0D180D0BED0B2D0B0D0BDD0BDD0BED0B520D0BFD0BBD0B0D0BCD18F2E00, 38134), -- Spell
(3776013982, 352329, 'ruRU', 0x000000, 38134), -- Spell
(3865974254, 52489, 'ruRU', 0x09CD000000000000, 38134), -- ModifiedReagentItem
(3037505077, 52489, 'ruRU', 0x0100, 38134), -- TradeSkillItem
(3776013982, 220358, 'ruRU', 0x0024407370656C6C646573633130313534360000, 38134), -- Spell
(3776013982, 340433, 'ruRU', 0x00D092D0B0D18120D0BFD0B5D180D0B5D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD0B5D180D0B5D180D0B0D0B1D0BED182D0B0D0BDD0BDD0B0D18F20D0B0D0BDD0B8D0BCD0B02C20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D18ED189D0B0D18F20D0BDD0B0D0BDD0BED181D0B8D0BCD18BD0B920D183D180D0BED0BD20D0B820D0BED0B1D18AD0B5D0BC20D0B8D181D185D0BED0B4D18FD189D0B5D0B3D0BE20D0B8D181D186D0B5D0BBD0B5D0BDD0B8D18F20D0BDD0B0202473312520D0BDD0B02024642E00D09DD0B0D0BDD0BED181D0B8D0BCD18BD0B920D183D180D0BED0BD20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E0D0AD098D181D185D0BED0B4D18FD189D0B5D0B520D0B8D181D186D0B5D0BBD0B5D0BDD0B8D0B520D183D181D0B8D0BBD0B5D0BDD0BE20D0BDD0B020247332252E00, 38134), -- Spell
(3776013982, 335161, 'ruRU', 0x00D092D18BD185D0BBD0BED0BF20D0B0D0BDD0B8D0BCD18B2C20D0BFD0BED0BBD183D187D0B5D0BDD0BDD18BD0B920D0BED18220D0BDD0B5D0B8D181D0BFD180D0B0D0B2D0BDD18BD18520D0B3D0BED0BBD0B8D0B0D184D0BED0B22C20D0BFD0BED0B2D18BD188D0B0D0B5D18220D181D0BAD0BED180D0BED181D182D18C20D0BFD0B5D180D0B5D0B4D0B2D0B8D0B6D0B5D0BDD0B8D18F20D0BDD0B0202473312520D0B820D180D0B0D0B720D0B22024743320D181D0B5D0BA2E20D0B220D182D0B5D187D0B5D0BDD0B8D0B52024642E20D0B2D18BD0B7D18BD0B2D0B0D0B5D18220D0B2D0BED0BAD180D183D0B320D0B8D0B3D180D0BED0BAD0B020D0B2D0B7D180D18BD0B2D18B2C20D0BAD0BED182D0BED180D18BD0B520D0BDD0B0D0BDD0BED181D18FD18220D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD181D18F20D180D18FD0B4D0BED0BC20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BC2024333434343231733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B0D0B9D0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D0B820D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D18ED18220D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD181D18F20D180D18FD0B4D0BED0BC20D181D0BED18ED0B7D0BDD0B8D0BAD0B0D0BC2024333434343232733120D0B5D0B42E20D0B7D0B4D0BED180D0BED0B2D18CD18F2E00D0A1D0BAD0BED180D0BED181D182D18C20D0BFD0B5D180D0B5D0B4D0B2D0B8D0B6D0B5D0BDD0B8D18F20D0BFD0BED0B2D18BD188D0B5D0BDD0B020D0BDD0B020247331252E20D0A0D0B0D0B720D0B22024743320D181D0B5D0BA2E20D0BDD0B0D0BDD0BED181D0B8D18220D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD181D18F20D180D18FD0B4D0BED0BC20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BC2024333434343231733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B0D0B9D0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D0B820D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D18220D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD181D18F20D180D18FD0B4D0BED0BC20D181D0BED18ED0B7D0BDD0B8D0BAD0B0D0BC2024333434343232733120D0B5D0B42E20D0B7D0B4D0BED180D0BED0B2D18CD18F2E00, 38134), -- Spell
(3205218938, 43287, 'ruRU', 0x4741525249534F4E5F464F4C4C4F5745525F4F4E5F4D495353494F4E5F434F4D504C45544500D09DD0B020D0B7D0B0D0B4D0B0D0BDD0B8D0B820E2809320D0B2D18BD0BFD0BED0BBD0BDD0B5D0BDD0BE0001, 38134), -- GlobalStrings
(3205218938, 43286, 'ruRU', 0x4741525249534F4E5F464F4C4C4F5745525F4D495353494F4E5F434F4D504C4554454400D092D18BD0BFD0BED0BBD0BDD0B5D0BDD0BE0001, 38134), -- GlobalStrings
(3205218938, 43283, 'ruRU', 0x434F56454E414E545F464F4C4C4F5745525F4D495353494F4E5F434F4D504C45544500D09220D0BFD180D0B8D0BAD0BBD18ED187D0B5D0BDD0B8D0B82028D0B7D0B0D0B2D0B5D180D188D0B5D0BDD0BE290001, 38134), -- GlobalStrings
(261693969, 59853, 'ruRU', 0xFFFFFFFFFFFFFFFFD098D181D182D0BED180D0B8D0B820D0B7D0B020D187D0B0D0B5D0BC3A20D0A1D0B8D0B1D0B8D0BBD0BBD0B020D09FD0BED182D0B5D180D18FD0BDD0BDD0B0D18F0000CDE900007599F633010000000000FFFF00000000000000000000000000000000000000000000000000000000000000000000000000000000F88700006D000000450300000000000003000000000129020000000000000000000000000000000000000000, 38134), -- QuestV2CliTask
(261693969, 59852, 'ruRU', 0xFFFFFFFFFFFFFFFFD098D181D182D0BED180D0B8D0B820D0B7D0B020D187D0B0D0B5D0BC3A20D093D0B0D0B1D0B1D0B8D0BDD18120D0B820D0A2D0B0D0B1D0B1D0B8D0BDD1810000CCE900007499F533010000000000FFFF00000000000000000000000000000000000000000000000000000000000000000000000000000000F78700006D000000450300000000000003000000000129020000000000000000000000000000000000000000, 38134), -- QuestV2CliTask
(261693969, 59850, 'ruRU', 0xFFFFFFFFFFFFFFFFD098D181D182D0BED180D0B8D0B820D0B7D0B020D187D0B0D0B5D0BC3A20D092D183D0BBD0BAD0B00000CAE900007299F433010000000000FFFF00000000000000000000000000000000000000000000000000000000000000000000000000000000F78700006D000000450300000000000003000000000129020000000000000000000000000000000000000000, 38134), -- QuestV2CliTask
(261693969, 59848, 'ruRU', 0xFFFFFFFFFFFFFFFFD098D181D182D0BED180D0B8D0B820D0B7D0B020D187D0B0D0B5D0BC3A20D0A2D0B5D0BED182D0B0D1800000C8E900007199F333010000000000FFFF00000000000000000000000000000000000000000000000000000000000000000000000000000000F78700006D000000450300000000000003000000000129020000000000000000000000000000000000000000, 38134), -- QuestV2CliTask
(3776013982, 320740, 'ruRU', 0x000000, 38134), -- Spell
(3776013982, 350249, 'ruRU', 0x00D098D181D0BAD0B0D0B6D0B0D0B5D18220D182D0B5D187D0B5D0BDD0B8D0B520D0B2D180D0B5D0BCD0B5D0BDD0B82C20D0BDD0B0202473312520D0BFD0BED0B2D18BD188D0B0D18F20D181D0BAD0BED180D0BED181D182D18C20D18320D0B2D0B0D18120D0B820D0B2D0B0D188D0B8D18520D0B7D0B5D180D0BAD0B0D0BBD18CD0BDD18BD18520D0BAD0BED0BFD0B8D0B920D0BDD0B02024313130393039642E00D0A1D0BAD0BED180D0BED181D182D18C20D0BFD0BED0B2D18BD188D0B5D0BDD0B020D0BDD0B020247731252E20243F2457343E305BD0A1D0BAD0BED180D0BED181D182D18C20D182D0B5D187D0B5D0BDD0B8D18F20D0B2D180D0B5D0BCD0B5D0BDD0B820D0BFD0BED0B2D18BD188D0B5D0BDD0B020D0BDD0B020247734252E5D5B5D00, 38134), -- Spell
(3776013982, 320914, 'ruRU', 0x0022D09CD0B0D0BDD0B8D0BFD183D0BBD18FD186D0B8D0B820D181D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B5D0BC2220D0B4D0B0D18ED18220D0B2D0B0D0BC20D0B820D0B2D0B0D188D0B8D0BC20D0B7D0B5D180D0BAD0B0D0BBD18CD0BDD18BD0BC20D0B8D0B7D0BED0B1D180D0B0D0B6D0B5D0BDD0B8D18FD0BC20D0B4D0BED0BFD0BED0BBD0BDD0B8D182D0B5D0BBD18CD0BDD0BED0B52022D098D181D0BAD0B0D0B6D0B5D0BDD0B8D0B520D0B2D180D0B5D0BCD0B5D0BDD0B82220D18120D18DD184D184D0B5D0BAD182D0B8D0B2D0BDD0BED181D182D18CD18E20247331252E20D0ADD182D0BED18220D18DD184D184D0B5D0BAD18220D0BDD0B520D0B7D0B0D0B2D0B8D181D0B8D18220D0BED1822022D092D180D0B5D0BCD0B5D0BDD0BDD0BED0B3D0BE20D181D0B4D0B2D0B8D0B3D0B02220D0B8D0BBD0B820D0B4D180D183D0B3D0B8D18520D0BFD0BED0B4D0BED0B1D0BDD18BD18520D18DD184D184D0B5D0BAD182D0BED0B22E0022D09CD0B0D0BDD0B8D0BFD183D0BBD18FD186D0B8D0B820D181D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B5D0BC2220D0B4D0B0D18ED18220D0B2D0B0D0BC20D0B820D0B2D0B0D188D0B8D0BC20D0B7D0B5D180D0BAD0B0D0BBD18CD0BDD18BD0BC20D0B8D0B7D0BED0B1D180D0B0D0B6D0B5D0BDD0B8D18FD0BC20D0B4D0BED0BFD0BED0BBD0BDD0B8D182D0B5D0BBD18CD0BDD0BED0B52022D098D181D0BAD0B0D0B6D0B5D0BDD0B8D0B520D0B2D180D0B5D0BCD0B5D0BDD0B82220D18120D18DD184D184D0B5D0BAD182D0B8D0B2D0BDD0BED181D182D18CD18E20247331252E20D0ADD182D0BED18220D18DD184D184D0B5D0BAD18220D0BDD0B520D0B7D0B0D0B2D0B8D181D0B8D18220D0BED1822022D092D180D0B5D0BCD0B5D0BDD0BDD0BED0B3D0BE20D181D0B4D0B2D0B8D0B3D0B02220D0B8D0BBD0B820D0B4D180D183D0B3D0B8D18520D0BFD0BED0B4D0BED0B1D0BDD18BD18520D18DD184D184D0B5D0BAD182D0BED0B22E00, 38134), -- Spell
(3893700160, 169, 'ruRU', 0x0F000000E2000000D20000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 168, 'ruRU', 0x0E000000E2000000CF0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 167, 'ruRU', 0x0D000000DF000000CF0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 166, 'ruRU', 0x0C000000DF000000CF0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 165, 'ruRU', 0x0B000000DC000000CB0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 164, 'ruRU', 0x0A000000DC000000CB0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 163, 'ruRU', 0x09000000D8000000C80000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 162, 'ruRU', 0x08000000D8000000C80000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 161, 'ruRU', 0x07000000D5000000C80000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 160, 'ruRU', 0x06000000D2000000C50000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 159, 'ruRU', 0x05000000D2000000C20000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 158, 'ruRU', 0x04000000CF000000C20000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 157, 'ruRU', 0x03000000CB000000BE0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 156, 'ruRU', 0x02000000C8000000BB0000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3893700160, 155, 'ruRU', 0x0100000000000000B70000004D000000, 38134), -- MythicPlusSeasonRewardLevels
(3776013982, 351967, 'ruRU', 0x000000, 38134), -- Spell
(3776013982, 340882, 'ruRU', 0x00D09FD180D0B8D0B7D18BD0B2D0B0D0B5D18220D093D0B0D0B7D0BED0B2D0BED0B3D0BE20D09CD0B5D188D0BAD0B02C20D0B5D181D0BBD0B820D0BED0BD20D183D0BCD0B5D18020D0B8D0BBD0B820D0BFD0BED182D0B5D180D18FD0BBD181D18F2E00D09FD180D0B8D0B7D18BD0B220D093D0B0D0B7D0BED0B2D0BED0B3D0BE20D09CD0B5D188D0BAD0B02C20D0B5D181D0BBD0B820D0BED0BD20D183D0BCD0B5D18020D0B8D0BBD0B820D0BFD0BED182D0B5D180D18FD0BBD181D18F2E00, 38134), -- Spell
(2340571112, 755, 'ruRU', 0xBD000000D51C0000D0040000060000008F1B00000000000000000000, 38134), -- ItemBonusListGroupEntry
(2998606315, 212, 'ruRU', 0x0000000005000000803A09000000000000000000, 38134), -- ScheduledInterval
(3359787322, 20659, 'ruRU', 0xB3500000, 38134); -- WorldState

INSERT INTO `hotfix_blob` (`TableHash`, `RecordId`, `locale`, `Blob`, `VerifiedBuild`) VALUES
(4021368146, 4553, 'ruRU', 0xD091D180D0BED188D0B5D0BDD0BDD0B0D18F20D181D182D0B8D0B3D0B8D18F000000000000000000D8020000424400000000000000000000000000000000000000, 38134), -- Vignette
(2202435563, 997132, 'ruRU', 0x0C370F00240127010000F3170700, 38134), -- QuestPOIPoint
(2202435563, 997131, 'ruRU', 0x0B370F00240128010000F2170700, 38134), -- QuestPOIPoint
(2921112328, 464883, 'ruRU', 0xF31707003B097E06000001E1E9000001000000871306000000000000000000, 38134), -- QuestPOIBlob
(2921112328, 464882, 'ruRU', 0xF21707003B097E06000001E1E9000001000000871306000000000000000000, 38134), -- QuestPOIBlob
(3776013982, 335718, 'ruRU', 0x0022D0A0D18BD0B2D0BED0BA2220D0B82022D092D0BCD0B5D188D0B0D182D0B5D0BBD18CD181D182D0B2D0BE2220D0B4D0B0D18ED18220D0B2D0B0D0BC2022D091D0BBD0BED0BA20D189D0B8D182D0BED0BC2220D0BDD0B020247B2473312F313030307D20D181D0B5D0BA2E20D0B82022D0A0D0B5D0B2D0B0D0BDD188222C20D0B020D182D0B0D0BAD0B6D0B520247B2433333537333473312F31307D20D0B5D0B42E20D18FD180D0BED181D182D0B82E0000, 38134), -- Spell
(2948698321, 339, 'ruRU', 0x6D68C604BDD61274, 38134), -- TactKeyLookup
(2948698321, 278, 'ruRU', 0x7CB28F52811F5830, 38134), -- TactKeyLookup
(3776013982, 328547, 'ruRU', 0xD09DD0B5D0BAD180D0BED0BBD0BED180D0B4D18B00D09FD180D0BED0BDD0B7D0B0D0B5D18220D186D0B5D0BBD18C20D0BAD0BED181D182D18FD0BDD18BD0BC20D188D0B8D0BFD0BED0BC2C20D0BDD0B0D0BDD0BED181D18F2024733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BCD0B3D0BDD0BED0B2D0B5D0BDD0BDD0BE20D0B820D0B5D189D0B52024333234303733733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D0BAD180D0BED0B2D0BED182D0B5D187D0B5D0BDD0B8D18F20D180D0B0D0B720D0B22024333234303733743120D181D0B5D0BA2E2C20D0BFD0BED0BAD0B020D186D0B5D0BBD18C20D0BDD0B520D183D0BCD180D0B5D18220D0B8D0BBD0B820D0BDD0B520D0BFD0BED0BAD0B8D0BDD0B5D18220D0B1D0BED0B92E0D0A0D0AD09AD0BED0B3D0B4D0B020D186D0B5D0BBD18C20D0BFD0BED0B3D0B8D0B1D0B0D0B5D1822C20D0B2D0BED0B7D0B2D180D0B0D189D0B0D0B5D182203120D0B7D0B0D180D18FD0B42E0D0A0D0A7C6346464646464646462B3120D0BA20D181D0B5D180D0B8D0B820D0BFD180D0B8D0B5D0BCD0BED0B220D0B820D0B5D189D0B5202B3120D0B7D0B020D0BAD0B0D0B6D0B4D18BD0B920D0B0D0BAD182D0B8D0B2D0BDD18BD0B920D0BAD0BED181D182D18FD0BDD0BED0B920D188D0B8D0BF2E7C720000, 38134), -- Spell
(1369604944, 2081, 'ruRU', 0x000000000000000000000000000000000000000000000000210800006E1C00000000FF2200000000000000002C010000EE0204020000410B0000000000000000002208, 38134), -- SpellVisualMissile
(4033975491, 439153, 'ruRU', 0x00000000000000000000000000000000000000000000000071B3060092001500000000000000000000000000000000000000000000000000000000803F00000000FFFFFFFFFFFF00000C000000000000000000000000FF340200, 38134), -- SpellVisualKitModelAttach
(4033975491, 439152, 'ruRU', 0x00000000000000000000000000000000000000000000000070B3060092001600000000000000000000000000000000000000000000000000000000803F00000000FFFFFFFFFFFF00000C000000000000000000000000FF340200, 38134), -- SpellVisualKitModelAttach
(1181150530, 377991, 'ruRU', 0x050000001ABB020096D20100, 38134), -- SpellVisualKitEffect
(1181150530, 377990, 'ruRU', 0x0500000019BB0200F3290200, 38134), -- SpellVisualKitEffect
(1181150530, 377988, 'ruRU', 0x0500000019BB020054180200, 38134), -- SpellVisualKitEffect
(1181150530, 377987, 'ruRU', 0x0500000018BB020088F60100, 38134), -- SpellVisualKitEffect
(1181150530, 377986, 'ruRU', 0x0500000017BB020088F60100, 38134), -- SpellVisualKitEffect
(1181150530, 377985, 'ruRU', 0x0500000016BB0200820F0200, 38134), -- SpellVisualKitEffect
(1181150530, 377984, 'ruRU', 0x0500000015BB02009FFA0100, 38134), -- SpellVisualKitEffect
(1181150530, 377983, 'ruRU', 0x050000006C4E01004B4B0100, 38134), -- SpellVisualKitEffect
(1181150530, 377982, 'ruRU', 0x0200000071B30600FF340200, 38134), -- SpellVisualKitEffect
(1181150530, 377981, 'ruRU', 0x0200000070B30600FF340200, 38134), -- SpellVisualKitEffect
(1181150530, 377980, 'ruRU', 0x05000000EFCC0100FF340200, 38134), -- SpellVisualKitEffect
(1181150530, 377979, 'ruRU', 0x06000000B7D20500FF340200, 38134), -- SpellVisualKitEffect
(1181150530, 377978, 'ruRU', 0x0500000014BB020052F20100, 38134), -- SpellVisualKitEffect
(1181150530, 377977, 'ruRU', 0x0500000013BB0200D8030200, 38134), -- SpellVisualKitEffect
(3425193231, 278473, 'ruRU', 0x060000000D0000000000000000000000000000000000000002000000494B01001EA30100, 38134), -- SpellVisualEvent
(3425193231, 278472, 'ruRU', 0x060000000D0000000000000000000000000000000000000001000000494B01001EA30100, 38134), -- SpellVisualEvent
(3425193231, 278471, 'ruRU', 0x030000000D0000000000000000000000000000000000000001000000FF3402001EA30100, 38134), -- SpellVisualEvent
(3425193231, 278470, 'ruRU', 0x010000000200000000000000000000000000000000000000010000004A4B01001EA30100, 38134), -- SpellVisualEvent
(859088734, 381623, 'ruRU', 0xFFFFFFFF360000000000, 38134), -- SpellVisualAnim
(4146370265, 107294, 'ruRU', 0x0000000000000000000000000000000000000000000000000000000000000000FF22000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SpellVisual
(3266400455, 613060, 'ruRU', 0x1ABB02002C713500010000803F, 38134), -- SoundKitEntry
(3266400455, 613059, 'ruRU', 0x1ABB02002B713500010000803F, 38134), -- SoundKitEntry
(3266400455, 613058, 'ruRU', 0x1ABB02002A713500010000803F, 38134), -- SoundKitEntry
(3266400455, 613057, 'ruRU', 0x1ABB020029713500010000803F, 38134), -- SoundKitEntry
(3266400455, 613056, 'ruRU', 0x1ABB020028713500010000803F, 38134), -- SoundKitEntry
(3266400455, 613055, 'ruRU', 0x19BB0200BC6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613054, 'ruRU', 0x19BB0200BB6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613053, 'ruRU', 0x19BB0200BA6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613052, 'ruRU', 0x19BB0200B96A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613051, 'ruRU', 0x19BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613050, 'ruRU', 0x19BB0200B76A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613049, 'ruRU', 0x19BB0200B66A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613043, 'ruRU', 0x18BB0200BB6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613042, 'ruRU', 0x18BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613041, 'ruRU', 0x18BB0200BA6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613040, 'ruRU', 0x18BB0200B96A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613039, 'ruRU', 0x18BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613038, 'ruRU', 0x17BB0200BB6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613037, 'ruRU', 0x17BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613036, 'ruRU', 0x17BB0200BA6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613035, 'ruRU', 0x17BB0200B96A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613034, 'ruRU', 0x17BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613033, 'ruRU', 0x16BB0200BC6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613032, 'ruRU', 0x16BB0200BB6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613031, 'ruRU', 0x16BB0200BA6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613030, 'ruRU', 0x16BB0200B96A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613029, 'ruRU', 0x16BB0200B86A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613028, 'ruRU', 0x16BB0200B76A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613027, 'ruRU', 0x16BB0200B66A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613018, 'ruRU', 0x15BB0200C36A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613017, 'ruRU', 0x15BB0200C26A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613016, 'ruRU', 0x15BB0200C16A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613015, 'ruRU', 0x15BB0200C06A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613014, 'ruRU', 0x15BB0200BF6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613013, 'ruRU', 0x15BB0200BE6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613012, 'ruRU', 0x15BB0200BD6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613011, 'ruRU', 0x14BB02004AE21900010000803F, 38134), -- SoundKitEntry
(3266400455, 613010, 'ruRU', 0x14BB02004BE21900010000803F, 38134), -- SoundKitEntry
(3266400455, 613009, 'ruRU', 0x14BB02004CE21900010000803F, 38134), -- SoundKitEntry
(3266400455, 613008, 'ruRU', 0x13BB0200C36A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613007, 'ruRU', 0x13BB0200C26A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613006, 'ruRU', 0x13BB0200C16A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613005, 'ruRU', 0x13BB0200C06A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613004, 'ruRU', 0x13BB0200BF6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613003, 'ruRU', 0x13BB0200BE6A3500010000803F, 38134), -- SoundKitEntry
(3266400455, 613002, 'ruRU', 0x13BB0200BD6A3500010000803F, 38134), -- SoundKitEntry
(3232102598, 140456, 'ruRU', 0xA82402001ABB02000000A040000000410000000000000000000000000000000000000000020000000000000000E8030000E8030000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000F4010000F4010000580C00000000803F010000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140455, 'ruRU', 0xA7240200AF6C02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140454, 'ruRU', 0xA6240200C06502000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140453, 'ruRU', 0xA5240200D07102000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140452, 'ruRU', 0xA424020019BB02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140451, 'ruRU', 0xA3240200020A00000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140450, 'ruRU', 0xA224020018BB02000000A040000000410000000000000000000000000000000000000000020000000000000000E8030000E8030000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140449, 'ruRU', 0xA124020017BB02000000A040000000410000000000000000000000000000000000000000020000000000000000F4010000F4010000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140448, 'ruRU', 0xA02402003E7502000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140447, 'ruRU', 0x9F240200447502000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140446, 'ruRU', 0x9E24020016BB02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000100FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140445, 'ruRU', 0x9D24020015BB02000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140444, 'ruRU', 0x9C240200B9710200000040410000C04100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140443, 'ruRU', 0x9B240200956C02000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140442, 'ruRU', 0x9A240200177202000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140441, 'ruRU', 0x99240200F46F02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140440, 'ruRU', 0x98240200817202000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140439, 'ruRU', 0x97240200557102000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140438, 'ruRU', 0x96240200ED6602000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140437, 'ruRU', 0x952402001E7102000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140436, 'ruRU', 0x94240200E56602000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140435, 'ruRU', 0x9324020014BB02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140434, 'ruRU', 0x9224020013BB02000000A040000000410000000000000000000000000000000000000000020000000000000000F4010000F4010000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140433, 'ruRU', 0x91240200666C02000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 140432, 'ruRU', 0x90240200267102000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123926, 'ruRU', 0x16E40100407602000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000002C01000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123714, 'ruRU', 0x42E30100437502000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000101F4010000F4010000570C0000E8030000E8030000580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123675, 'ruRU', 0x1BE30100457502000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123670, 'ruRU', 0x16E301003D7502000000A04000002041000000000000000000000000000000000000000002E6000000E6000000E6000000E6000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123594, 'ruRU', 0xCAE20100F17402000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123515, 'ruRU', 0x7BE20100A27402000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000002C01000000000000000000000001C8000000C8000000570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123514, 'ruRU', 0x7AE20100A17402000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000009600000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123504, 'ruRU', 0x70E201009F7402000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001401F0000401F0000570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123503, 'ruRU', 0x6FE201009E7402000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000002C010000000000000000000000016400000064000000570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 123502, 'ruRU', 0x6EE201009D7402000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000009600000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122935, 'ruRU', 0x37E00100507202000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000100FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122901, 'ruRU', 0x15E00100167202000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000100FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122891, 'ruRU', 0x0BE00100187202000000C0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122821, 'ruRU', 0xC5DF0100D1710200000000400000804000000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122814, 'ruRU', 0xBEDF0100C87102000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122807, 'ruRU', 0xB7DF0100C17102000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001BC020000BC020000570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122806, 'ruRU', 0xB6DF0100C07102000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122804, 'ruRU', 0xB4DF0100BE7102000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000009600000000000000000000000001C8000000C8000000570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122709, 'ruRU', 0x55DF01004A7102000000C0400000404100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122629, 'ruRU', 0x05DF0100F97002000000A0400000004100000000000000000000000000000000000000000200000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B44300000000000000C800000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 122404, 'ruRU', 0x24DE0100F56F02000000C0400000404100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000B80B0000B80B0000580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 121643, 'ruRU', 0x2BDB0100D76C02000000803F0000004000000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B4430000000000000000000000000000000000000001012C0100002C010000570C0000E8030000E8030000580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 121613, 'ruRU', 0x0DDB0100976C02000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B4430000000000000000000000000000000000000000012C0100002C010000570C0000FFFFFFFFFFFFFFFF580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 121609, 'ruRU', 0x09DB0100906C02000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000B80B0000B80B0000580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 121587, 'ruRU', 0xF3DA0100686C02000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001F4010000F4010000570C0000E8030000E8030000580C00000000803F020000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 120239, 'ruRU', 0xAFD50100E66602000000C040000040410000000000000000000000000000000000000000000000000000000000F4010000F4010000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000001E8030000E8030000570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 119974, 'ruRU', 0xA6D40100D66502000000A0400000004100000000000000000000000000000000000000000000000000000000000000000000000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000002FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000803F00000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(3232102598, 25856, 'ruRU', 0x00650000C9E600000000A04000002041000000000000000000000000000000000000000002E6000000E6000000E6000000E6000000000000803F0000803F0000803F0000803F0000803F0000803F0000803F000000000000000000000000000000000000B4430000B443000000000000000000000000000000000000000000FFFFFFFFFFFFFFFF570C0000FFFFFFFFFFFFFFFF580C00000000803F000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 38134), -- SoundKitAdvanced
(1485693696, 5565, 'ruRU', 0x1ABB0200010000000069620000000000000100, 38134); -- SoundEnvelope
