delete from creature where id = 58998;

update creature_template set speed_walk = '3.5', ScriptName = 'boss_armsmaster_harlan' where entry = 58632;
update creature_template set ScriptName = 'npc_scarlet_defender' where entry = 58998;
update creature_model_info set gender = 1 where modelid = 40777;

delete from spell_target_position where id in (111755, 111756, 111219);
INSERT INTO `spell_target_position` (`id`, `target_map`, `target_position_x`, `target_position_y`, `target_position_z`, `target_orientation`) VALUES 
(111755, 1001, 1186.67, 445.343, 11.1778, 5.82266),
(111756, 1001, 1186.58, 442.413, 11.178, 0.355906),
(111219, 1001, 1206.43, 443.96, 1, 0);

delete from spell_script_names where spell_id = 113959;
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES 
(113959, 'spell_heavy_armor');

delete from conditions where SourceTypeOrReferenceId = 13 and SourceEntry = 112955;
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES 
(13, 1, 112955, 0, 0, 31, 0, 3, 58632, 0, 0, 0, '', NULL),
(13, 2, 112955, 0, 0, 31, 0, 4, 0, 0, 0, 0, '', NULL),
(13, 2, 112955, 0, 1, 31, 0, 3, 58998, 0, 0, 0, '', NULL);

delete from spell_trigger_dummy where spell_id = 111394;
INSERT INTO `spell_trigger_dummy` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `aura`, `chance`, `group`, `check_spell_id`, `comment`) VALUES 
(111394, 111215, 14, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 'Blades of Light Damage'),
(111394, 112955, 14, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 'Blades of Light RideVehicle');

delete from waypoint_data where id in (5863200, 5863201);
INSERT INTO `waypoint_data` (`id`, `point`, `position_x`, `position_y`, `position_z`, `orientation`, `delay`, `move_flag`, `action`, `action_chance`, `entry`, `wpguid`) VALUES 
(5863200, 1, 1205.35, 431.195, 1.06103, 0, 0, 0, 0, 100, 0, 0),
(5863200, 2, 1195.87, 437.1, 1.05259, 0, 0, 0, 0, 100, 0, 0),
(5863200, 3, 1194.41, 447.783, 1.05247, 0, 0, 0, 0, 100, 0, 0),
(5863200, 4, 1200.84, 455.712, 1.06415, 0, 0, 0, 0, 100, 0, 0),
(5863200, 5, 1211.53, 456.29, 2.75325, 0, 0, 0, 0, 100, 0, 0),
(5863200, 6, 1220.39, 446.967, 6.08079, 0, 0, 0, 0, 100, 0, 0),
(5863200, 7, 1224.46, 437.05, 6.08085, 0, 0, 0, 0, 100, 0, 0),
(5863200, 8, 1218.86, 429.775, 6.08085, 0, 0, 0, 0, 100, 0, 0),
(5863200, 9, 1206.67, 425.232, 6.19905, 0, 0, 0, 0, 100, 0, 0),
(5863200, 10, 1192.41, 430.597, 9.32979, 0, 0, 0, 0, 100, 0, 0),
(5863200, 11, 1187.14, 443.174, 11.1778, 0, 0, 0, 0, 100, 0, 0),
(5863200, 12, 1191.35, 456.179, 9.64075, 0, 0, 0, 0, 100, 0, 0),
(5863200, 13, 1201.61, 462.744, 7.28935, 0, 0, 0, 0, 100, 0, 0),
(5863200, 14, 1216.87, 459.53, 6.08286, 0, 0, 0, 0, 100, 0, 0),
(5863200, 15, 1224.59, 448.778, 6.08286, 0, 0, 0, 0, 100, 0, 0),
(5863200, 16, 1218.65, 437.864, 5.35001, 0, 0, 0, 0, 100, 0, 0),
(5863200, 17, 1207.03, 431.759, 1.50974, 0, 0, 0, 0, 100, 0, 0),
(5863200, 18, 1194.78, 443.55, 1.02518, 0, 0, 0, 0, 100, 0, 0),
(5863200, 19, 1206.44, 443.962, 0.987909, 0, 0, 0, 0, 100, 0, 0),
(5863201, 1, 1203.82, 455.695, 1.03663, 0, 0, 0, 0, 100, 0, 0),
(5863201, 2, 1195.03, 447.135, 1.02941, 0, 0, 0, 0, 100, 0, 0),
(5863201, 3, 1202.51, 432.784, 1.03236, 0, 0, 0, 0, 100, 0, 0),
(5863201, 4, 1212.33, 432.369, 2.97427, 0, 0, 0, 0, 100, 0, 0),
(5863201, 5, 1220.33, 440.128, 6.05169, 0, 0, 0, 0, 100, 0, 0),
(5863201, 6, 1223.06, 452.74, 6.08273, 0, 0, 0, 0, 100, 0, 0),
(5863201, 7, 1215.87, 460.121, 6.08273, 0, 0, 0, 0, 100, 0, 0),
(5863201, 8, 1203.58, 463.295, 6.90848, 0, 0, 0, 0, 100, 0, 0),
(5863201, 9, 1192.78, 458.068, 9.19723, 0, 0, 0, 0, 100, 0, 0),
(5863201, 10, 1187.04, 445.936, 11.1777, 0, 0, 0, 0, 100, 0, 0),
(5863201, 11, 1190.47, 431.773, 9.73553, 0, 0, 0, 0, 100, 0, 0),
(5863201, 12, 1202.76, 425.26, 7.068, 0, 0, 0, 0, 100, 0, 0),
(5863201, 13, 1215.01, 426.83, 6.08293, 0, 0, 0, 0, 100, 0, 0),
(5863201, 14, 1223.39, 435.676, 6.08293, 0, 0, 0, 0, 100, 0, 0),
(5863201, 15, 1219.79, 447.598, 6.08293, 0, 0, 0, 0, 100, 0, 0),
(5863201, 16, 1212.12, 455.131, 2.97847, 0, 0, 0, 0, 100, 0, 0),
(5863201, 17, 1202.33, 454.151, 1.0082, 0, 0, 0, 0, 100, 0, 0),
(5863201, 18, 1193.97, 444.377, 1.04697, 0, 0, 0, 0, 100, 0, 0),
(5863201, 19, 1206.44, 443.962, 0.987909, 0, 0, 0, 0, 100, 0, 0);

delete from creature_text where entry = 58632;
INSERT INTO `creature_text` (`entry`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `comment`) VALUES
(58632, 0, 0, 'Ха-ха-ха! Еще одна возможность испытать свою силу!', 14, 0, 100, 0, 0, 29428, 'Воитель Гарлан to 0'),
(58632, 1, 0, 'Защищайтесь!', 14, 0, 100, 0, 0, 29426, 'Воитель Гарлан to 0'),
(58632, 2, 0, '|TInterface\\Icons\\ability_warrior_battleshout.blp:20|tВоитель Гарлан призывает себе на помощь двух своих союзников!', 41, 0, 100, 0, 0, 0, 'Воитель Гарлан to 0'),
(58632, 3, 0, '|TInterface\\Icons\\inv_weapon_halberd_05.blp:20|tВоитель Гарлан использует |cFFFF0000|Hspell:111216|h[клинки света]|h|r!', 41, 0, 100, 0, 0, 0, 'Воитель Гарлан to 0'),
(58632, 4, 0, 'Вы погибли от |cFFFF0000|Hspell:|h[клинков света]|h|r воителя Гарлана. Используя эту способность, воитель Гарлан передвигается в одном из двух направлений. Постарайтесь понять, куда он направляется, и уйти у него с пути.', 42, 0, 100, 0, 0, 29430, 'Воитель Гарлан to Player'),
(58632, 5, 0, 'Надо было больше тренироваться.', 14, 0, 100, 0, 0, 29430, 'Воитель Гарлан to Player');