/*
SQLyog Professional v11.24 (64 bit)
MySQL - 5.5.31-0+wheezy1 : Database - trinworld505
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
/*Table structure for table `spell_pet_auras` */

DROP TABLE IF EXISTS `spell_pet_auras`;

CREATE TABLE `spell_pet_auras` (
  `petEntry` mediumint(8) NOT NULL,
  `spellId` mediumint(8) NOT NULL,
  `option` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `target` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `bp0` float NOT NULL DEFAULT '0',
  `bp1` float NOT NULL DEFAULT '0',
  `bp2` float NOT NULL DEFAULT '0',
  `aura` mediumint(8) NOT NULL DEFAULT '0',
  `comment` text NOT NULL,
  PRIMARY KEY (`petEntry`,`spellId`,`option`,`aura`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `spell_pet_auras` */

insert ignore into `spell_pet_auras`(`petEntry`,`spellId`,`option`,`target`,`bp0`,`bp1`,`bp2`,`aura`,`comment`) values 
(26125,47466,0,0,0,0,0,0,'Восставший союзник - Самооглушение восставшего вурдалака'),
(58959,115578,0,0,0,0,0,0,'Бес Скверны - Гримуар верховной власти'),
(58960,115578,0,0,0,0,0,0,'Повелитель Бездны - Гримуар верховной власти'),
(58963,115578,0,0,0,0,0,0,'Шиварра - Гримуар верховной власти'),
(58963,114355,0,0,0,0,0,0,'Шиварра - Бой с оружием в каждой руке (Пассивная)'),
(58964,115578,0,0,0,0,0,0,'Созерцатель - Гримуар верховной власти'),
(58965,115578,0,0,0,0,0,0,'Страж гнева - Гримуар верховной власти'),
(58965,114355,0,0,0,0,0,0,'Страж гнева - Бой с оружием в каждой руке (Пассивная)'),
-- Гримуар верховной власти
(58960,119904,0,0,119907,0,0,0,'Повелитель Бездны - Приказание демону - Обезоруживание'),
(58963,119904,0,0,119913,0,0,0,'Шиварра - Приказание демону - Кнут Скверны'),
(58964,119904,0,0,119911,0,0,0,'Созерцатель - Приказание демону - Оптический удар'),
(58965,119904,0,0,119915,0,0,0,'Страж гнева - Приказание демону - Буря гнева'),
(58959,119904,0,0,119905,0,0,0,'Бес Скверны - Приказание демону - Прижигание ран хозяина'),
-- Приказание демону просто петы
(1860,119904,0,0,119907,0,0,0,'Демон Бездны - Приказание демону - Обезоруживание'),
(1863,119904,0,0,119909,0,0,0,'Суккуба - Приказание демону - Удар кнутом'),
(417,119904,0,0,119910,0,0,0,'Охотник Скверны - Приказание демону - Запрет чар'),
(17252,119904,0,0,119914,0,0,0,'Страж Скверны - Приказание демону - Буря Скверны'),
(416,119904,0,0,119905,0,0,0,'Бес - Приказание демону - Прижигание ран хозяина'),
-- Гримуар жертвоприношения
(1860,119904,0,0,132413,0,0,0,'Демон Бездны - Приказание демону - Обезоруживание'),
(1863,119904,0,0,132409,0,0,0,'Суккуба - Приказание демону - Удар кнутом'),
(417,119904,0,0,132412,0,0,0,'Охотник Скверны - Приказание демону - Запрет чар'),
(17252,119904,0,0,132410,0,0,0,'Страж Скверны - Приказание демону - Буря Скверны'),
(416,119904,0,0,132411,0,0,0,'Бес - Приказание демону - Прижигание ран хозяина');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
