-- Teleports reward
DELETE FROM `achievement_reward` WHERE `entry` in (6907, 6901, 6910, 6913, 6904, 6916, 6919, 6891, 6887);
INSERT INTO `achievement_reward` (`entry`, `title_A`, `title_H`, `learnSpell`, `item`, `sender`, `subject`, `text`) VALUES 
('6907', '0', '0', '131225', '0', '0', NULL, 'Врата Заходящего Солнца: золото'), 
('6901', '0', '0', '131222', '0', '0', NULL, 'Дворец Могу''шан: золото'), 
('6910', '0', '0', '131231', '0', '0', NULL, 'Залы Алого ордена: золото'), 
('6913', '0', '0', '131229', '0', '0', NULL, 'Монастырь Алого ордена: золото'), 
('6904', '0', '0', '131206', '0', '0', NULL, 'Монастырь Шадо-Пан: золото'), 
('6916', '0', '0', '131232', '0', '0', NULL, 'Некроситет: золото'), 
('6919', '0', '0', '131228', '0', '0', NULL, 'Осада храма Нюцзао: золото'), 
('6891', '0', '0', '131205', '0', '0', NULL, 'Хмелеварня Буйных Портеров: золото'), 
('6887', '0', '0', '131204', '0', '0', NULL, 'Храм Нефритовой Змеи: золото');

-- Teleports coordinates
INSERT IGNORE INTO `spell_target_position` (`id`, `target_map`, `target_position_x`, `target_position_y`, `target_position_z`, `target_orientation`) VALUES 
('131225', '870', '654', '2080', '371', '6.25'),
('131204', '870', '961', '-2463', '181', '4.46'),
('131205', '870', '-704', '1265', '137', '3.46'),
('131206', '870', '3631', '2538', '770', '0.4'),
('131231', '0', '2892', '-812', '161', '2.6'),
('131229', '0', '2897', '-807', '161', '3.5'),
('131232', '0', '1257', '-2584', '93', '0.4'),
('131228', '870', '1333', '4972', '125', '1'),
('131222', '870', '1346 ', '487', '458', '5.4');