delete from instance_template where map = 1031;
INSERT INTO `instance_template` (`map`, `parent`, `script`, `allowMount`) VALUES 
(1031, 0, 'instance_arena_of_annihilation', 1);

delete from creature_template where entry in (63316,64280,64281);
INSERT INTO `creature_template` (`entry`, `difficulty_entry_1`, `difficulty_entry_2`, `difficulty_entry_3`, `KillCredit1`, `KillCredit2`, `modelid1`, `modelid2`, `modelid3`, `modelid4`, `name`, `subname`, `IconName`, `gossip_menu_id`, `minlevel`, `maxlevel`, `exp`, `exp_unk`, `faction_A`, `faction_H`, `npcflag`, `npcflag2`, `speed_walk`, `speed_run`, `speed_fly`, `scale`, `rank`, `mindmg`, `maxdmg`, `dmgschool`, `attackpower`, `dmg_multiplier`, `baseattacktime`, `rangeattacktime`, `unit_class`, `unit_flags`, `unit_flags2`, `dynamicflags`, `family`, `trainer_type`, `trainer_spell`, `trainer_class`, `trainer_race`, `minrangedmg`, `maxrangedmg`, `rangedattackpower`, `type`, `type_flags`, `type_flags2`, `lootid`, `pickpocketloot`, `skinloot`, `resistance1`, `resistance2`, `resistance3`, `resistance4`, `resistance5`, `resistance6`, `spell1`, `spell2`, `spell3`, `spell4`, `spell5`, `spell6`, `spell7`, `spell8`, `PetSpellDataId`, `VehicleId`, `mingold`, `maxgold`, `AIName`, `MovementType`, `InhabitType`, `HoverHeight`, `Health_mod`, `Mana_mod`, `Mana_mod_extra`, `Armor_mod`, `RacialLeader`, `questItem1`, `questItem2`, `questItem3`, `questItem4`, `questItem5`, `questItem6`, `movementId`, `RegenHealth`, `equipment_id`, `mechanic_immune_mask`, `flags_extra`, `ScriptName`, `WDBVerified`) VALUES 
(63316, 0, 0, 0, 64894, 0, 42936, 0, 0, 0, 'Cloudbender Kobo', 'Monkey Monk', '', 0, 90, 90, 4, 1, 16, 16, 0, 0, 1, 1.4, 1.2, 1, 1, 1268, 1752, 0, 230, 250, 2000, 2000, 1, 33024, 2099200, 0, 0, 0, 0, 0, 0, 490, 734, 184, 7, 2149580872, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 1, 20, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 144, 1, 63316, 617297919, 0, 'boss_cloudbender_kobo', 16357),
(64280, 0, 0, 0, 64894, 0, 43508, 0, 0, 0, 'Maki Waterblade', 'Saurok Samurai', '', 0, 90, 90, 4, 1, 16, 16, 0, 0, 1, 1.4, 1.2, 1, 1, 1268, 1752, 0, 230, 250, 2000, 2000, 1, 33024, 2099200, 0, 0, 0, 0, 0, 0, 490, 734, 184, 7, 2097224, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 1, 20, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 144, 1, 64280, 617299967, 0, 'boss_maki_waterblade', 16357),
(64281, 0, 0, 0, 64894, 0, 43509, 0, 0, 0, 'Satay Byu', 'Jinyu Jinja', '', 0, 90, 90, 4, 0, 16, 16, 2097224, 0, 1, 1.4, 1.2, 1, 1, 1268, 1752, 0, 230, 250, 2000, 2000, 4, 33024, 2099200, 0, 0, 0, 0, 0, 0, 490, 734, 184, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 1, 20, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 134, 1, 64281, 617299967, 0, 'boss_satay_byu', 17055);

update creature_template set InhabitType = 7 where entry in (63334,61211,30140,63314, 41206);
update creature_template set flags_extra = 130 where entry in (41206, 64308, 66991);
update creature_template set speed_run = 1.5, ScriptName = 'boss_scar_shell' where entry = 63311;
update creature_template set ScriptName = 'boss_jolgrum' where entry = 63312;
update creature_template set ScriptName = 'boss_little_liuyang' where entry = 63313;
update creature_template set ScriptName = 'boss_chagan_firehoof' where entry = 63318;
update creature_template set minlevel = 92, maxlevel = 92, ScriptName = 'npc_chagan_batu' where entry = 63872;
update creature_template set ScriptName = 'npc_chagan_trailblaze', flags_extra = 130 where entry = 63544;
update creature_template set minlevel = 92, maxlevel = 92, ScriptName = 'npc_kobo_twister' where entry = 66991;
update creature_template set ScriptName = 'npc_scenario_gurgthock' where entry = 63315;
update creature_template set mindmg = 1268, maxdmg = 1752, dmg_multiplier = 200 where entry in (63311, 63312, 63313, 63318);

delete from spell_script_names where spell_id in (123933,123960,125582);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES 
(123933, 'spell_jolgrum_ill_tempered'),
(123960, 'spell_liuyang_flameline'),
(125582, 'spell_jade_lightning_strike');

delete from areatrigger_scripts where entry = 8151;
INSERT INTO `areatrigger_scripts` (`entry`, `ScriptName`) VALUES 
(8151, 'at_enter_arena_annihilation');

delete from npc_spellclick_spells where npc_entry = 63872;
INSERT INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES 
(63872, 46598, 1, 0);

DELETE FROM `creature_template_addon` WHERE `entry` IN (63334, 30140, 63314, 64281, 64280, 63316, 64308);
INSERT INTO `creature_template_addon` (`entry`, `mount`, `bytes1`, `bytes2`, `auras`) VALUES
(63334, 0, 0x1, 0x1, ''),
(30140, 0, 0x1, 0x1, ''),
(63314, 0, 0x1, 0x1, ''),
(64281, 0, 0x0, 0x1, '125495'),
(64280, 0, 0x0, 0x1, '126732'),
(63316, 0, 0x0, 0x1, '124204'),
(64308, 0, 0x0, 0x1, '125583');
-- (63534, 0, 0x0, 0x1, '123961'),
-- (63539, 0, 0x0, 0x1, '131207');

delete from conditions where SourceTypeOrReferenceId = 13 and SourceEntry = 125628;
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES 
(13, 1, 125628, 0, 0, 31, 0, 3, 64308, 0, 0, 0, '', NULL);

delete from creature_equip_template where entry = 64280;
INSERT INTO `creature_equip_template` (`entry`, `itemEntry1`, `itemEntry2`, `itemEntry3`) VALUES 
(64280, 86310, 0, 0);

DELETE FROM `creature` WHERE map = 1031;
INSERT INTO `creature` (`id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `MovementType`) VALUES
(61211, 1031, 4096, 1, 3819.494, 485.908, 658.951, 1.908682, 7200, 0, 0), -- 61211 (Area: 6219)
(30140, 1031, 4096, 1, 3844.458, 523.7847, 645.6863, 3.541431, 7200, 0, 0), -- 30140 (Area: 6219)
(61211, 1031, 4096, 1, 3835.583, 497.9983, 658.951, 2.28196, 7200, 0, 0), -- 61211 (Area: 6219)
(61211, 1031, 4096, 1, 3812.767, 584.4531, 658.951, 4.394857, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3801.226, 578.684, 647.6425, 4.6089, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3798.781, 480.1615, 658.951, 1.690894, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3797.268, 545.717, 665.9597, 4.550542, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3791.921, 586.9445, 658.951, 5.157568, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3758.004, 511.441, 647.6425, 0.5219812, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3778.763, 482.7847, 658.951, 1.171481, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3793.747, 521.5851, 665.9597, 1.429188, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3771.807, 581.625, 658.951, 5.211401, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3791.591, 485.8854, 647.6425, 1.467381, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3760.417, 493.1458, 658.951, 0.8978427, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3808.398, 532.2222, 651.693, 2.99757, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3754.687, 568.4375, 658.951, 5.612719, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3754.853, 564.941, 647.6425, 5.627013, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3848.774, 534.3125, 658.951, 3.165228, 7200, 0, 0), -- 61211 (Area: 6219)
(63334, 1031, 4096, 1, 3852.507, 526.3976, 658.4993, 3.006532, 7200, 0, 0), -- 63334 (Area: 6219)
(61211, 1031, 4096, 1, 3747.805, 510.026, 658.951, 0.5202346, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3784.206, 535.316, 651.693, 6.159401, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3748.353, 560.3073, 658.951, 5.723007, 7200, 0, 0), -- 61211 (Area: 6219)
(61211, 1031, 4096, 1, 3743.006, 519.0174, 658.951, 0.360404, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3841.546, 527.5417, 647.6425, 3.023366, 7200, 0, 0), -- 41206 (Area: 6219)
(61211, 1031, 4096, 1, 3847.402, 520.1129, 658.951, 2.849947, 7200, 0, 0), -- 61211 (Area: 6219)
(61211, 1031, 4096, 1, 3830.219, 574.4913, 658.951, 4.07931, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3820.969, 499.6042, 647.6425, 2.2052, 7200, 0, 0), -- 41206 (Area: 6219)
(63314, 1031, 4096, 1, 3845.083, 527.4011, 645, 3.027428, 7200, 0, 0), -- 63314 (Area: 6219)
(63315, 1031, 4096, 1, 3845.537, 532.2847, 639.7741, 3.406329, 7200, 0, 0), -- 63315 (Area: 6219)
(61211, 1031, 4096, 1, 3843.536, 556.9462, 658.951, 3.586014, 7200, 0, 0), -- 61211 (Area: 6219)
(41206, 1031, 4096, 1, 3828.925, 559.3542, 647.6425, 3.825563, 7200, 0, 0); -- 41206 (Area: 6219)

DELETE FROM `gameobject` WHERE map = 1031;
INSERT INTO `gameobject` (`id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`) VALUES
(211693, 1031, 4096, 1, 3745.493, 539.7227, 639.0133, 3.019413, 0, 0, 0.9981348, 0.06104866, 7200, 255, 1), -- 211693 (Area: 6219)
(211668, 1031, 4096, 1, 3700.17, 362.7052, 597.2863, 2.836158, 0, 0, 0.9883615, 0.1521232, 7200, 255, 1), -- 211668 (Area: 6219)
(211668, 1031, 4096, 1, 3666.686, 637.7451, 637.3908, 4.337144, 0, 0, -0.8265896, 0.5628051, 7200, 255, 1), -- 211668 (Area: 6219)
(212974, 1031, 4096, 1, 3845.348, 527.3698, 639.6908, 6.158043, 0, 0, 0, 1, 7200, 255, 1), -- 212974 (Area: 6219)
(210868, 1031, 4096, 1, 3699.746, 545.3397, 639.6289, 3.019413, 0, 0, 0.9981348, 0.06104866, 7200, 255, 1), -- 210868 (Area: 6219)
(213251, 1031, 4096, 1, 3746.589, 539.9305, 639.6908, 6.159264, 0, 0, 0, 1, 7200, 255, 1); -- 213251 (Area: 6219)

delete from creature_text where entry in (63315,63312,63313,64280, 64281);
INSERT INTO `creature_text` (`entry`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `comment`) VALUES
(63315, 0, 0, 'Добро пожаловать на Арену Истребления, наше первое официально одобренное боевое состязание!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Player'),
(63315, 1, 0, 'Готовы ли вы продемонстрировать здесь, под взором Тигра, свое воинское искусство?', 14, 0, 100, 6, 0, 0, 'Гаргток to Player'),
(63315, 2, 0, 'Тогда бейте в гонг и покажите этим монахам, из чего вы сделаны! Как вы это умеете, хе-хе.', 14, 0, 100, 1, 0, 0, 'Гаргток to Player'),
(63315, 3, 0, 'Первое испытание мастерства и силы! Перед вами Потертый Панцирь, сильнейшая из драконьих черепах!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Потертый Панцирь'),
(63315, 4, 0, 'Мда, вот это каша! Передайте в монастырскую кухню: сегодня у нас на ужин будет черепаховый суп!', 14, 0, 100, 5, 0, 8573, 'Гаргток to Потертый Панцирь'),
(63315, 5, 0, 'Готовы к новой битве? Бейте в гонг и В АТАКУ!', 14, 0, 100, 5, 0, 0, 'Гаргток to Потертый Панцирь'),
(63315, 6, 0, 'Пришел час грозы груммелей, неистового лохматого голиафа, снежного ужаса вершины Кунь-Лай – Джол''Грума!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Джол''Грум'),
(63315, 7, 0, 'Ох-х! Да, с нашим снежным Джол''Грумом смертоносная троица обошлась совсем не с-нежно! Кстати, о готовности...', 14, 0, 100, 5, 0, 8573, 'Гаргток to Джол''Грум'),
(63315, 8, 0, 'Она здесь для того, чтобы завести новых друзей... а затем поджечь их! Маленькая шутница, самая хорошенькая пироманьячка Пандарии – Люян!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Малышка Люян'),
(63315, 9, 0, 'Загасили, как свечку! Хоть кто-нибудь может противостоять этим троим?!', 14, 0, 100, 5, 0, 8573, 'Гаргток to Малышка Люян'),
(63315, 10, 0, 'Кто сказал, что это разъяренный як?! Это мастер топора Чагань Огненное Копыто, странствующий воин Танлунских степей!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Чаган Огненное Копыто'),
(63315, 11, 0, 'Вот это битва! Наши бравые воители угостили Чагана здоровенной порцией шашлыка из яунголины.', 14, 0, 100, 5, 0, 8573, 'Гаргток to Player'),
(63315, 12, 0, 'Он сквозь туман летит и смерть врагам сулит, он спокоен, но с ним не балуй: ассасин, урожденный цзинь-юй – Сатай Бюй!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Сатай Бюй'),
(63315, 13, 0, 'Да, сколько ни бился наш хвостатый убийца как рыба об лед, пришел ему конец.', 14, 0, 100, 5, 0, 8573, 'Гаргток to Player'),
(63315, 14, 0, 'С какой злобой и жестокостью его скинули с Пика Безмятежности, этого чокнутого пустобреха, жрущего бананы, точно обезьяна, мастера-монаха сокрушителя облаков Кобо!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Player'),
(63315, 15, 0, 'Какая потрясающая и кровавая битва! Трое наших героев наглядно объяснили Кобо, что мартышкам не место на Арене Истребления!', 14, 0, 100, 5, 0, 8573, 'Гаргток to Player'),
(63315, 16, 0, 'Крошит и кромсает, пощады не знает! Поприветствуйте поклоном Маки Водореза, саурока-самурая!', 14, 0, 100, 5, 0, 8574, 'Гаргток to Player'),
(63315, 17, 0, 'Благородный Маки встретил достойный конец... Уверен, его клан гордился бы им, не будь он последним из них!', 14, 0, 100, 5, 0, 8573, 'Гаргток to Player'),
(63315, 18, 0, 'Давайте все вместе поприветствуем новых чемпионов Арены Истребления!', 14, 0, 100, 4, 0, 0, 'Гаргток to Player'),
(63312, 0, 0, '%s злится!', 41, 0, 100, 0, 0, 0, 'Джол''Грум to Джол''Грум'),
(63313, 0, 0, '%s начинает призывать |cFFFE9A2Eпитающих пламя духов|r! Уничтожайте их, чтобы остановить стену огня!', 41, 0, 100, 0, 0, 0, 'Малышка Люян to Малышка Люян'),
(64280, 0, 0, 'Я призываю воды сссвоего родного края... Доставьте ко мне моих врагов!', 14, 0, 100, 0, 0, 0, 'Маки'),
(64281, 0, 0, 'Фум-м!', 12, 0, 100, 2, 0, 0, 'Сатай Бюй to Player');