DELETE FROM `gossip_menu` WHERE (`entry`=15607 AND `text_id`=22414);
INSERT INTO `gossip_menu` (`entry`, `text_id`) VALUES
(15607, 22414); -- 70438

DELETE FROM `gossip_menu_option` WHERE (`menu_id`=15607 AND `id`=0);
INSERT INTO `gossip_menu_option` (`menu_id`, `id`, `option_icon`, `option_text`, `box_coded`, `box_money`, `box_text`) VALUES
(15607, 0, 0, 'Я готова.', 0, 0, ''); -- 70438

UPDATE `creature_template` SET `ScriptName` ='npc_akama' WHERE (`entry`='68137');
UPDATE `creature_template` SET `ScriptName` ='npc_asthongue_primalist' WHERE (`entry`='68096');
UPDATE `creature_template` SET `ScriptName` ='npc_ashtongue_worker' WHERE (`entry`='68098');
UPDATE `creature_template` SET `ScriptName` ='npc_suffering_soul_fragment' WHERE (`entry`='68139');
UPDATE `creature_template` SET `ScriptName` ='npc_hungering_soul_fragment2' WHERE (`entry`='68140');
UPDATE `creature_template` SET `ScriptName` ='npc_essence_of_order' WHERE (`entry`='68151');
UPDATE `creature_template` SET `ScriptName` ='npc_demonic_gateway_scen' WHERE (`entry`='70028');
UPDATE `creature_template` SET `ScriptName` ='npc_kanrethad_ebonlocke' WHERE (`entry`='69964');
UPDATE `creature_template` SET `ScriptName` ='npc_jubeka_shadowbreaker' WHERE (`entry`='70166');
UPDATE `creature_template` SET `ScriptName` ='npc_wild_imp_scenario' WHERE (`entry`='70071');
UPDATE `creature_template` SET `ScriptName` ='npc_unbound_night_lord' WHERE (`entry`='68174');
UPDATE `creature_template` SET `ScriptName` ='npc_doom_lord_scenario' WHERE (`entry`='70073');
UPDATE `creature_template` SET `ScriptName` ='npc_felhunter_scenario' WHERE (`entry`='70072');

DELETE FROM `areatrigger_scripts` WHERE `entry` IN ('8696', '8699', '8698', '8701', '8706', '8702', '8708', '8908');
INSERT INTO `areatrigger_scripts` (`entry`, `ScriptName`) VALUES
('8696', 'at_pursuing_the_black_harvest_main'),
('8699', 'at_pursuing_the_black_harvest_main'),
('8698', 'at_pursuing_the_black_harvest_main'),
('8701', 'at_pursuing_the_black_harvest_main'),
('8706', 'at_pursuing_the_black_harvest_main'),
('8702', 'at_pursuing_the_black_harvest_main'),
('8708', 'at_pursuing_the_black_harvest_main'),
('8908', 'at_pursuing_the_black_harvest_main');

UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1813', `npcflag`='0', `speed_walk`='1', `speed_run`='0.992063', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='2', `dynamicflags`='4358144', `unit_flags`='32832', `unit_flags2`='4196352', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68096');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1813', `npcflag`='0', `speed_walk`='1', `speed_run`='0.992063', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='2', `dynamicflags`='4358144', `unit_flags`='32768', `unit_flags2`='4196352', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68098');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1813', `npcflag`='0', `speed_walk`='1', `speed_run`='0.992063', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='2', `dynamicflags`='4360256', `unit_flags`='32832', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68129');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1813', `npcflag`='0', `speed_walk`='1.2', `speed_run`='0.992063', `speed_fly`='1.14286', `baseattacktime`='1300', `rangeattacktime`='2000', `unit_class`='2', `dynamicflags`='4360768', `unit_flags`='0', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68137');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='16', `npcflag`='0', `speed_walk`='1.11111', `speed_run`='1.42857', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='2', `dynamicflags`='4360768', `unit_flags`='32832', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68139');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='16', `npcflag`='0', `speed_walk`='1.6', `speed_run`='1.71429', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='1', `dynamicflags`='4361536', `unit_flags`='768', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68151');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='16', `npcflag`='0', `speed_walk`='1', `speed_run`='1.14286', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='1', `dynamicflags`='4361984', `unit_flags`='32768', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68156');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='2', `speed_run`='1.42857', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4363072', `unit_flags`='32768', `unit_flags2`='2099200', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68175');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='2', `speed_run`='1.71429', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='1', `dynamicflags`='4363264', `unit_flags`='32832', `unit_flags2`='2099200', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68176');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='2', `speed_run`='1.42857', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4365056', `unit_flags`='32768', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68204');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='2', `speed_run`='1.42857', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4365120', `unit_flags`='32768', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68205');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='2', `speed_run`='1.42857', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4365056', `unit_flags`='32768', `unit_flags2`='2048', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='68206');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='93', `maxlevel`='93', `faction`='1771', `npcflag`='16777216', `speed_walk`='0.944444', `speed_run`='1.11111', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4477696', `unit_flags`='256', `unit_flags2`='4194304', `VehicleId`='2745', `HoverHeight`='1' WHERE (`entry`='69964');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='91', `maxlevel`='91', `faction`='1771', `npcflag`='0', `speed_walk`='1', `speed_run`='1.14286', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='4481344', `unit_flags`='33554432', `unit_flags2`='0', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='70023');
UPDATE `creature_template` SET `gossip_menu_id`='0', `minlevel`='90', `maxlevel`='90', `faction`='35', `npcflag`='0', `speed_walk`='1', `speed_run`='0.992063', `speed_fly`='1.14286', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='1', `dynamicflags`='4481792', `unit_flags`='33554688', `unit_flags2`='4229152', `VehicleId`='0', `HoverHeight`='1' WHERE (`entry`='70028');
UPDATE `creature_template` SET `minlevel`='90', `maxlevel`='90', `faction`='0', `npcflag`='0', `speed_walk`='2', `speed_run`='0.8571429', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='8', `dynamicflags`='0', `unit_flags`='2048', `unit_flags2`='4363072'  WHERE (`entry`='68173');
UPDATE `creature_template` SET `minlevel`='90', `maxlevel`='90', `faction`='1786', `npcflag`='0', `speed_walk`='1.714286', `speed_run`='0.8571429', `baseattacktime`='2000', `rangeattacktime`='2000', `unit_class`='1', `dynamicflags`='32832', `unit_flags`='2099200', `unit_flags2`='4363008'  WHERE (`entry`='68174');

UPDATE `creature_template` SET `minlevel`='90', `maxlevel`='90', `Health_mod`='35' WHERE (`entry`='70075');
UPDATE `creature_template` SET `minlevel`='90', `maxlevel`='90', `faction`='35' WHERE (`entry`='70166');

DELETE FROM `creature_loot_template` WHERE `entry` = 68151;
INSERT INTO `creature_loot_template` (`entry`, `item`, `ChanceOrQuestChance`, `lootmode`, `groupid`, `mincountOrRef`, `maxcount`, `shared`) VALUES
('68151', '92556', '100', '0', '0', '1', '1', '0');

DELETE FROM `lfg_entrances` WHERE `dungeonId` = '594';
INSERT INTO `lfg_entrances` (`dungeonId`, `name`, `position_x`, `position_y`, `position_z`, `orientation`) VALUES
('594', 'Pursuing the Black Harvest', '710.279', '988.731', '52.8447', '4.71239');

UPDATE `instance_template` SET `script`='instance_pursuing_the_black_harvest', `allowMount`='1' WHERE `map`='1112';

DELETE FROM `areatrigger_polygon` WHERE `entry` = '3764';
INSERT INTO  `areatrigger_polygon` (`entry`, `spellId`, `id`, `x`, `y`) VALUES
('3764', '134110', '0', '30', '0'),
('3764', '134110', '1', '27.71631', '11.48047'),
('3764', '134110', '2', '21.21338', '21.21338'),
('3764', '134110', '3', '11.48047', '27.71631'),
('3764', '134110', '4', '0', '30'),
('3764', '134110', '5', '-11.48047', '27.71631'),
('3764', '134110', '6', '-21.21338', '21.21338'),
('3764', '134110', '7', '-27.71631', '11.48047'),
('3764', '134110', '8', '-30', '0'),
('3764', '134110', '9', '-27.71631', '-11.48047'),
('3764', '134110', '10', '-21.21338', '-21.21338'),
('3764', '134110', '11', '-11.48047', '-27.71631'),
('3764', '134110', '12', '0', '-30'),
('3764', '134110', '13', '11.48047', '-27.71631'),
('3764', '134110', '14', '21.21338', '-21.21338'),
('3764', '134110', '15', '27.71631', '-11.48047');

DELETE FROM `npc_spellclick_spells` WHERE `npc_entry` IN ('70052', '69964');
INSERT INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
('70052', '138680', '1', '0'),
('69964', '139200', '1', '0');

DELETE FROM `spell_script_names` WHERE `spell_id` IN ('138680', '139141', '140164', '139200', '134280', '134234');
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES
('138680', 'spell_place_empowered_soulcore'),
('139141', 'spell_anihilate_demons'),
('139200', 'spell_drain_fel_enegry'),
('140164', 'spell_fel_enery'),
('134280', 'spell_appraisal'),
('134234', 'spell_spellflame_dummy');


DELETE FROM `spell_loot_template` WHERE `entry` IN ('134290', '134294', '134298', '134302', '134283', '134287', '134291', '134295', '134299', '134303',
'134284', '134284', '134288', '134292', '134296', '134281', '134300', '134285', '134289', '134293', '134297', '134301', '134282', '134286');
INSERT INTO `spell_loot_template` (`entry`, `item`, `ChanceOrQuestChance`, `lootmode`, `groupid`, `mincountOrRef`, `maxcount`, `shared`) VALUES
('134290', '92599', '100', '1', '1', '1', '1', '0'),
('134294', '92607', '100', '1', '1', '1', '1', '0'),
('134298', '92615', '100', '1', '1', '1', '1', '0'),
('134302', '92623', '100', '1', '1', '1', '1', '0'),
('134283', '92585', '100', '1', '1', '1', '1', '0'),
('134287', '92593', '100', '1', '1', '1', '1', '0'),
('134291', '92601', '100', '1', '1', '1', '1', '0'),
('134295', '92609', '100', '1', '1', '1', '1', '0'),
('134299', '92617', '100', '1', '1', '1', '1', '0'),
('134303', '92625', '100', '1', '1', '1', '1', '0'),
('134284', '92587', '100', '1', '1', '1', '1', '0'),
('134288', '92595', '100', '1', '1', '1', '1', '0'),
('134292', '92603', '100', '1', '1', '1', '1', '0'),
('134296', '92611', '100', '1', '1', '1', '1', '0'),
('134281', '92581', '100', '1', '1', '1', '1', '0'),
('134300', '92619', '100', '1', '1', '1', '1', '0'),
('134285', '92589', '100', '1', '1', '1', '1', '0'),
('134289', '92597', '100', '1', '1', '1', '1', '0'),
('134293', '92605', '100', '1', '1', '1', '1', '0'),
('134297', '92613', '100', '1', '1', '1', '1', '0'),
('134301', '92621', '100', '1', '1', '1', '1', '0'),
('134282', '92583', '100', '1', '1', '1', '1', '0'),
('134286', '92591', '100', '1', '1', '1', '1', '0');

DELETE FROM `creature_text` WHERE `entry` IN ('70166', '69964', '68137', '58959', '68096', '68098', '68151');
INSERT INTO `creature_text` (`entry`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `comment`) VALUES
(70166, 0, 0, 'НЕТ!', 12, 0, 100, 0, 0, 0, 'to Player'),
(70166, 1, 0, 'Я сделала лишь то, о чем ты сам просил меня раньше, Канретад. Ты сам во всем виноват.', 12, 0, 100, 0, 0, 0, 'to Player'),
(70166, 2, 0, 'Канретад настолько погрузился в энергию Скверны, что она полностью подчинила его. Но лишь глоток его силы не должен повредить. Испей ее.', 12, 0, 100, 0, 0, 0, 'to Player'),
(70166, 3, 0, 'А теперь иди и используй полученные знания. Если когда-нибудь тебе захочется избавиться от энергии Скверны или вновь ощутить силу Канретада, ищи меня в Алтаре Проклятия в Долине Призрачной Луны. Там я буду присматривать за своим пленником.', 12, 0, 100, 0, 0, 0, 'to Player'),

(69964, 0, 0, 'БОЙСЯ! Теперь я овладел всеми энергиями Скверны этого мира! Демоническая сила, которой я управляю… невероятна! Безгранична! Я ВСЕМОГУЩ!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 1, 0, 'Думаешь, я слишком далеко зашел? Нет такого понятия. Мрачная Жатва поработит самых могущественных демонов и уничтожит всех, кто станет противостоять ей – в этом мире и на Азероте! И ТЫ хочешь остановить меня, кроха?', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 2, 0, 'Ну-ну, попытайся.', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 3, 0, 'Ха! Твои слабые попытки ранить меня никуда не годятся. Хочешь посмотреть на одного из моих новых питомцев?', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 4, 0, 'Разрушение у искоренителей в крови. Огромная сила и мощь делают их непобедимыми.', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 5, 0, 'ЧТО?! Вот теперь я зол!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 6, 0, 'Часики тикают.', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 7, 0, 'Боль усиливается.', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 8, 0, 'Всем будет править хаос.', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 9, 0, '|TInterface\Icons\ability_warlock_chaosbolt.blp:20|t%s начинает читать заклинание |cFFFF0000|Hspell:138559|h[Стрела Хаоса]|h|r!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 10, 0, 'МОЩЬ КАТАКЛИЗМА!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 11, 0, '|TInterface\Icons\achievement_zone_cataclysm.blp:20|t%s начинает призывать чудовищный |cFFFF0000|Hspell:138564|h[Катаклизм]|h|r!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 12, 0, 'Один бес – хорошо, два – лучше, а ШЕСТЬДЕСЯТ – просто замечательно!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 13, 0, 'Ха-ха-ха… у тебя была надежда на победу? Теперь меня НИЧТО не сможет убить, жалкое смертное существо!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 14, 0, 'А теперь твоя сказка с грустным концом закончится!', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 15, 0, 'Джубека?! Что ты…', 12, 0, 100, 0, 0, 0, 'to Player'),
(69964, 16, 0, 'АААААААААА!', 12, 0, 100, 0, 0, 0, 'to Player'),

('68137', '0', '0', 'Погоди... Ты не из тех чернокнижников, что были здесь раньше. Зачем ты здесь?', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '1', '0', 'Прошло уже много месяцев с тех пор, как двое чернокнижников проникли в храм. И я до сих пор не знаю, что им было нужно здесь...', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '2', '0', 'Следуй за мной. Они побывали и в Святилище Потерянных Душ, и на верхнем этаже храма.', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '3', '0', 'Я решил, что $gэтому чернокнижнику:этой чернокнижнице; можно доверять. $gОн:Она; может свободно перемещаться по храму.', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '4', '0', 'Пройдет еще много лет, прежде чем мы сможем устранить ущерб, нанесенный этому святому месту Магтериодном, Иллиданом и орками Скверны.', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '5', '0', 'Здесь находится Святилище Потерянных Душ. В нем пребывают души тысяч моих погибших братьев.', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '6', '0', 'Будь $gосторожен:осторожна;. Многие из ловушек все еще действуют. Может быть, какое-то из твоих демонических заклинаний поможет тебе разведать обстановку, прежде чем двигаться вперед.', '12', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '7', '0', '$n! Мои воины оказались в ловушке там, внизу. Времени мало. Помоги мне спасти их!', '14', '0', '100', '0', '0', '0', 'Акама to Player'),
('68137', '8', '0', 'Глупые чернокнижники! Я знал, что вы предпримете еще одну попытку разграбить наш храм!..', '14', '0', '100', '0', '0', '0', 'Акама to Player'),

('58959', '0', '0', 'Эй, $n! Помнишь меня? Ладно, ладно... Эй, послушай... Мы совсем не обязаны помогать этому парню...', '12', '0', '100', '0', '0', '0', 'Кеппико to Player'),
('58959', '1', '0', 'В этом месте наверняка есть, чем поживиться... Ну же, $gначальник:начальница;! Тебе же этого хочется...', '12', '0', '100', '0', '0', '0', 'Кеппико to Player'),

('68096', '0', '0', 'Этот храм находится во владении пеплоустов. Я вынужден просить тебя уйти и немедленно.', '12', '0', '100', '0', '0', '0', 'Пеплоуст-охотник to Player'),
('68096', '1', '0', 'Что ты видишь, брат?', '12', '0', '100', '0', '0', '0', 'Пеплоуст-охотник to Пеплоуст-рабочий'),
('68096', '2', '0', 'Еще Чернокнижник? После того, что случилось в прошлый раз, ты должен быть рад, что мы не убили тебя сразу.', '12', '0', '100', '0', '0', '0', 'Пеплоуст-охотник to Player - кастомный текст, в снифах был пропущен ( на основе видео и комментариев )'),

('68098', '0', '0', '%s призывает ближайшего стража на помощь!', '16', '0', '100', '0', '0', '0', 'Пеплоуст-рабочий to Player'),

('68151', '0', '0', 'УМРИ!', '16', '0', '100', '0', '0', '0', 'Пеплоуст-рабочий to Player'),
('68151', '1', '0', 'Узри же души, которые погубили твои собратья, чернокнижники!', '16', '0', '100', '0', '0', '0', 'Пеплоуст-рабочий to Player'),
('68151', '2', '0', 'Ты так любишь демонов?.. Теперь у тебя будет возможность встретиться с ними!', '16', '0', '100', '0', '0', '0', 'Пеплоуст-рабочий to Player');

DELETE FROM `gameobject_template` WHERE `entry` IN (216364, 216448, 216449, 216450, 216451, 216452, 216428, 216430, 216431, 216432, 216433, 216434, 216435, 216436, 216437, 216438, 216439, 216440, 216441, 216442, 216444, 216445, 216446, 216447,216454, 216366, 216481, 185892, 185478, 185479, 186152, 185480, 185482, 185483, 185905, 185882);
INSERT INTO `gameobject_template` (`entry`, `type`, `displayId`, `name`, `IconName`, `castBarCaption`, `unk1`, `size`, `questItem1`, `questItem2`, `questItem3`, `questItem4`, `questItem5`, `questItem6`, `Data0`, `Data1`, `Data2`, `Data3`, `Data4`, `Data5`, `Data6`, `Data7`, `Data8`, `Data9`, `Data10`, `Data11`, `Data12`, `Data13`, `Data14`, `Data15`, `Data16`, `Data17`, `Data18`, `Data19`, `Data20`, `Data21`, `Data22`, `Data23`, `Data24`, `Data25`, `Data26`, `Data27`, `Data28`, `Data29`, `Data30`, `Data31`, `unkInt32`, `WDBVerified`) VALUES
(185478, 0, 7319, 'Дверь', '', '', '', 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185478
(185479, 0, 7319, 'Дверь', '', '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185479
(185882, 0, 7377, 'Главная дверь храма', '', '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185882
(185480, 0, 7319, 'Дверь', '', '', '', 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185480
(216481, 10, 1213, 'Знак Джубеки', '', '', '', 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15257, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 19342), -- 216481
(185482, 0, 7319, 'Дверь', '', '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185482
(185483, 0, 7320, 'Ворота', '', '', '', 0.848896, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185483
(185892, 0, 7319, 'Дверь', '', '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185892
(186152, 0, 7319, 'Doodad_BT_CommonDoor08', '', '', '', 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 186152
(185905, 0, 7388, 'Ворота', '', '', '', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 185905
(216364, 3, 13421, 'Заметный иллидарский свиток', '', '', '', 1, 0, 0, 0, 0, 0, 0, 1690, 45601, 30, 1, 0, 0, 34540, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216364
(216442, 3, 13434, 'Золотая статуэтка высшей эльфийки', '', 'Сбор добычи', '', 0.5, 0, 0, 0, 0, 0, 0, 1635, 45640, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216442
(216444, 3, 7944, 'Золотое блюдо', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45644, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216444
(216445, 3, 13435, 'Сияющая пряжа', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45646, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216445
(216446, 3, 3511, 'Великолепный самоцвет', '', 'Сбор добычи', '', 4, 0, 0, 0, 0, 0, 0, 1635, 45648, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216446
(216447, 3, 563, 'Золотое блюдо для фруктов', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45650, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216447
(216448, 3, 10730, 'Покрытая пылью картина', '', 'Сбор добычи', '', 3, 0, 0, 0, 0, 0, 0, 1635, 45652, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216448
(216449, 3, 9660, 'Мягкая подушка', '', 'Сбор добычи', '', 2, 0, 0, 0, 0, 0, 0, 1635, 45654, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216449
(216450, 3, 8489, 'Древний орочий щит', '', 'Сбор добычи', '', 5, 0, 0, 0, 0, 0, 0, 1635, 45656, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216450
(216451, 3, 13436, 'Ржавый меч', '', 'Сбор добычи', '', 2, 0, 0, 0, 0, 0, 0, 1635, 45658, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216451
(216452, 2, 10313, 'Сундук с сокровищами', '', '', '', 2, 0, 0, 0, 0, 0, 0, 0, 17475, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216452
(216428, 3, 13431, 'Ароматные духи', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45614, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216428
(216430, 3, 13432, 'Одеколон', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45616, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216430
(216431, 3, 7075, 'Ценный рубин', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45618, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216431
(216432, 3, 9024, 'Сверкающий сапфир', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45620, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216432
(216433, 3, 8368, 'Нефритовый котенок', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45622, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216433
(216434, 3, 10146, 'Рубиновое ожерелье', '', 'Сбор добычи', '', 0.6, 0, 0, 0, 0, 0, 0, 1635, 45624, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216434
(216435, 3, 9410, 'Ожерелье из камней чар', '', 'Сбор добычи', '', 0.6, 0, 0, 0, 0, 0, 0, 1635, 45626, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216435
(216436, 3, 9411, 'Кольцо с бриллиантом', '', 'Сбор добычи', '', 0.2, 0, 0, 0, 0, 0, 0, 1635, 45628, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216436
(216437, 3, 13433, 'Кольцо с рубином', '', 'Сбор добычи', '', 0.25, 0, 0, 0, 0, 0, 0, 1635, 45630, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216437
(216438, 3, 11043, 'Золотое кольцо', '', 'Сбор добычи', '', 1, 0, 0, 0, 0, 0, 0, 1635, 45632, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216438
(216439, 3, 2614, 'Горстка монет', '', 'Сбор добычи', '', 0.6, 0, 0, 0, 0, 0, 0, 1635, 45634, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216439
(216440, 3, 10287, 'Большая куча монет', '', 'Сбор добычи', '', 0.6, 0, 0, 0, 0, 0, 0, 1635, 45636, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216440
(216441, 3, 8367, 'Золотой кубок', '', 'Сбор добычи', '', 0.5, 0, 0, 0, 0, 0, 0, 1635, 45638, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 69544, 0, 0, 19771, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216441
(216454, 0, 13215, 'Завал', '', '', '', 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342), -- 216454
(216366, 6, 13485, 'Разлом душ', '', '', '', 3, 0, 0, 0, 0, 0, 0, 0, 90, 4, 134208, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 5793, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19342); -- 216366

UPDATE `gameobject_template` SET `entry`='216481', `size`='2' WHERE (`entry`='216481');
UPDATE `gameobject_template` SET `entry`='185892', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='185892');
UPDATE `gameobject_template` SET `entry`='185478', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='185478');
UPDATE `gameobject_template` SET `entry`='185479', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='185479');
UPDATE `gameobject_template` SET `entry`='186152', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='186152');
UPDATE `gameobject_template` SET `entry`='185480', `faction`='1375', `flags`='32', `size`='1' WHERE (`entry`='185480');
UPDATE `gameobject_template` SET `entry`='185482', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='185482');
UPDATE `gameobject_template` SET `entry`='185483', `faction`='114', `flags`='32', `size`='0.848896' WHERE (`entry`='185483');
UPDATE `gameobject_template` SET `entry`='185905', `faction`='114', `flags`='32', `size`='1' WHERE (`entry`='185905');
UPDATE `gameobject_template` SET `entry`='185882', `faction`='1375', `flags`='32', `size`='1' WHERE (`entry`='185882');
UPDATE `gameobject_template` SET `entry`='216364', `ScriptName` ='go_cospicuous_illidari_scroll', `size`='1' WHERE (`entry`='216364');
UPDATE `gameobject_template` SET `entry`='216366', `faction`='14', `size`='3' WHERE (`entry`='216366');
UPDATE `gameobject_template` SET `entry`='216454', `faction`='1375', `flags`='32', `size`='2' WHERE (`entry`='216454');
UPDATE `gameobject_template` SET `entry`='216448', `size`='3' WHERE (`entry`='216448');
UPDATE `gameobject_template` SET `entry`='216449', `size`='2' WHERE (`entry`='216449');
UPDATE `gameobject_template` SET `entry`='216450', `size`='5' WHERE (`entry`='216450');
UPDATE `gameobject_template` SET `entry`='216451', `size`='2' WHERE (`entry`='216451');
UPDATE `gameobject_template` SET `entry`='216452', `flags`='4', `ScriptName` ='go_treasure_chest', `size`='2' WHERE (`entry`='216452');
UPDATE `gameobject_template` SET `entry`='216428', `size`='1' WHERE (`entry`='216428');
UPDATE `gameobject_template` SET `entry`='216430', `size`='1' WHERE (`entry`='216430');
UPDATE `gameobject_template` SET `entry`='216431', `size`='1' WHERE (`entry`='216431');
UPDATE `gameobject_template` SET `entry`='216432', `size`='1' WHERE (`entry`='216432');
UPDATE `gameobject_template` SET `entry`='216433', `size`='1' WHERE (`entry`='216433');
UPDATE `gameobject_template` SET `entry`='216434', `size`='0.6' WHERE (`entry`='216434');
UPDATE `gameobject_template` SET `entry`='216435', `size`='0.6' WHERE (`entry`='216435');
UPDATE `gameobject_template` SET `entry`='216436', `size`='0.2' WHERE (`entry`='216436');
UPDATE `gameobject_template` SET `entry`='216437', `size`='0.25' WHERE (`entry`='216437');
UPDATE `gameobject_template` SET `entry`='216438', `size`='1' WHERE (`entry`='216438');
UPDATE `gameobject_template` SET `entry`='216439', `size`='0.6' WHERE (`entry`='216439');
UPDATE `gameobject_template` SET `entry`='216440', `size`='0.6' WHERE (`entry`='216440');
UPDATE `gameobject_template` SET `entry`='216441', `size`='0.5' WHERE (`entry`='216441');
UPDATE `gameobject_template` SET `entry`='216442', `size`='0.5' WHERE (`entry`='216442');
UPDATE `gameobject_template` SET `entry`='216444', `size`='1' WHERE (`entry`='216444');
UPDATE `gameobject_template` SET `entry`='216445', `size`='1' WHERE (`entry`='216445');
UPDATE `gameobject_template` SET `entry`='216446', `size`='4' WHERE (`entry`='216446');
UPDATE `gameobject_template` SET `entry`='216447', `size`='1' WHERE (`entry`='216447');

DELETE FROM `gameobject_loot_template` WHERE `entry`= '216364';
INSERT INTO `gameobject_loot_template` (`entry`, `item`, `ChanceOrQuestChance`, `lootmode`, `groupid`, `mincountOrRef`, `maxcount`, `shared`) VALUES
('216364', '92550', '100', '1', '0', '1', '1', '0');

DELETE FROM `spell_scene` WHERE `ScenePackageId`= '291';
INSERT INTO `spell_scene` (`ScenePackageId`, `MiscValue`, `hasO`, `SceneInstanceID`, `PlaybackFlags`, `bit16`, `x`, `y`, `z`, `o`, `transport`, `comment`) VALUES
('291', '130', '0', '1', '0', '0', '496.248', '135.59', '96.5593', '1.78539', '0', 'Scenario: Pursuing the Black Harvest - Memory of the Reliquary');


DELETE FROM `gameobject` WHERE `map` = '1112';
INSERT INTO `gameobject` (`id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`) VALUES
(185480, 1112, 3, 1, 472.7631, 422.7271, 192.7939, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 0), -- 185480 (Area: 6614)
(185905, 1112, 3, 1, 774.5937, 304.5667, 314.8032, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185905 (Area: 6614)
(186152, 1112, 3, 1, 626.835, 305.7205, 271.6489, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 0), -- 186152 (Area: 6614)
(185478, 1112, 3, 1, 564.0061, 400.5536, 112.784, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 0), -- 185478 (Area: 6614)
(185892, 1112, 3, 1, 752.0975, 159.7382, 112.7681, 3.135416, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185892 (Area: 6614)
(185479, 1112, 3, 1, 855.7142, 392.9767, 112.7841, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185479 (Area: 6614)
(185882, 1112, 3, 1, 703.8908, 544.4705, 112.6538, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185882 (Area: 6614)
(185482, 1112, 3, 1, 903.2781, 149.0084, 192.818, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185482 (Area: 6614)
(185483, 1112, 3, 1, 551.4631, 929.6441, 55.25713, 1.564741, 0, 0, 0.7049633, 0.7092438, 7200, 255, 1), -- 185483 (Area: 6614)
(216364, 1112, 3, 1, 703.3941, 353.6129, 125.176, 5.748001, 0, 0, 0, 1, 7200, 255, 1), -- 216364 (Area: 0)
(216366, 1112, 3, 1, 567.9879, 97.51736, 113.1254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 561.9114, 102.0868, 113.5708, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 620.4358, 87.75868, 112.8712, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 610.5972, 102.2986, 113.4186, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 569.059, 109.783, 113.5791, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 633.8715, 96.80729, 113.7674, 5.104183, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 609.9549, 108.7934, 113.4381, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 635.0347, 33.29514, 113.4342, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 607.1146, 65.68403, 112.3589, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 600.7066, 60.26736, 112.4574, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 645.0746, 83.2934, 113.3849, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 618.0018, 29.27083, 113.436, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 627.3802, 56.50347, 113.4049, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 568.4948, 103.3455, 114.1643, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 627.0746, 76.88021, 113.4873, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 567.0278, 24.52778, 113.2748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 598.3698, 31.46875, 113.4366, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 645.3108, 34.96354, 113.4025, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 568.6337, 82.79166, 113.7694, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 584.5156, 78.77778, 112.4782, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 600.4653, 72.78993, 112.0031, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 601.7813, 99.1059, 112.9744, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 578.1077, 34.15799, 113.017, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 561.2986, 95.71007, 113.3618, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 617.3577, 109.4149, 113.4492, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 601.184, 66.6441, 112.3083, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 602.2327, 109.3351, 113.4411, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 606.9202, 72.2934, 112.0687, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 579.5729, 48.38542, 112.9348, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 572.257, 31.16319, 113.025, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 571.7483, 78.02778, 113.2475, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 576.9149, 81.36979, 112.1958, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 563.0104, 66.02257, 111.9681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 573.9827, 24.84028, 113.3116, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 552.6771, 61.93924, 113.2333, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 600.1111, 85.88715, 111.652, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 606.2864, 78.71528, 111.8027, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 596.1805, 106.0885, 113.4389, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 579.8941, 27.72743, 113.2293, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 609.8507, 90.97916, 113.6683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 562.6614, 108.6545, 113.72, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 569.7483, 64.86459, 112.0361, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 616.8055, 103.2899, 113.451, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 589.5121, 107.5087, 113.4555, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 631.6285, 73.16493, 114.0622, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 558.3143, 58.39757, 112.8067, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 556.4254, 67.38021, 112.708, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 586.0174, 72.51736, 112.571, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 563.059, 30.74479, 113.0597, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 602.757, 54.49479, 111.9308, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 579.0712, 75.34549, 112.6393, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 602.5469, 92.38541, 113.4725, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 573.6441, 94.89236, 112.533, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 556.6042, 42.79514, 113.0654, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 628.8472, 100.0347, 114.0681, 5.104183, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 606.5052, 59.19792, 112.3432, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 584.3281, 23.28125, 113.4303, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 576.1962, 61.84028, 112.125, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 610.1927, 36.82118, 113.4421, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 600.1458, 48.56597, 112.7561, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 607.9965, 96.77431, 113.0775, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 605.0868, 85.08681, 111.6576, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 579.7813, 93.93056, 112.7888, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 604.8594, 102.9826, 113.1936, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 580.0121, 55.11979, 111.8833, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 585.8143, 92.78125, 113.5038, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 625.0504, 41.07639, 113.468, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 599.8507, 79.32813, 111.812, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 623.5781, 82.02952, 113.4721, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 549.2743, 45.32639, 113.3571, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 542.4844, 74.3316, 113.8083, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 560.1042, 24.50868, 113.3357, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 543.9601, 79.63021, 114.1076, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 548.842, 98.80903, 113.0382, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 546.2379, 92.81597, 113.2776, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 544.9358, 86.27257, 113.1981, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 555.0174, 34.76563, 113.0985, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 545.8125, 104.1632, 113.0159, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 532.8577, 66.84722, 113.6133, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 532.5573, 82.64931, 113.3074, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 531.5903, 77.99653, 113.5822, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 535.5955, 61.42361, 113.6323, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 531.5208, 72.24132, 113.543, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 553.1684, 27.23438, 113.3156, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 537.5139, 78.82118, 113.8349, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 542.1528, 98.08507, 113.1026, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 541.1424, 91.71007, 113.1478, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 546.1285, 30.01563, 113.4271, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 548.158, 37.17535, 113.3692, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 536.4739, 72.3941, 113.5054, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 538.2969, 85.41666, 113.273, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 537.6493, 55.55208, 113.6403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 535.4184, 49.47743, 113.8192, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 519.5712, 78.59549, 113.5053, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 533.2743, 42.99826, 113.957, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 519.3489, 72.69791, 113.6448, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 522.2691, 62.37674, 113.8153, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 526.0868, 77.58854, 113.4859, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 522.6545, 50.57813, 114.1154, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 529.6545, 60.5, 113.7724, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 527.8004, 65.85416, 113.6962, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 525.3611, 71.57118, 113.622, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 528.6042, 48.42361, 114.102, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 531.0938, 54.51736, 113.9127, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 515.4549, 22.55382, 114.0972, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 524.8854, 56.2257, 113.9526, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 488.4445, 70.53472, 112.5793, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 469.9531, 59.4375, 112.9527, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 501.8715, 33.08507, 114.2551, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 482.3455, 42.92882, 112.9101, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 482.651, 36.69445, 112.9512, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 519.0851, 100.3663, 104.2952, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 491.7743, 61.9375, 112.946, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 470.9063, 78.56944, 112.9007, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 494.0642, 42.16146, 113.4159, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 477.2431, 77.39584, 112.7735, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 488.2257, 39.90972, 113.3051, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 500.4826, 70.51041, 112.2733, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 490.4531, 23.82986, 114.3076, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 512.0625, 28.26215, 114.2444, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 494.5625, 67.53819, 112.3958, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 505.6701, 27.77778, 114.3562, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 515.4757, 92.94444, 107.8953, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 494.3281, 74.06424, 112.0037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 506.1632, 39.45833, 114.003, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 490.3004, 53.79688, 113.2762, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 506.5729, 71.38715, 112.403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 513.2327, 79.17014, 112.8486, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 506.2639, 45.75347, 113.6484, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 487.4635, 32.5816, 113.5842, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 499.9913, 44.44097, 113.5122, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 512.6996, 72.90625, 112.9593, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 469.9809, 66.0625, 112.8362, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 492.9462, 29.29861, 114.1039, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 486.0174, 58.91667, 113.2252, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 484.5695, 65.50868, 113.0455, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 499.0972, 38.35417, 113.801, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 507.8351, 52.47743, 113.6603, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 508.3924, 59.13715, 113.6856, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 508.191, 91.23959, 107.8863, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 507.0295, 77.51041, 112.0369, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 502.5695, 22.32465, 114.409, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 502.724, 95.22743, 105.9667, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 509.2153, 22.23958, 114.2499, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 501.8021, 88.46007, 108.96, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 511.0885, 97.74306, 105.1389, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 502.4618, 56.64931, 113.543, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 472.6371, 72.59375, 112.8439, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 498.8125, 27.46528, 114.4795, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 508.191, 33.3559, 114.3993, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 493.2587, 35.82292, 113.7804, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 500.6597, 76.34896, 111.5955, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216366, 1112, 3, 1, 501.9132, 50.36285, 113.4934, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216366 (Area: 0)
(216454, 1112, 3, 1, 903.2083, 55.25695, 112.7441, 6.093026, 0, 0, 0, 1, 7200, 255, 1), -- 216454 (Area: 0)
(216454, 1112, 3, 1, 899.618, 71.19444, 112.747, 6.093026, 0, 0, 0, 1, 7200, 255, 1), -- 216454 (Area: 0)
(216432, 1112, 3, 1, 803.8264, 206.6372, 112.7403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 797.9114, 233.3958, 112.7618, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 804.6458, 264.0833, 112.7405, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 793.8715, 300.3837, 112.7504, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 805.618, 341.8004, 112.7397, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 791.5938, 360.9132, 112.7524, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216447, 1112, 3, 1, 881.9948, 339.8767, 113.5446, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216447 (Area: 0)
(216428, 1112, 3, 1, 879.6458, 341.3559, 113.6302, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 884.3906, 339.1962, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216430, 1112, 3, 1, 881.2604, 343.3038, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 882.5087, 342.191, 112.6077, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 803.3958, 389.0347, 112.7413, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 885.3577, 338.3281, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 876.6528, 349.7656, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 879.1563, 345.8854, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 879.316, 351.3594, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 878.6285, 350.4566, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 889.8871, 339.1371, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 883.5555, 355.4445, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 894.0226, 345.6858, 111.8256, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 893.3368, 334.8108, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 882.2934, 354.1858, 113.7635, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 896.5816, 341.5191, 113.5568, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 889.283, 337.8715, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216440, 1112, 3, 1, 821.5538, 377.316, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216428, 1112, 3, 1, 891.6702, 338.191, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 868.9149, 380.191, 114.2571, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 892.2761, 344.783, 112.3835, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216440, 1112, 3, 1, 823.5903, 376.2535, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216434, 1112, 3, 1, 891.8646, 341.283, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 868.8403, 379.9601, 114.2193, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 869.5087, 378.6424, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 822.3629, 376.3316, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 868.8438, 380.066, 114.3403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 887.5486, 353.6597, 111.8257, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 816.7899, 385.8854, 192.8021, 1.173672, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 817.5938, 381.1806, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 823.4028, 391.2674, 192.8021, 4.666025, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 827.033, 386.3629, 192.8021, 0.8913446, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216428, 1112, 3, 1, 804.9514, 396.8871, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 803.9184, 397.9375, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 900.5278, 341.1094, 112.8403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 869.592, 410.7899, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 900.0087, 346.1146, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 825.1146, 388.0538, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216440, 1112, 3, 1, 838.6476, 380.408, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216432, 1112, 3, 1, 814.3542, 384.4757, 192.8021, 4.962904, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216448, 1112, 3, 1, 840.6702, 378.0608, 192.8409, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216448 (Area: 0)
(216428, 1112, 3, 1, 836.1528, 375.4931, 198.552, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 823.7448, 392.0504, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 829.5781, 392.3924, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 799.6059, 402.3837, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 807.6614, 400.7326, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 839.7518, 390.6215, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216439, 1112, 3, 1, 799.8802, 403.7465, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216440, 1112, 3, 1, 800.5278, 401.6458, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 840.118, 391.901, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 803.9028, 399.1754, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 827.1458, 393.5851, 192.8021, 5.145645, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 804.4983, 398.5573, 192.8021, 0.4392723, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 838.7587, 395.3993, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 801.9983, 402.4583, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 801.3246, 404.0799, 192.8021, 4.773621, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216434, 1112, 3, 1, 828.1805, 394.1667, 192.8021, 4.685394, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 825.6771, 390.9601, 194.7565, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216436, 1112, 3, 1, 820.0295, 396.9201, 192.8989, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216431, 1112, 3, 1, 799.5121, 402.658, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216435, 1112, 3, 1, 802.5121, 400.5781, 192.8021, 3.813956, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216439, 1112, 3, 1, 826.9288, 412.3333, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 880.0208, 424.3663, 112.8514, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216440, 1112, 3, 1, 818.6042, 418.0451, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 870.5938, 425, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 814.9479, 426.4132, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 807.2656, 420.0625, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 805.257, 418.5764, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 787.8351, 421.2986, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 815.4688, 426.2361, 192.9842, 0.2707927, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 811.2882, 416.9063, 192.8021, 1.228382, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216438, 1112, 3, 1, 804.4913, 427.434, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216450, 1112, 3, 1, 784.059, 423.7101, 194.8267, 0.7037894, 0, 0, 0, 1, 7200, 255, 1), -- 216450 (Area: 0)
(216430, 1112, 3, 1, 809.4601, 419.0191, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 815.4097, 426.2257, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 836.8229, 411.4913, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 805.0139, 431.632, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 815.4827, 430.3333, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 817.6771, 418.6823, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216440, 1112, 3, 1, 815.7413, 427.151, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216432, 1112, 3, 1, 815.5, 426.5625, 192.896, 1.110336, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 878.4219, 440.2031, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 843.5538, 410.8993, 192.8021, 5.433608, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 805.066, 434.132, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216434, 1112, 3, 1, 819.6129, 418.2483, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 809.3281, 418.2899, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 813.3733, 420.132, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 831.1927, 423.7361, 193.1975, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 824.4774, 416.6042, 192.8021, 4.960375, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216435, 1112, 3, 1, 834.7587, 414.0156, 192.8021, 5.107383, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216430, 1112, 3, 1, 882.1077, 434.5729, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 846.3021, 411.0573, 192.8021, 1.721142, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 815.2882, 425.882, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 805.2656, 435.3195, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216432, 1112, 3, 1, 815.75, 426.1111, 192.896, 1.110336, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 815.8507, 426.0295, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 880.4722, 436.4514, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 815.0226, 426.1406, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 879.3333, 436.8299, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 785.1962, 422.0174, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 815.3299, 426.5868, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 834.5018, 412.566, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216441, 1112, 3, 1, 805.4028, 422.8246, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 833.882, 412.9583, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 815.7049, 426.3576, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 815.309, 426.0868, 192.896, 1.110336, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 835.6528, 412.6458, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 805.7188, 424.7795, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 787.9375, 437.0972, 194.7894, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 787.0313, 435.2188, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216434, 1112, 3, 1, 847.9167, 412.9514, 192.8021, 1.028095, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 849.6424, 414.5695, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 823.0608, 431.4045, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 832.9358, 428.0417, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 786.2639, 435.7083, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 849.8351, 417.1615, 192.8021, 5.284794, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 819.0087, 435.8542, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 821.8264, 436.2431, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 823.1111, 433.9028, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216434, 1112, 3, 1, 838.9688, 429.349, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 849.1233, 409.5868, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 791.8489, 435.1806, 193.5708, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 816.8004, 435.7361, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 838.9149, 428.3594, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 825.9879, 434.0868, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 855.6371, 408.2326, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 837.3958, 429.2083, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 849.8455, 413.5347, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216436, 1112, 3, 1, 800.066, 440.2951, 192.9058, 0.8420751, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216441, 1112, 3, 1, 849.3629, 410.9618, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 879.9792, 443.0104, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 820.6302, 435.8715, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 831.934, 426.7847, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 852.1649, 413.1528, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 806.2031, 435.7743, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 840.368, 419.684, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 852.1302, 411.1163, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 822.8889, 434.5538, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216434, 1112, 3, 1, 879.8906, 441.9896, 111.8255, 5.298879, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216444, 1112, 3, 1, 847.8281, 411.2153, 192.8021, 5.669223, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 790.5764, 434.3351, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 879.3229, 444.7517, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 889.2101, 435.1649, 111.8757, 5.39765, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 880.5278, 446.9045, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216438, 1112, 3, 1, 888.4774, 433.7847, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 902.5538, 378.257, 115.9606, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 918.7465, 387.8524, 120.8416, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 855.0121, 432.4323, 192.9048, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216440, 1112, 3, 1, 866.4722, 397.5365, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216430, 1112, 3, 1, 884.0521, 448.4861, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216441, 1112, 3, 1, 866.9184, 396.8073, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 873.7847, 411.5938, 192.8298, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 832.1163, 450.1632, 192.8021, 1.028095, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 915.2587, 395.4826, 120.8812, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 836.4011, 446.9601, 192.8021, 5.284794, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 891.6563, 443.9809, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 919.7656, 399.8854, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 917.1893, 392.309, 121.1922, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 916.0833, 381.1267, 118.3374, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 918.9496, 392.6215, 121.2141, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 911.1771, 388.6736, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 847.6736, 428.2708, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 847.9774, 426.9653, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216433, 1112, 3, 1, 850.4688, 422.4427, 192.8021, 3.662159, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216428, 1112, 3, 1, 849.9913, 427.8958, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 919.9792, 391.5226, 121.1312, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 881.6389, 447.6892, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 845.7795, 428.408, 192.8021, 4.311733, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216440, 1112, 3, 1, 890.2413, 436.7934, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 835.9288, 440.7604, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 918.9757, 402.6563, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 859.5035, 427.0486, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 921.283, 390.6788, 120.9688, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 910.25, 411.7448, 116.1582, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 828.8542, 450.7639, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 888.8611, 446.5226, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 913.9566, 423.4149, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 888.8768, 446.4427, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216430, 1112, 3, 1, 898.3524, 450.4149, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 917.7847, 389.9583, 121.0973, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 918.6007, 390.6215, 121.1399, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 892.6632, 442.6996, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 909.4983, 399.066, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 887.7813, 447.6441, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216430, 1112, 3, 1, 920.3854, 384.5382, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 890.9722, 433.9896, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 851.9271, 423.5278, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 892.3333, 440.9653, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 845.9844, 443.8767, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 866.7292, 397.8941, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 865.1996, 395.7986, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216431, 1112, 3, 1, 848.257, 428.3681, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 896.1059, 447.9948, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 918.1754, 394.0677, 121.1534, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 850.007, 426.5017, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 890.8455, 444.8594, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 924.8073, 332.507, 112.7682, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 916.2049, 430.026, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 880.1285, 409.651, 192.8366, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 941.507, 443.9201, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 919.6823, 446.3455, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 924.7917, 396.3368, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 906.6823, 462.4861, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 909.6215, 330.5399, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 921.7864, 394.4427, 120.8919, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 921.7361, 388.3368, 120.7456, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 939.1771, 342.9653, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 907.6233, 331.5851, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 909.0469, 334.3142, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 898.7188, 431.1424, 192.8177, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 889.6511, 409.3142, 192.8269, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216440, 1112, 3, 1, 880.4149, 410.4236, 192.8364, 5.910839, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 865.6927, 444.3906, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 938.6545, 446.8264, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 906.9393, 469.7882, 113.03, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 898.908, 411.4931, 192.8173, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 922.5712, 397.8021, 120.2419, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 919.6788, 446.5486, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 906.6511, 337.7708, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 884.5729, 430.3871, 192.8322, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 922.2465, 404.5347, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 919.684, 446.4132, 112.8716, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 924.6285, 331.1528, 112.7682, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 881.2899, 410.1945, 192.8355, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 925.967, 392.6615, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216435, 1112, 3, 1, 906.2222, 390.7743, 192.8489, 4.331442, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216428, 1112, 3, 1, 943.217, 349.7552, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216447, 1112, 3, 1, 916.6528, 328.7413, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216447 (Area: 0)
(216438, 1112, 3, 1, 865.9393, 439.3073, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 884.3386, 418.9479, 192.8323, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 894.816, 412.2222, 192.8215, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 915.8281, 450.1632, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 901.1754, 412.0642, 192.815, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 955.2743, 404.5903, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 901.1528, 411.2882, 192.815, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 920.0087, 329.3681, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 903.0504, 418.9948, 192.8737, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 937.1632, 382.1632, 114.7522, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 938.6667, 446.559, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 880.0295, 430.8281, 192.8369, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 925.3837, 387.7379, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 890.3299, 428.75, 192.8262, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 918.533, 431.5104, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 890.408, 409.3889, 192.8261, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 919.5399, 426.2621, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 902.5087, 410.0399, 192.8138, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 899.2274, 427.5365, 192.8171, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 855.4896, 442.8542, 192.8021, 4.488292, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 879.9219, 432.2101, 192.8369, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 930.6597, 395.4201, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 867.6424, 443.0451, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 931.1875, 409.0295, 115.4081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 916.0156, 430.3004, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 882.0955, 428.658, 192.8348, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 901.1007, 411.007, 192.8151, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 914.1024, 328.5938, 112.7683, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 939.8577, 443.2674, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 942.2847, 347.4358, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 921.9323, 371.6684, 115.4255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 938.6146, 446.6875, 111.9297, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 925.7222, 338.7292, 112.7682, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 923.9236, 386.9896, 118.2412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216436, 1112, 3, 1, 932.9236, 327.5695, 112.9051, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216436, 1112, 3, 1, 950.9149, 430.0504, 113.2394, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216439, 1112, 3, 1, 900.7257, 431.5035, 192.8157, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216440, 1112, 3, 1, 916.0521, 400.3246, 192.8465, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216434, 1112, 3, 1, 901.0156, 430.1684, 192.8152, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 942.9045, 340.9618, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 941.9879, 445.408, 113.1367, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216434, 1112, 3, 1, 957.993, 399.8073, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216439, 1112, 3, 1, 916.0851, 395.3889, 192.8476, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 947.1649, 348.8976, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216441, 1112, 3, 1, 957.2101, 378.7066, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 939.4063, 333.6649, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 950.1268, 431.6146, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216440, 1112, 3, 1, 917.8386, 394.566, 192.8465, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216430, 1112, 3, 1, 929.007, 462.4132, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 956.7222, 381.9219, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 959.882, 360.7049, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 965.375, 398.7535, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 961.184, 402.4826, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 964.7309, 388.8906, 112.8192, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 964.5729, 388.9358, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 964.5364, 388.8958, 113.0752, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 964.3871, 395.4705, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 963.6285, 397.6024, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 964.257, 394.1424, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 964.3646, 394.1146, 112.8605, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 964.3837, 388.941, 113.2461, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 961.8802, 375.8733, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216444, 1112, 3, 1, 964.1788, 395.2951, 113.1516, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 952.4948, 348.6892, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 964.6996, 390.3038, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216428, 1112, 3, 1, 953.5573, 349.8142, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 964.368, 395.3906, 112.9144, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 961.8629, 384.1806, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 945.1042, 337.5938, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 954.4896, 348.3195, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216441, 1112, 3, 1, 965.1563, 399.507, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216447, 1112, 3, 1, 962.1875, 403.5469, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216447 (Area: 0)
(216444, 1112, 3, 1, 963.7049, 387.9688, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216428, 1112, 3, 1, 943.7413, 337.8646, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 928.809, 393.0938, 192.8415, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 954.757, 437.7778, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 911.2483, 440.9219, 192.849, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 946.9653, 374.882, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 952.5903, 441.3576, 111.9398, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216437, 1112, 3, 1, 920.7083, 335.776, 193.1038, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216432, 1112, 3, 1, 940.2118, 412.1563, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 964.7587, 330.2604, 112.7682, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 950.684, 336.8472, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 929.6476, 403.5903, 192.836, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 962.9618, 360.8507, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 939.3264, 421.0139, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 949.2066, 447.2135, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216431, 1112, 3, 1, 951.4288, 446.3767, 113.5488, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216434, 1112, 3, 1, 951.5625, 339.4028, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 944.9445, 408.1215, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 926.1389, 352.2986, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 927.592, 364.4427, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 921.2136, 380.0121, 192.8474, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 932.533, 404.1476, 192.8364, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 957.9358, 441.5868, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 930.6754, 361.1563, 192.9082, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216430, 1112, 3, 1, 955.9167, 438.0052, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216434, 1112, 3, 1, 914.2535, 338.941, 192.8489, 1.72118, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 952.3889, 432.7188, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216444, 1112, 3, 1, 954.9288, 436.8837, 111.9269, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 918.2188, 387.6996, 192.8478, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 962.2188, 455.9809, 112.768, 5.073532, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 908.441, 478.7882, 119.5508, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 954.007, 343.7118, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 920.691, 335.6285, 192.8453, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 947.8489, 410.625, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 954.5851, 445.2535, 113.6521, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 961.9705, 455.8733, 112.768, 5.073532, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 962.0868, 455.9236, 112.9106, 5.073532, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 934.0573, 374.5208, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 919.4653, 383.3629, 192.8479, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 937.1736, 411.9792, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 944.5764, 447.7917, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 923.2327, 369.9931, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 927.8472, 393.7621, 192.8408, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 911.5052, 441.375, 192.8486, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 932.7014, 419.9705, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 941.5347, 376.257, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 913.4844, 340.2188, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216444, 1112, 3, 1, 962.7934, 409.2778, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 915.3281, 440.8542, 192.8452, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 924.2361, 351.1076, 192.8489, 0.02101365, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216449, 1112, 3, 1, 955.6805, 335.9445, 112.1567, 2.077037, 0, 0, 0, 1, 7200, 255, 1), -- 216449 (Area: 0)
(216438, 1112, 3, 1, 963.5469, 360.7014, 112.7681, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216437, 1112, 3, 1, 920.3177, 340.5955, 192.9735, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216432, 1112, 3, 1, 910.8038, 440.7413, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 950.3715, 432.6181, 111.8254, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 954.5243, 340.3299, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 965.0538, 409.6406, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 950.0278, 334.6406, 111.8255, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 945.3611, 446.0295, 111.8917, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216439, 1112, 3, 1, 920.5521, 340.3733, 192.8477, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 954.7083, 435.2535, 111.9136, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 952.757, 446.7708, 113.7417, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 918.5695, 376.9549, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 911.5382, 440.4236, 192.8488, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 922.8004, 384.4792, 192.8452, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 953.5208, 444.434, 113.6916, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 960.8438, 428.4201, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216435, 1112, 3, 1, 921.4149, 352.125, 192.8489, 2.00742, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216430, 1112, 3, 1, 951.9566, 431.6493, 113.1478, 0.1094353, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 952.5295, 444.691, 113.7325, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 931.8507, 368.1233, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 941.4705, 429.0781, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 964.507, 456.8889, 112.8499, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 964.5799, 457.474, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 908.9983, 325.4115, 193.4748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 960.5938, 400.3246, 192.8372, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 949.6979, 417.7899, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 908.8715, 325.0625, 193.4878, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 959.9792, 401.842, 192.8358, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 912.3004, 322.1771, 194.5352, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 964.4375, 456.7309, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 964.5313, 456.9983, 112.7508, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 914.3281, 328.0764, 192.8475, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 964.6077, 457.3559, 112.8499, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 912.3229, 324.1701, 194.2006, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 964.5695, 457.257, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 943.3924, 419.2621, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 947.1614, 416.7726, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 948.0781, 413.3854, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216433, 1112, 3, 1, 939.3507, 431.5399, 192.3876, 4.343096, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216439, 1112, 3, 1, 942.8837, 339.8455, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 935.5261, 428.4757, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 953.9896, 409.3785, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 906.993, 322.1198, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216434, 1112, 3, 1, 959.559, 398.8021, 192.8884, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 938.7379, 425.474, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 965.1268, 456.9792, 112.768, 4.784197, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 945.4393, 422.3611, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 928.4132, 435.4323, 192.8349, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 951.3715, 420.7396, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 965.4254, 390.9254, 192.8459, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 936.5746, 439.8316, 192.8343, 4.858272, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 961.6077, 405.0885, 192.8346, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 975.3646, 415.4097, 193.4599, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 969.1042, 364.8837, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 975.3854, 414.3542, 192.8418, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 968.8611, 364.1719, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 964.0955, 392.2014, 192.8445, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 935.8299, 440.5695, 192.8346, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216437, 1112, 3, 1, 933.1823, 437.4479, 193.8474, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216440, 1112, 3, 1, 963.9445, 392.9167, 192.8439, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216444, 1112, 3, 1, 931.6215, 439.1424, 192.9228, 5.393912, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 933.7239, 437.8385, 192.8343, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 964.9254, 399.9896, 192.8386, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 945.6111, 431.8368, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 948.4688, 430.7986, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 953.1285, 441.2726, 192.8346, 0.8265992, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216435, 1112, 3, 1, 948.243, 442.9844, 192.8349, 0.6474373, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216437, 1112, 3, 1, 935.7518, 440.5695, 193.1051, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216440, 1112, 3, 1, 969.3785, 351.2517, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216432, 1112, 3, 1, 969.0382, 364.5486, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 943.7708, 438.0226, 192.8275, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 974.5764, 372.5521, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 965.0364, 457.6458, 112.768, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 972.9063, 368.6736, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 910.9948, 447.8941, 192.8479, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 968.0121, 353.4653, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 981.1302, 382.0208, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 949.7518, 441.1163, 192.8343, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 978.6059, 388.5885, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 965.2969, 457.2656, 112.768, 5.609516, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 945.6875, 438.4254, 192.8282, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 945.1996, 431.9236, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 979.6945, 395.5226, 192.8462, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 951.3698, 441.1545, 192.8344, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 964.3073, 432.9045, 192.8358, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 932.2986, 437.0938, 192.8344, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 944.632, 444.3715, 192.8355, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 954.0156, 340.9132, 191.7322, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 932.9705, 438.6198, 192.8346, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 952.1754, 423.4514, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 955.8489, 421.3576, 192.3876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 975.4618, 349.5938, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216434, 1112, 3, 1, 912.9601, 454.8385, 192.8448, 3.968451, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 976.8212, 418.5642, 192.843, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216433, 1112, 3, 1, 980.7847, 415.875, 192.8462, 0.5908855, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216435, 1112, 3, 1, 973.7691, 424.842, 192.8404, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216441, 1112, 3, 1, 946.9601, 444.6667, 192.8356, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 964.9114, 435.7014, 192.8366, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216439, 1112, 3, 1, 960.118, 334.8438, 192.8439, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 963.8559, 436.8246, 192.836, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 945.4271, 445.4514, 192.836, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 962.2118, 435.059, 192.8349, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 961.9184, 439.5504, 192.8353, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216434, 1112, 3, 1, 971.408, 427.9201, 192.8386, 0.8514287, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 950.3802, 444.7379, 192.8357, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 976.2239, 416.9826, 193.6209, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216430, 1112, 3, 1, 965.0104, 436.3507, 192.8367, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216444, 1112, 3, 1, 975.757, 423.875, 193.5656, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 920.0989, 450.7708, 192.8398, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 975.5226, 349.309, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216431, 1112, 3, 1, 906.941, 460.8542, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 906.967, 461.4844, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 909.1198, 459.684, 192.8474, 4.760029, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216431, 1112, 3, 1, 906.5521, 458.7118, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216432, 1112, 3, 1, 917.0087, 490.8438, 128.315, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 906.4479, 458.5903, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 916.1042, 458.9167, 192.9789, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216440, 1112, 3, 1, 908.8715, 462.2326, 192.8472, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216438, 1112, 3, 1, 912.6059, 465.1649, 192.8444, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 913.4879, 465.4201, 192.8443, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 927.691, 462.9722, 192.9646, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 911.2396, 465.5521, 192.8448, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 939.5799, 462.658, 192.8429, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216436, 1112, 3, 1, 967.3993, 442.6424, 192.8832, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216433, 1112, 3, 1, 914.493, 470.8924, 192.9636, 6.277122, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216440, 1112, 3, 1, 913.5764, 470.4722, 192.846, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216438, 1112, 3, 1, 912.0625, 466.2552, 192.8448, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 914.5035, 471.2014, 192.8463, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216434, 1112, 3, 1, 911.2136, 471.3264, 192.8463, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 923.3507, 472.5295, 192.8468, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 981.375, 435.3733, 192.8471, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 963.0364, 460.1667, 192.8419, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 982.1927, 432.3941, 192.8477, 5.342609, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 934.6805, 473.5521, 192.8472, 5.24119, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 979.6077, 447.0695, 192.8458, 0.5931268, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 915.7239, 472.0121, 192.8466, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216431, 1112, 3, 1, 916.0208, 471.8246, 192.8465, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216436, 1112, 3, 1, 971.8906, 445.0816, 192.9314, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216439, 1112, 3, 1, 964.8698, 458.1094, 192.8424, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 919.0955, 473.0608, 192.847, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 940.7761, 472.6042, 192.8469, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 934.4844, 474.0052, 192.8474, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 937.9549, 514.934, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 933.7882, 515.9305, 139.3037, 4.782719, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 935.0261, 473.9028, 192.8474, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 927.6198, 511.1597, 139.3207, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216436, 1112, 3, 1, 938.6198, 517.0677, 139.3834, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216431, 1112, 3, 1, 892.309, 515.3924, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 952.4219, 473.2726, 192.8472, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 954.257, 472.7379, 192.847, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 894.2917, 516.9462, 139.3036, 4.780567, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216439, 1112, 3, 1, 892.3594, 515.1545, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 901.7031, 516.8229, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216431, 1112, 3, 1, 951.9097, 473.3142, 192.8472, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216428, 1112, 3, 1, 890.5989, 515.4688, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216441, 1112, 3, 1, 900.4514, 520.8455, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216440, 1112, 3, 1, 950.4618, 472.8403, 192.847, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216428, 1112, 3, 1, 950.3281, 474.2604, 192.8476, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 932.0886, 525.0903, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 898.5886, 525.1406, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 902.2847, 527.7344, 139.4051, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216430, 1112, 3, 1, 931.8316, 528.5018, 140.195, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 931.6649, 526.9167, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216441, 1112, 3, 1, 897.2014, 528.1215, 140.0443, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216434, 1112, 3, 1, 897.2014, 526.2083, 140.0468, 4.898186, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216441, 1112, 3, 1, 931.7153, 528.9011, 140.2274, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 931.757, 526.5625, 140.2172, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216434, 1112, 3, 1, 913.342, 538.3177, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 908.243, 537.559, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 920.0347, 536.2674, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216436, 1112, 3, 1, 914.7917, 538.8976, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 922.8698, 535.1441, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 915.1215, 533.6754, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 911.8351, 535.2361, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 935.3316, 538.6632, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 907.3299, 540.6476, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 907.691, 535.368, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 935.9132, 534.0746, 139.3037, 5.446468, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 922.2743, 540.6302, 139.3036, 1.864181, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 936.2031, 536.9427, 140.6402, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 926.1511, 531.1389, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 912.0035, 537.4462, 139.334, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 923.0087, 539.2413, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 970.1198, 469.5781, 192.8457, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216440, 1112, 3, 1, 972.066, 467.7726, 192.846, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216438, 1112, 3, 1, 975.1962, 465.5799, 192.8466, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 913.375, 543.2083, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 972.4045, 469.5868, 192.8461, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216442, 1112, 3, 1, 971.6927, 467.5417, 193.1488, 3.908426, 0, 0, 0, 1, 7200, 255, 1), -- 216442 (Area: 0)
(216436, 1112, 3, 1, 930.1528, 541.8368, 139.4131, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216434, 1112, 3, 1, 974.3212, 459.8976, 192.8439, 1.204895, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216433, 1112, 3, 1, 874.8472, 534.2535, 146.1233, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216440, 1112, 3, 1, 892, 561.3594, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 921.9496, 547.3351, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216446, 1112, 3, 1, 921.2188, 562.7413, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216446 (Area: 0)
(216432, 1112, 3, 1, 919.8993, 548.6077, 139.3036, 4.907375, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 893.5903, 562.8455, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 890.993, 565.4913, 139.3662, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216428, 1112, 3, 1, 932.6476, 551.7656, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216441, 1112, 3, 1, 918.1302, 547.8976, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 898.7743, 558.0521, 140.2185, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 898.3246, 556.0469, 140.3139, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 921.4618, 546.6996, 139.3037, 1.145357, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 912.092, 561.0538, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 890.658, 558.0399, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 938.158, 542.2309, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 893.1406, 556.691, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 912.7239, 543.6632, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 927.7049, 559.0643, 139.3036, 4.996364, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 891.7604, 559.9809, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216428, 1112, 3, 1, 931.7847, 554.6371, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216434, 1112, 3, 1, 937.4132, 562.7361, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 909.6042, 562.5538, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 932.3871, 548.7136, 140.2603, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 922.1771, 550.7604, 139.3036, 4.549292, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 924.0313, 559.0035, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 930.2379, 556.8993, 140.0599, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 911.1146, 563.2587, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 936.618, 565.0226, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216434, 1112, 3, 1, 899.2587, 556.1805, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216444, 1112, 3, 1, 910.717, 546.0104, 139.3293, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216439, 1112, 3, 1, 891.5746, 559.967, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 919.1684, 560.1528, 139.3037, 5.493978, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 921.1424, 544.6285, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216441, 1112, 3, 1, 899.9792, 558.3004, 140.2155, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 916.9948, 543.757, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216440, 1112, 3, 1, 937.1649, 563.9496, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216444, 1112, 3, 1, 931.2743, 552.8316, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 890.6684, 563.2604, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216428, 1112, 3, 1, 920.1268, 545.3941, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 917.7535, 559.8976, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 932.1285, 550.1007, 140.2251, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216428, 1112, 3, 1, 911.1545, 548.5104, 139.3036, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 903.5434, 561.4011, 139.3037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 841.3542, 528.2587, 165.8056, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 838.7101, 520.2535, 165.7897, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 840.3733, 524.2309, 165.7835, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216430, 1112, 3, 1, 839.1563, 523.5816, 165.7737, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216444, 1112, 3, 1, 833.9427, 521.7483, 165.7708, 4.666649, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 979.25, 451.316, 192.8455, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 981.7917, 458.4861, 192.8471, 5.5414, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 979.7448, 448.8438, 192.8459, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 980.1996, 463.3629, 192.846, 4.820128, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 830.7031, 520.5521, 165.8689, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216436, 1112, 3, 1, 836.257, 530.4531, 165.8037, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216441, 1112, 3, 1, 840.6406, 556.4861, 166.4763, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 833.2552, 562.2795, 166.4723, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 824.0035, 520.1354, 165.9792, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 818.9496, 546.6302, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 825.6893, 518.0712, 166.0487, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216433, 1112, 3, 1, 841.0555, 554.1354, 166.4275, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216438, 1112, 3, 1, 824.4601, 541.9514, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 837.4948, 562.0347, 165.7757, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 821.4045, 504.6181, 171.5917, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 841.2535, 559.7518, 165.7921, 6.005611, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 825.0555, 538.5156, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 819.7639, 532.632, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 819.6146, 539.4097, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 835.4549, 561.9722, 166.4577, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 825.0799, 538.3212, 165.8333, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 828.1805, 536.5295, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 822.3854, 513.3889, 166.1074, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 838.8906, 558.2448, 165.845, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 825.0989, 538.1424, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 822.4774, 552, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 839.5643, 562.1893, 165.7839, 5.449406, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216438, 1112, 3, 1, 826.8333, 546.0347, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 840.8906, 554.6597, 165.8051, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 836.3472, 560.1163, 165.7595, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216441, 1112, 3, 1, 816.9097, 563.592, 165.9033, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 816.5364, 545.1493, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 807.4601, 508.1979, 168.8099, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 814.033, 543.7153, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 812.6962, 564.0712, 165.9499, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216434, 1112, 3, 1, 819.4948, 564.0226, 165.9098, 1.709704, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216436, 1112, 3, 1, 812.0295, 561.8246, 165.9585, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 814.3386, 544.5868, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 803.5521, 516.5695, 166.103, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 811.9913, 547.4722, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 818.7899, 552.4028, 165.9455, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 805.6042, 536.4028, 166.3962, 0.714636, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216438, 1112, 3, 1, 804.6962, 514.2483, 166.1016, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 809.408, 543.7327, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 817.3351, 563.6805, 165.9053, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216436, 1112, 3, 1, 812.4583, 536.1528, 165.7854, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 813.6823, 550.6077, 165.7579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 802.8125, 532.7969, 165.8789, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 802.3212, 520.9045, 166.0239, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 808.5781, 563.5156, 165.9458, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216434, 1112, 3, 1, 799.6302, 538.4132, 166.0303, 3.894592, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216436, 1112, 3, 1, 799.7882, 558.507, 166.0032, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216428, 1112, 3, 1, 797.1979, 561.3229, 166.0224, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216431, 1112, 3, 1, 798.618, 560.6528, 165.9995, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 798.9045, 560.882, 165.9989, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216440, 1112, 3, 1, 800.0087, 560.9583, 165.9877, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216438, 1112, 3, 1, 797.3594, 552.0712, 166.0519, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 795.7448, 528.5851, 166.0483, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216428, 1112, 3, 1, 794.5087, 552.4913, 166.1089, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 797.0868, 530.8403, 166.024, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 795.7448, 528.5851, 166.0483, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 793.3663, 552.632, 166.1066, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 793.6702, 532.8229, 166.106, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216440, 1112, 3, 1, 796.0052, 529.566, 166.0534, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216430, 1112, 3, 1, 794.1094, 559.1702, 166.0855, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 794.5, 525.283, 166.0488, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 793.7274, 557.6545, 166.1215, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216430, 1112, 3, 1, 793.5347, 556.6875, 166.1184, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216441, 1112, 3, 1, 796.7448, 521.5087, 166.8909, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 797.2934, 522.8611, 165.996, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 793.9132, 554.3906, 166.1128, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 794.5035, 530.5764, 166.8228, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216444, 1112, 3, 1, 796.066, 532.2969, 166.8058, 5.70156, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216445, 1112, 3, 1, 793.0643, 561.7309, 166.0905, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216445 (Area: 0)
(216428, 1112, 3, 1, 794.2899, 561.2691, 166.0579, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216433, 1112, 3, 1, 799.5104, 519.9861, 166.0452, 3.059045, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216440, 1112, 3, 1, 795.8507, 524.1111, 166.005, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216441, 1112, 3, 1, 796.9983, 534.1198, 166.0876, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216444, 1112, 3, 1, 793.5729, 528.2483, 166.1061, 5.981756, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 795.3055, 560.7621, 166.0399, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 839.4375, 451.4028, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 6614)
(216444, 1112, 3, 1, 840.0452, 449.316, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 6614)
(216432, 1112, 3, 1, 833.842, 451.7813, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216428, 1112, 3, 1, 834.0452, 450.7465, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 6614)
(216438, 1112, 3, 1, 803.2413, 465.5851, 192.8041, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 6614)
(216438, 1112, 3, 1, 820.9393, 464.724, 192.8108, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 6614)
(216432, 1112, 3, 1, 788.0816, 451.1945, 192.8021, 4.809044, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216432, 1112, 3, 1, 784.3629, 450.9688, 192.8021, 5.545057, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216432, 1112, 3, 1, 787.5521, 451.0451, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216432, 1112, 3, 1, 783.9774, 450.8785, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216432, 1112, 3, 1, 783.9688, 451.2813, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 6614)
(216430, 1112, 3, 1, 776.4601, 452.1337, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 6614)
(216444, 1112, 3, 1, 775.4618, 447.6563, 192.8021, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 6614)
(216432, 1112, 3, 1, 979.4636, 447.6285, 192.8457, 5.439386, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216436, 1112, 3, 1, 961.7535, 319.9063, 192.9412, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216430, 1112, 3, 1, 975.3004, 340.224, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 974.9844, 337.7691, 194.7426, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216433, 1112, 3, 1, 979.0972, 348.349, 192.8489, 3.599759, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216434, 1112, 3, 1, 910.1146, 317.1597, 193.4512, 5.546058, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216441, 1112, 3, 1, 977.8646, 333.0399, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216435, 1112, 3, 1, 972.7049, 329.9601, 192.8489, 4.773715, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216441, 1112, 3, 1, 972.0833, 337.9757, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 973.9149, 339.3229, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 976.4774, 333.5121, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 972.6962, 339.8681, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 912.7292, 318.3351, 193.8241, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 978.8299, 333.3264, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216441, 1112, 3, 1, 965.743, 314.5295, 192.8381, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 912.3021, 305.2986, 192.8596, 0.7784795, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 928.9323, 310.3733, 192.9234, 4.853306, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 912.9167, 305.1285, 192.8603, 5.356704, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 913.2899, 305.8681, 192.8573, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 932.0695, 306.3038, 193.6055, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 965.8004, 316.2344, 192.8349, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 912.8438, 306.5504, 192.8545, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 925.6111, 310.6233, 192.8404, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 932.8108, 309.5139, 194.066, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 913.5625, 306.2014, 192.8559, 0.8393173, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216444, 1112, 3, 1, 974.7656, 312.7899, 192.9287, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216432, 1112, 3, 1, 912.9011, 305.5208, 192.8587, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 913.5434, 305.5121, 192.8587, 5.214571, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 912.882, 305.9427, 192.857, 0.7954842, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 913.9114, 305.8646, 192.8573, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216434, 1112, 3, 1, 926.6146, 309.2778, 192.8427, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216438, 1112, 3, 1, 971.5469, 318.5486, 192.8206, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 967.9531, 289.2205, 192.9201, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 976.6268, 307.1736, 194.4114, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 966.9965, 286.8663, 192.9157, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 964.8906, 293.3611, 192.8405, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 928.4219, 279.559, 192.3679, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 930.6059, 299.3594, 192.3679, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 970.0104, 290.7639, 192.8361, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 963.6632, 280.8073, 192.9173, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 977.5364, 310.559, 192.8244, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 965.7587, 283.0417, 192.9123, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 958.3472, 292.4167, 192.9316, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216438, 1112, 3, 1, 943.7986, 285.1962, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 955.5851, 284.9861, 192.8336, 0.5983523, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 982.809, 299.2465, 192.848, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 972.4184, 307.0139, 192.8404, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 963.6545, 284.7969, 192.909, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 978.5886, 309.8438, 192.8237, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216451, 1112, 3, 1, 920.25, 283.2604, 194.9491, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216451 (Area: 0)
(216428, 1112, 3, 1, 967.0313, 281.9063, 192.8285, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 966.2222, 290.1024, 192.9233, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 976.2621, 305.4844, 194.7511, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 977.0555, 308.7326, 192.8287, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 969.3976, 286.9375, 192.914, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 982.6441, 300.0035, 192.8459, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 966, 280.5052, 192.8314, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216430, 1112, 3, 1, 973.6389, 304.1215, 192.8437, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 974.8802, 305.8681, 194.5401, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216428, 1112, 3, 1, 970.7014, 305.2205, 192.8447, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216434, 1112, 3, 1, 963.408, 289.2517, 192.9319, 1.466866, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216436, 1112, 3, 1, 958.2917, 276.7899, 192.9476, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216434, 1112, 3, 1, 959.7014, 258.5695, 192.8232, 5.001308, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216432, 1112, 3, 1, 966.1927, 257.1979, 192.8216, 1.153293, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 982.3386, 263.151, 192.8454, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216435, 1112, 3, 1, 913.4566, 261.901, 192.85, 1.564136, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216430, 1112, 3, 1, 971.9583, 258.217, 192.8315, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 981.1927, 263.3385, 192.8463, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 981.6163, 263.0451, 192.8445, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 965.1146, 276.8993, 194.5192, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 933.4479, 266.3472, 192.8432, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216435, 1112, 3, 1, 912.4688, 263.1233, 192.8553, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216444, 1112, 3, 1, 966.5903, 278.0174, 194.847, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216428, 1112, 3, 1, 931.3958, 266.9514, 192.8459, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 962.0208, 255.5747, 192.8217, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216428, 1112, 3, 1, 923.8264, 258.8976, 192.8396, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216430, 1112, 3, 1, 926.9254, 260.8229, 192.8432, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216439, 1112, 3, 1, 971.9514, 271.9757, 192.8399, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 932.1406, 259.4722, 192.8367, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216434, 1112, 3, 1, 923.3281, 261.1424, 194.1115, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216430, 1112, 3, 1, 931.1736, 260.5226, 192.8388, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 967.2483, 275.5712, 192.838, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 931.5521, 259.7934, 192.8376, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216432, 1112, 3, 1, 967.8958, 270.3646, 192.8401, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216435, 1112, 3, 1, 908.3698, 251.0174, 193.432, 1.364596, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216438, 1112, 3, 1, 975.0035, 252.5347, 192.9581, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 965.7882, 254.8958, 193.0426, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216435, 1112, 3, 1, 967.5555, 250.474, 192.8747, 4.243149, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216432, 1112, 3, 1, 974.2864, 250.3142, 192.8243, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 909.1614, 253.6597, 193.5024, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 972.7656, 257.1771, 192.8317, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216444, 1112, 3, 1, 972.3958, 255.0087, 192.9095, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216438, 1112, 3, 1, 951.1493, 245.533, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 925.5243, 216.3403, 192.8477, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 926.3958, 225.5243, 192.8898, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 971.6962, 243.4826, 192.8383, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216433, 1112, 3, 1, 978.3993, 220.8073, 192.8489, 0.1852796, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216434, 1112, 3, 1, 923.059, 242.6406, 192.8382, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216439, 1112, 3, 1, 924.5417, 228.2274, 192.8462, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 971.5816, 242.9618, 192.8391, 4.920197, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 972.0712, 245.8611, 192.8345, 4.912261, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 910.1024, 241.8941, 193.4863, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 914.7292, 229.2552, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 973.559, 235.0017, 193.1482, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 969.3055, 228.4514, 192.9933, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 966.0035, 247, 192.9972, 3.19371, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 930.9167, 239.3524, 192.8353, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 966.2066, 216.2292, 192.868, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216432, 1112, 3, 1, 973.9636, 229.1424, 194.8003, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 968.132, 234.4913, 192.843, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 969.0399, 244.059, 192.835, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 949.9583, 214.9479, 191.208, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 949.1476, 225.6806, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216441, 1112, 3, 1, 914.1476, 228.4549, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 921.1077, 218.7101, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 940.9167, 225.8906, 191.2081, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 971.4323, 230.7674, 193.5988, 5.580264, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 913.4792, 228.6563, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216434, 1112, 3, 1, 973.0695, 237.8906, 192.9432, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 974.4896, 232.0712, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 973.243, 226.1458, 192.9351, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 976.3143, 234.1146, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 965.6545, 228.4271, 193.0121, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216439, 1112, 3, 1, 925.5469, 213.3872, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216437, 1112, 3, 1, 969.125, 244.1129, 193.0029, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216430, 1112, 3, 1, 975.9114, 249.1493, 192.8306, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 968.9063, 233.3472, 192.8442, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 966.3542, 225.8576, 193.1575, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 972.8021, 243.7431, 192.8388, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216441, 1112, 3, 1, 907.875, 248.8194, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216428, 1112, 3, 1, 970.1024, 226.7708, 192.8491, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216428, 1112, 3, 1, 911.5712, 248.2691, 194.6729, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 926.5191, 204.0104, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 970.1511, 190.5017, 192.929, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216441, 1112, 3, 1, 918.2344, 192.7135, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216434, 1112, 3, 1, 932.6649, 209.7205, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 918.3316, 188.8872, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 918.9827, 187.3108, 192.8481, 5.208111, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 979.184, 189.1667, 192.8467, 1.090219, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 969.9393, 202.9497, 192.8475, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 966.4896, 206.0191, 192.9558, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216432, 1112, 3, 1, 924.3958, 200.783, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 927.3351, 211.6024, 192.8489, 1.2159, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216433, 1112, 3, 1, 913.1094, 189.3247, 192.8489, 2.732541, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216438, 1112, 3, 1, 942.8333, 199.2361, 191.6375, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216433, 1112, 3, 1, 913.007, 190.1233, 192.8489, 0.6815225, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216439, 1112, 3, 1, 979.5938, 190.7778, 192.8481, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 927.0087, 211.7379, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 921.9445, 192.3212, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216438, 1112, 3, 1, 928.4722, 188.0313, 192.8381, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 923.0121, 204.099, 192.849, 1.385626, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216432, 1112, 3, 1, 921.8351, 203.9479, 192.8489, 5.843323, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216431, 1112, 3, 1, 920.4202, 189.9965, 192.8492, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 918.6337, 184.0816, 192.8453, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 981.2136, 190.0069, 192.8489, 5.107591, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 920.3455, 189.7083, 192.8489, 1.190799, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216428, 1112, 3, 1, 915.2795, 192.8264, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216434, 1112, 3, 1, 974.3246, 201.6024, 192.8463, 1.059169, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216444, 1112, 3, 1, 977.4844, 214.1372, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216437, 1112, 3, 1, 912.6736, 168.8611, 193.0454, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216428, 1112, 3, 1, 913.1805, 174.9462, 192.8449, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 952.4496, 168.5885, 195.8929, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 913.467, 161.6944, 192.8403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 914.7222, 171.8594, 192.8405, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 978.5399, 169.3507, 192.8403, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216437, 1112, 3, 1, 912.8577, 169.1944, 192.9583, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216430, 1112, 3, 1, 913.5434, 175.151, 192.8441, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 978.4219, 170.2604, 192.8402, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216430, 1112, 3, 1, 979.9063, 181.6701, 192.8464, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216428, 1112, 3, 1, 979.0469, 178.3594, 192.8437, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216438, 1112, 3, 1, 957.7413, 175.625, 192.8217, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 933.6146, 176.1094, 192.8219, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 939.6233, 169.9254, 195.3303, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 938.0417, 161.4705, 197.0748, 0.6117935, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 934.8195, 160.0035, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 957.2327, 176.3004, 192.822, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 912.1146, 163.1667, 192.844, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 906.4531, 179.0104, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 955.1458, 159.6597, 197.0747, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 978.2621, 180.2813, 192.8424, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216439, 1112, 3, 1, 934.6476, 180.3438, 192.8251, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 912.8351, 168.8993, 192.8441, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 965.0538, 159.5816, 194.8241, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 915.8073, 178.658, 192.8431, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 915.3108, 164.7222, 192.8371, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 915.5989, 161.6163, 192.8349, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 933.1754, 176.0573, 192.822, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 953.3976, 159.5486, 197.0747, 5.230575, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 978.8889, 181.1875, 192.844, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216432, 1112, 3, 1, 908.6823, 170.941, 192.8489, 5.442293, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216441, 1112, 3, 1, 907.5677, 177.2413, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216430, 1112, 3, 1, 933.368, 158.7257, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 957.9983, 176.2309, 192.8223, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 956.6719, 149.3194, 197.0747, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216437, 1112, 3, 1, 951.8854, 153.566, 197.4343, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216438, 1112, 3, 1, 979.4636, 148.3038, 192.8407, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 930.816, 148.1563, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 934.3854, 142.5069, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216439, 1112, 3, 1, 948.0174, 144.2483, 197.2217, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216430, 1112, 3, 1, 959.2656, 150.2379, 197.0747, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 958.2083, 146.0208, 197.0747, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 977.882, 162.1198, 192.8369, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 951.8577, 153.6094, 197.1905, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216452, 1112, 3, 1, 945.9636, 149.4601, 197.0747, 1.597646, 0, 0, 0, 1, 7200, 255, 1), -- 216452 (Area: 0)
(216438, 1112, 3, 1, 976.9739, 161.7865, 192.8348, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216428, 1112, 3, 1, 932.7621, 142.8559, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216439, 1112, 3, 1, 938.5555, 155.6719, 197.1965, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 957.1129, 155.8229, 197.0747, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 948.2656, 142.7813, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 967.1146, 153.9132, 194.9028, 5.108449, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216431, 1112, 3, 1, 956.4028, 149.4774, 197.0747, 5.176833, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 934.6285, 146.7413, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 915.9722, 153.2656, 192.8741, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216430, 1112, 3, 1, 932.3472, 152.8889, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 949.3646, 143.1181, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216430, 1112, 3, 1, 931.3472, 155.2274, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 969.0087, 144.1285, 193.7185, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 932.3871, 145.3993, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216435, 1112, 3, 1, 914.2448, 125.5503, 192.8489, 3.790216, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216439, 1112, 3, 1, 975.0243, 135.5052, 192.8316, 5.055298, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 912.566, 131.1198, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 952.4028, 137.908, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216432, 1112, 3, 1, 941.092, 139.3524, 197.0748, 1.391814, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216439, 1112, 3, 1, 975.7761, 134.7361, 192.8335, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216438, 1112, 3, 1, 961.0087, 123.4722, 192.8215, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216432, 1112, 3, 1, 945.6476, 139.6111, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216432 (Area: 0)
(216438, 1112, 3, 1, 964.4427, 140.6875, 195.8855, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216437, 1112, 3, 1, 975.2813, 135.4566, 192.9527, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216437 (Area: 0)
(216441, 1112, 3, 1, 972.125, 137.8368, 192.8243, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216444, 1112, 3, 1, 942.0677, 135.1563, 197.0748, 4.798138, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216444, 1112, 3, 1, 970.8785, 137.184, 192.8228, 5.514085, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 947.5955, 134.9653, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 960.0243, 131.2031, 194.4973, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216434, 1112, 3, 1, 943.875, 136.9115, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216441, 1112, 3, 1, 950.9011, 128.0087, 195.4094, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 954.0972, 133.8333, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 934.3941, 138.7066, 197.0748, 0.9312627, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 941.3594, 137.1944, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 979.283, 147.4844, 192.8402, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 933.7396, 130.5938, 195.3528, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216436, 1112, 3, 1, 970.2882, 123.9149, 192.9048, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216441, 1112, 3, 1, 953.3594, 139.8212, 197.0748, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216438, 1112, 3, 1, 973.3246, 136.7344, 192.8274, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 926.8802, 119.6163, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 976.6893, 124.8872, 192.8381, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 949.4097, 118.2552, 192.8243, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 950.408, 98.87674, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216440, 1112, 3, 1, 909.1441, 98.0816, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216439, 1112, 3, 1, 979.6667, 110.1024, 192.8437, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 905.2917, 106.7795, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216430, 1112, 3, 1, 977.3299, 112.5642, 192.8392, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216431, 1112, 3, 1, 952.0417, 96.61459, 192.8489, 5.237377, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216439, 1112, 3, 1, 952.2761, 96.73264, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216436, 1112, 3, 1, 919.4965, 110.4549, 192.9339, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216436 (Area: 0)
(216440, 1112, 3, 1, 973.1719, 105.026, 192.8409, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216440 (Area: 0)
(216438, 1112, 3, 1, 960.9063, 115.7726, 192.8279, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 973.1788, 109.1128, 192.8373, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216441, 1112, 3, 1, 903.8542, 107.2674, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216431, 1112, 3, 1, 910.1389, 98.03125, 192.8489, 2.782543, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216434, 1112, 3, 1, 957.4566, 99.96181, 192.8489, 5.222929, 0, 0, 0, 1, 7200, 255, 1), -- 216434 (Area: 0)
(216428, 1112, 3, 1, 916.4184, 95.375, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216428 (Area: 0)
(216444, 1112, 3, 1, 904.2621, 108.7431, 192.8489, 5.641369, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216438, 1112, 3, 1, 914.4879, 108.191, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216444, 1112, 3, 1, 978.6215, 107.1597, 192.8416, 5.631484, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216435, 1112, 3, 1, 938.3715, 95.76215, 192.8489, 4.619582, 0, 0, 0, 1, 7200, 255, 1), -- 216435 (Area: 0)
(216433, 1112, 3, 1, 980.007, 122.0747, 194.1075, 5.138999, 0, 0, 0, 1, 7200, 255, 1), -- 216433 (Area: 0)
(216438, 1112, 3, 1, 975.9983, 102.4549, 192.8441, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216430, 1112, 3, 1, 971.7327, 98.19444, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216430 (Area: 0)
(216438, 1112, 3, 1, 915.3715, 117.7135, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 956.8004, 112.5556, 192.8314, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 971.9549, 104.7431, 192.8411, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 970.2066, 106.6771, 192.8387, 0.6476384, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 908.691, 99.15104, 192.8489, 1.190799, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216442, 1112, 3, 1, 909.132, 98.22396, 192.9349, 1.093301, 0, 0, 0, 1, 7200, 255, 1), -- 216442 (Area: 0)
(216438, 1112, 3, 1, 977.8507, 115.9965, 192.8402, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 977.7691, 115.1215, 192.8401, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216431, 1112, 3, 1, 971.5764, 104.6059, 192.8413, 4.583156, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 975.967, 103.4219, 192.843, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216438, 1112, 3, 1, 925.3889, 106.8455, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216439, 1112, 3, 1, 973.4514, 106.2813, 192.8396, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216439, 1112, 3, 1, 909.9445, 97.46354, 192.8489, 1.190799, 0, 0, 0, 1, 7200, 255, 1), -- 216439 (Area: 0)
(216444, 1112, 3, 1, 967.1788, 95.37327, 192.8489, 4.64513, 0, 0, 0, 1, 7200, 255, 1), -- 216444 (Area: 0)
(216431, 1112, 3, 1, 970.5729, 106.5642, 192.8389, 1.289689, 0, 0, 0, 1, 7200, 255, 1), -- 216431 (Area: 0)
(216438, 1112, 3, 1, 950.0746, 114.8003, 192.8324, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216438 (Area: 0)
(216441, 1112, 3, 1, 968.2743, 94.41493, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1), -- 216441 (Area: 0)
(216441, 1112, 3, 1, 966.4323, 94.42014, 192.8489, 0, 0, 0, 0, 1, 7200, 255, 1); -- 216441 (Area: 0)

UPDATE `gameobject` SET `spawnMask`='4096' WHERE `map` = '1112';

DELETE FROM `creature` WHERE `map` = '1112';
SET @CGUID := 1150300;
DELETE FROM `creature` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+68; 
DELETE FROM `creature_addon` WHERE `guid` BETWEEN @CGUID+0 AND @CGUID+68; 

INSERT INTO `creature` (`guid`, `id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `MovementType`) VALUES
(@CGUID+0, 68151, 1112, 3, 1, 495.1615, 190.474, 94.68225, 4.794763, 7200, 0, 0), -- 68151 (Area: 0) (Auras: )
(@CGUID+1, 68129, 1112, 3, 1, 682.2327, 422.2686, 112.7264, 6.219686, 7200, 0, 0), -- 68129 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+2, 68129, 1112, 3, 1, 715.6321, 424.5107, 112.7443, 3.128909, 7200, 0, 0), -- 68129 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+3, 68137, 1112, 3, 1, 702.953, 359.295, 125.145, 4.764749, 7200, 0, 0), -- 68137 (Area: 0) (Auras: 86603 - 86603)
(@CGUID+4, 68096, 1112, 3, 1, 708.3937, 935.5706, 53.14285, 6.11146, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+5, 68096, 1112, 3, 1, 786.9501, 692.3354, 73.50356, 1.45145, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+6, 68096, 1112, 3, 1, 749.5243, 618.7413, 92.85429, 1.564428, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+7, 68096, 1112, 3, 1, 674.8854, 792.3785, 64.10974, 1.361666, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+8, 68096, 1112, 3, 1, 703.2813, 609.3646, 100.2913, 1.564428, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+9, 68096, 1112, 3, 1, 656.9948, 618.4983, 93.379, 1.361666, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+10, 68096, 1112, 3, 1, 721.4531, 791.8264, 62.92337, 1.564428, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+11, 68096, 1112, 3, 1, 652.1082, 834.8557, 61.20424, 3.563231, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 134110 - 134110)
(@CGUID+14, 70023, 1112, 3, 1, 662.7712, 272.688, 355.0708, 2.46421, 7200, 0, 0), -- 70023 (Area: 0) (Auras: 46598 - 46598)
(@CGUID+15, 68156, 1112, 3, 1, 445.816, 136.8576, 94.91354, 0.454208, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+16, 68156, 1112, 3, 1, 531.6129, 218.2778, 94.89791, 4.344406, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+17, 68156, 1112, 3, 1, 469.0729, 215.0104, 94.84925, 5.479141, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+18, 68156, 1112, 3, 1, 541.7239, 156.0469, 95.00831, 2.703408, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+19, 68156, 1112, 3, 1, 458.5434, 204.1754, 95.42035, 5.715901, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+20, 68156, 1112, 3, 1, 449.8871, 198.7309, 95.17565, 5.849536, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+21, 68156, 1112, 3, 1, 543.2257, 135.783, 95.17218, 2.303097, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+22, 68156, 1112, 3, 1, 457.3507, 122.526, 94.83651, 0.7033542, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+23, 68156, 1112, 3, 1, 546.2726, 200.2431, 94.89764, 3.883757, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+24, 68156, 1112, 3, 1, 530.2299, 216.6229, 95.81644, 4.016278, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+25, 68156, 1112, 3, 1, 539.6618, 156.6892, 95.03586, 2.839647, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+26, 68156, 1112, 3, 1, 470.0891, 213.1137, 94.87185, 5.204213, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+27, 68156, 1112, 3, 1, 451.7043, 197.5636, 95.18044, 5.712196, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+28, 68156, 1112, 3, 1, 541.4638, 137.0185, 95.1883, 2.53003, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+29, 68156, 1112, 3, 1, 460.0903, 202.6794, 95.41346, 5.514536, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+30, 68156, 1112, 3, 1, 544.3741, 199.2259, 95.81747, 3.633469, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+31, 68156, 1112, 3, 1, 458.6056, 124.2739, 94.85831, 0.9481377, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+32, 68156, 1112, 3, 1, 447.5515, 138.1434, 94.93126, 0.6376326, 7200, 0, 0), -- 68156 (Area: 0) (Auras: )
(@CGUID+33, 68096, 1112, 3, 1, 884.3472, 77.50174, 112.825, 4.552809, 7200, 0, 0), -- 68096 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+34, 68096, 1112, 3, 1, 867.0139, 51.54167, 112.8226, 4.552809, 7200, 0, 0), -- 68096 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+35, 68173, 1112, 3, 1, 907.2205, 80.43403, 112.8293, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+36, 68173, 1112, 3, 1, 908.3333, 69.22916, 112.832, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+37, 68173, 1112, 3, 1, 928.2083, 67.15278, 112.8368, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+38, 68173, 1112, 3, 1, 922.3629, 55.05035, 112.8368, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+39, 68173, 1112, 3, 1, 941.9879, 73.61806, 112.8368, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+40, 68173, 1112, 3, 1, 940.1354, 57.6059, 112.8364, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+41, 68173, 1112, 3, 1, 935.2118, 82.28299, 112.82, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: 130966 - 130966)
(@CGUID+42, 68204, 1112, 3, 1, 888.0174, 343.7274, 111.909, 1.294714, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+43, 68204, 1112, 3, 1, 785.6215, 432.1545, 192.8854, 0.6369812, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+44, 68204, 1112, 3, 1, 791.816, 423.7986, 192.8854, 0.7551084, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+45, 68204, 1112, 3, 1, 858.2014, 407.3073, 192.8854, 2.348838, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+46, 68204, 1112, 3, 1, 885.5677, 441.4132, 111.9088, 5.734403, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+47, 68204, 1112, 3, 1, 917.5278, 466.1181, 112.8514, 4.580022, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+48, 68204, 1112, 3, 1, 956.5695, 386.6458, 112.8513, 5.459475, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+49, 68204, 1112, 3, 1, 946.3733, 443.757, 111.9087, 1.294714, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+50, 68204, 1112, 3, 1, 966.3229, 430.2726, 192.9191, 3.535519, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+51, 68204, 1112, 3, 1, 968.8038, 396.5746, 192.9256, 3.172317, 7200, 5, 1), -- 68204 (Area: -1) (Auras: 13299 - 13299) (possible waypoints or random movement)
(@CGUID+52, 68204, 1112, 3, 1, 966.8733, 379.276, 192.9322, 3.172317, 7200, 5, 1), -- 68204 (Area: -1) (Auras: 13299 - 13299) (possible waypoints or random movement)
(@CGUID+53, 68204, 1112, 3, 1, 944.8195, 468.7361, 192.9286, 4.539912, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+54, 68204, 1112, 3, 1, 917.559, 538.8871, 139.387, 2.021942, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+55, 68204, 1112, 3, 1, 971.0313, 461.7621, 192.928, 3.882648, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+56, 68204, 1112, 3, 1, 926.2049, 554.493, 139.387, 0.7551084, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+57, 68204, 1112, 3, 1, 813.7396, 514.2309, 166.1875, 1.630952, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+58, 68204, 1112, 3, 1, 799.1406, 526.3854, 166.0326, 0.4131479, 7200, 0, 0), -- 68204 (Area: -1) (Auras: 13299 - 13299)
(@CGUID+59, 68096, 1112, 3, 1, 884.3472, 77.50174, 112.825, 4.552809, 7200, 0, 0), -- 68096 (Area: 6614) (Auras: 130966 - 130966)
(@CGUID+60, 68096, 1112, 3, 1, 867.0139, 51.54167, 112.8226, 4.552809, 7200, 0, 0), -- 68096 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+61, 68204, 1112, 3, 1, 971.0052, 311.8403, 192.9173, 2.989808, 7200, 0, 0), -- 68204 (Area: 0) (Auras: 13299 - 13299)
(@CGUID+62, 68204, 1112, 3, 1, 965.0191, 286.9201, 192.9147, 3.176271, 7200, 0, 0), -- 68204 (Area: 0) (Auras: 13299 - 13299)
(@CGUID+63, 68204, 1112, 3, 1, 967.8559, 271.007, 192.9243, 2.882262, 7200, 0, 0), -- 68204 (Area: 0) (Auras: 13299 - 13299)
(@CGUID+64, 68175, 1112, 3, 1, 872.4271, 83.55035, 112.8208, 4.804974, 7200, 0, 0), -- 68175 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+65, 68175, 1112, 3, 1, 886.9844, 53.90451, 112.8255, 4.804974, 7200, 0, 0), -- 68175 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+66, 68175, 1112, 3, 1, 865.4045, 67.10416, 112.8341, 4.804974, 7200, 0, 0), -- 68175 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+67, 68175, 1112, 3, 1, 788.1528, 78.20139, 112.8208, 4.804974, 7200, 0, 0), -- 68175 (Area: 0) (Auras: 130966 - 130966)
(@CGUID+68, 68174, 1112, 3, 1, 784.5868, 68.80556, 112.8207, 3.196895, 7200, 0, 0); -- 68174 (Area: 0) (Auras: 130966 - 130966)

INSERT INTO `creature_addon` (`guid`, `mount`, `bytes1`, `bytes2`, `auras`) VALUES
(@CGUID+0, 0, 0x3000000, 0x1, ''), -- 68151
(@CGUID+1, 0, 0x0, 0x1, '134110'), -- 68129 - 134110 - 134110
(@CGUID+2, 0, 0x0, 0x1, '134110'), -- 68129 - 134110 - 134110
(@CGUID+3, 0, 0x0, 0x101, '86603'), -- 68137 - 86603 - 86603
(@CGUID+4, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+5, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+6, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+7, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+8, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+9, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+10, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+11, 0, 0x0, 0x1, '134110'), -- 68096 - 134110 - 134110
(@CGUID+14, 0, 0x0, 0x1, '46598'), -- 70023 - 46598 - 46598
(@CGUID+15, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+16, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+17, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+18, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+19, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+20, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+21, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+22, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+23, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+24, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+25, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+26, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+27, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+28, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+29, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+30, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+31, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+32, 0, 0x3000000, 0x1, ''), -- 68156
(@CGUID+33, 0, 0x40000, 0x1, '130966'), -- 68096 - 130966 - 130966
(@CGUID+34, 0, 0x40000, 0x1, '130966'), -- 68096 - 130966 - 130966
(@CGUID+35, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+36, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+37, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+38, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+39, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+40, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+41, 0, 0x40000, 0x1, '130966'), -- 68173 - 130966 - 130966
(@CGUID+42, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+43, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+44, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+45, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+46, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+47, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+48, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+49, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+50, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+51, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+52, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+53, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+54, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+55, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+56, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+57, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+58, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+59, 0, 0x40000, 0x1, '130966'), -- 68096 - 130966 - 130966
(@CGUID+60, 0, 0x40000, 0x1, '130966'), -- 68096 - 130966 - 130966
(@CGUID+61, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+62, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+63, 0, 0x0, 0x1, '13299'), -- 68204 - 13299 - 13299
(@CGUID+64, 0, 0x40000, 0x1, '130966'), -- 68175 - 130966 - 130966
(@CGUID+65, 0, 0x40000, 0x1, '130966'), -- 68175 - 130966 - 130966
(@CGUID+66, 0, 0x40000, 0x1, '130966'), -- 68175 - 130966 - 130966
(@CGUID+67, 0, 0x40000, 0x1, '130966'), -- 68175 - 130966 - 130966
(@CGUID+68, 0, 0x40000, 0x1, '130966'); -- 68174 - 130966 - 130966

INSERT INTO `creature` (`id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `MovementType`) VALUES

(68139, 1112, 3, 1, 552.0989, 100.3767, 112.4928, 0, 7200, 5, 1), -- 68139 (Area: 0) (possible waypoints or random movement)
(68139, 1112, 3, 1, 539.7864, 44.20488, 113.0291, 4.12912, 7200, 5, 1), -- 68139 (Area: 0) (possible waypoints or random movement)
(68176, 1112, 3, 1, 950.5692, 272.7035, 191.208, 4.752584, 7200, 5, 1), -- 68176 (Area: -1) (Auras: ) (possible waypoints or random movement)
(68176, 1112, 3, 1, 919.4375, 360.7326, 112.7681, 6.204089, 7200, 5, 1), -- 68176 (Area: -1) (possible waypoints or random movement)
(68176, 1112, 3, 1, 941.5487, 330.0183, 191.208, 4.702111, 7200, 5, 1), -- 68176 (Area: -1) (Auras: ) (possible waypoints or random movement)
(68205, 1112, 3, 1, 826.5243, 426.1701, 192.8854, 0, 7200, 5, 1), -- 68205 (Area: -1) (Auras: ) (possible waypoints or random movement)
(68205, 1112, 3, 1, 796.1597, 445.4288, 192.8854, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 858.0903, 435.2101, 192.8854, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 811.8489, 403.9201, 192.8854, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 929.4809, 337.4323, 192.9263, 0, 7200, 5, 1), -- 68205 (Area: -1) (Auras: ) (possible waypoints or random movement)
(68205, 1112, 3, 1, 938.7743, 440.3871, 192.9175, 4.416877, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68176, 1112, 3, 1, 945.2831, 200.6534, 191.584, 4.659534, 7200, 5, 1), -- 68176 (Area: -1) (Auras: ) (possible waypoints or random movement)
(68205, 1112, 3, 1, 916.0417, 455.3368, 192.9252, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 972.0972, 453.5174, 192.9247, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 963.9688, 466.3142, 192.9277, 0, 7200, 5, 1), -- 68205 (Area: -1) (possible waypoints or random movement)
(68205, 1112, 3, 1, 967.1007, 118.842, 192.9108, 0, 7200, 5, 1), -- 68205 (Area: 0) (possible waypoints or random movement)

(68139, 1112, 3, 1, 605.7375, 43.99578, 112.5394, 0.586427, 7200, 0, 0), -- 68139 (Area: 0) (Auras: )
(68139, 1112, 3, 1, 574.8438, 88.35243, 111.675, 2.910817, 7200, 0, 0), -- 68139 (Area: 0)
(48959, 1112, 3, 1, 520.0764, 119.7847, 95.2121, 4.570839, 7200, 0, 0), -- 48959 (Area: 0) (Auras: )
(68139, 1112, 3, 1, 504.5104, 97.68577, 102.4814, 0, 7200, 0, 0), -- 68139 (Area: 0) (Auras: )
(68139, 1112, 3, 1, 485.3472, 29.62326, 113.027, 0, 7200, 0, 0), -- 68139 (Area: 0)
(68139, 1112, 3, 1, 480.4688, 102.9167, 100.1891, 0, 7200, 0, 0), -- 68139 (Area: 0)
(68129, 1112, 3, 1, 821.6024, 393.5868, 112.8365, 2.938291, 7200, 0, 0), -- 68129 (Area: 0)
(68129, 1112, 3, 1, 805.0573, 215.559, 112.8581, 1.716444, 7200, 0, 0), -- 68129 (Area: 0)
(68139, 1112, 3, 1, 635.1111, 82.6684, 112.9668, 0, 7200, 0, 0), -- 68139 (Area: 0)
(68139, 1112, 3, 1, 590.8437, 55.19657, 111.2403, 4.739605, 7200, 0, 0), -- 68139 (Area: 0)
(68139, 1112, 3, 1, 591.5347, 68.84722, 111.7, 6.228536, 7200, 0, 0), -- 68139 (Area: 0)
(48959, 1112, 3, 1, 692.4983, 975.8663, 53.15389, 1.431978, 7200, 0, 0), -- 48959 (Area: 6614) (Auras: )
(48959, 1112, 3, 1, 811.5, 304.2153, 319.8432, 4.623281, 7200, 0, 0), -- 48959 (Area: 0)
(68174, 1112, 3, 1, 617.309, 51.33854, 112.3659, 3.065582, 7200, 0, 0), -- 68174 (Area: 0)
(68098, 1112, 3, 1, 722.382, 52.10764, 112.8416, 5.000422, 7200, 0, 0), -- 68098 (Area: 0)
(68176, 1112, 3, 1, 552.6022, 90.13266, 112.7368, 5.263785, 7200, 0, 0), -- 68176 (Area: 0)
(68173, 1112, 3, 1, 537.2188, 58.48611, 112.9948, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(24925, 1112, 3, 1, 686.2257, 90.37153, 113.8969, 4.683871, 7200, 0, 0), -- 24925 (Area: 0)
(68096, 1112, 3, 1, 688.8229, 77.00868, 112.8307, 1.353845, 7200, 0, 0), -- 68096 (Area: 0)
(24925, 1112, 3, 1, 785.3472, 437.441, 112.8202, 4.418662, 7200, 0, 0), -- 24925 (Area: 0)
(68174, 1112, 3, 1, 616.934, 81.92014, 112.5712, 3.285865, 7200, 0, 0), -- 68174 (Area: 0)
(68175, 1112, 3, 1, 514.8489, 43.95139, 113.3607, 2.119095, 7200, 0, 0), -- 68175 (Area: 0)
(68173, 1112, 3, 1, 582.2465, 90.98264, 111.0226, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(24925, 1112, 3, 1, 519.5643, 27.40104, 113.7059, 1.848674, 7200, 0, 0), -- 24925 (Area: 0)
(68173, 1112, 3, 1, 539.3368, 60.55903, 112.9527, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(24925, 1112, 3, 1, 604.7049, 100.7014, 112.3947, 4.720934, 7200, 0, 0), -- 24925 (Area: 0)
(68098, 1112, 3, 1, 729.3948, 50.81044, 112.7965, 5.503795, 7200, 0, 0), -- 68098 (Area: 0)
(68174, 1112, 3, 1, 505.1427, 45.59782, 112.9943, 1.924356, 7200, 0, 0), -- 68174 (Area: 0)
(68173, 1112, 3, 1, 579.8264, 84.02952, 111.3049, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(68176, 1112, 3, 1, 678.0955, 85.98438, 113.3956, 4.947288, 7200, 0, 0), -- 68176 (Area: 0)
(68175, 1112, 3, 1, 496.2326, 41.3507, 112.9365, 1.516021, 7200, 0, 0), -- 68175 (Area: 0)
(68096, 1112, 3, 1, 618.2924, 426.7511, 112.7299, 1.133698, 7200, 0, 0), -- 68096 (Area: 0)
(24925, 1112, 3, 1, 604.1684, 27.61979, 113.039, 1.725896, 7200, 0, 0), -- 24925 (Area: 0)
(68173, 1112, 3, 1, 548.1632, 59.44097, 112.8686, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(68173, 1112, 3, 1, 584.3646, 93.05729, 112.9711, 3.639493, 7200, 0, 0), -- 68173 (Area: 0)
(68098, 1112, 3, 1, 736.3068, 50.56361, 112.7721, 4.592618, 7200, 0, 0), -- 68098 (Area: 0)
(68176, 1112, 3, 1, 690.2639, 84.24827, 112.829, 4.680732, 7200, 0, 0), -- 68176 (Area: 0)
(24925, 1112, 3, 1, 871.7413, 95.67709, 113.0359, 4.633818, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 770.783, 227.2743, 112.8511, 0.5924702, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 825.2604, 37.57639, 113.0549, 1.509913, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 869.6927, 39.69618, 113.0337, 1.525022, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 730.7014, 39.75695, 112.8316, 1.442701, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 625.9739, 440.9445, 112.813, 4.713146, 7200, 0, 0), -- 24925 (Area: 0)
(68096, 1112, 3, 1, 631.2465, 429.9983, 112.8056, 2.56329, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 782.408, 241.2899, 112.8389, 4.23985, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 773.625, 425.8073, 112.8136, 1.178373, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 820.6684, 48.8316, 112.8208, 5.643242, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 787.3577, 228.6267, 112.8616, 3.149416, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 787.2205, 425.4254, 112.8128, 2.268806, 7200, 0, 0), -- 68096 (Area: 0)
(68096, 1112, 3, 1, 833.9844, 51.6007, 112.8208, 4.552809, 7200, 0, 0), -- 68096 (Area: 0)
(24925, 1112, 3, 1, 559.2552, 97.94444, 112.6822, 4.416274, 7200, 0, 0), -- 24925 (Area: 0)
(68173, 1112, 3, 1, 533.1083, 56.27695, 113.1, 1.912962, 7200, 0, 0), -- 68173 (Area: 0)
(68098, 1112, 3, 1, 565.1389, 860.5712, 60.41071, 2.884951, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 643.6007, 814.0816, 66.90215, 4.869011, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 590.0989, 809.3281, 67.75562, 3.56252, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 815.8906, 942.5886, 56.09103, 0.1819205, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 766.3368, 758.8368, 66.90642, 3.433177, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 758.25, 809.382, 62.16552, 4.28284, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 635.4132, 666.0417, 75.20685, 3.747124, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 817.118, 810.7934, 63.60135, 0.01522689, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 788.4896, 906.5608, 56.15923, 0.1133963, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 739.592, 768.0955, 65.0506, 0.08178994, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 779.2813, 672.868, 74.94015, 0.1133963, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 833.0261, 814.5729, 68.08537, 5.948734, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 600.467, 798.5417, 68.1734, 3.809406, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 614.2621, 677.3993, 77.6059, 5.056222, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 816.0295, 949.4531, 56.66157, 0, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 828.9757, 891.9323, 56.59322, 3.709364, 7200, 0, 0), -- 68098 (Area: 6614)
(48959, 1112, 3, 1, 692.4983, 975.8663, 53.15389, 1.431978, 7200, 0, 0), -- 48959 (Area: 6614)
(68098, 1112, 3, 1, 626.2743, 767.9827, 71.80292, 0.4816875, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 625.4445, 888.1858, 60.75486, 4.393919, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 778.1493, 892.1441, 57.12646, 5.153865, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 568.3524, 904.3316, 62.5806, 2.632841, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 679.3038, 761.9722, 66.54983, 2.39819, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 788.5278, 673.9028, 75.33443, 4.540572, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 640.0504, 970.6476, 55.22389, 1.838768, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 582.2448, 897.1111, 61.63237, 4.377175, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 622.6927, 793.7066, 68.93011, 5.913659, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 620.5746, 972.3993, 56.04506, 1.369655, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 608.8073, 902.4479, 58.58552, 2.649779, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 833.6441, 821.592, 67.32189, 6.263145, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 784.4705, 672.6441, 75.31322, 4.475197, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 836.8455, 830.7761, 61.11158, 5.098485, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 817.4063, 822.8438, 61.42133, 0.7521592, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 830.2101, 830.4132, 61.01655, 5.247926, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 628.5486, 971.875, 55.72108, 1.565673, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 742.3316, 806.0417, 61.68855, 5.272964, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 729.6059, 785.1788, 63.42687, 6.23949, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 774.2743, 797.1406, 65.86894, 3.653966, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 801.6354, 889.7118, 56.68818, 5.127728, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 648.033, 760.4167, 66.94144, 6.240579, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 653.3854, 887.7049, 57.07092, 0.6088008, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 619.4514, 677.1736, 76.77335, 4.839234, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 794.8611, 916.625, 57.0405, 5.234081, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 669.368, 803.993, 63.5269, 3.971552, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 807, 908.7205, 57.04861, 3.295237, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 656.6476, 810.5851, 62.73532, 4.307107, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 838.1302, 706.9375, 102.2187, 6.254525, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 565.8768, 848.7205, 61.16533, 2.980337, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 635.3316, 812.1198, 67.55955, 5.276021, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 739.8316, 757.5434, 66.20416, 6.218624, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 732.1493, 795.8246, 62.53314, 5.817801, 7200, 0, 0), -- 68098 (Area: 6614)
(68098, 1112, 3, 1, 836.7136, 688.4202, 103.3453, 0.1318696, 7200, 0, 0), -- 68098 (Area: 6614)
(68176, 1112, 3, 1, 949.0018, 182.6754, 192.5053, 1.556783, 7200, 0, 0), -- 68176 (Area: -1) (Auras: )
(68176, 1112, 3, 1, 940.8924, 183.2413, 192.4725, 1.556783, 7200, 0, 0), -- 68176 (Area: -1)
(24925, 1112, 3, 1, 977.0452, 447.0121, 192.9276, 3.165927, 7200, 0, 0), -- 24925 (Area: -1)
(68096, 1112, 3, 1, 631.2465, 429.9983, 112.8056, 2.56329, 7200, 0, 0), -- 68096 (Area: -1)
(68096, 1112, 3, 1, 617.439, 424.9248, 112.7314, 4.275287, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(24925, 1112, 3, 1, 625.9739, 440.9445, 112.813, 4.713146, 7200, 0, 0), -- 24925 (Area: -1)
(68174, 1112, 3, 1, 929.0469, 276.6042, 192.4513, 1.307627, 7200, 0, 0), -- 68174 (Area: -1) (Auras: )
(24925, 1112, 3, 1, 819.2535, 556.5469, 165.8674, 4.744931, 7200, 0, 0), -- 24925 (Area: -1)
(68175, 1112, 3, 1, 879.0121, 347.1458, 111.9089, 0.3268642, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 945.6563, 339.8142, 111.9089, 2.056559, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 951.2413, 347.7049, 111.9088, 3.613232, 7200, 0, 0), -- 68175 (Area: -1)
(68176, 1112, 3, 1, 768.9462, 420.5997, 112.7347, 3.980425, 7200, 0, 0), -- 68176 (Area: -1) (Auras: )
(68175, 1112, 3, 1, 928.1059, 378.0885, 192.9322, 3.916942, 7200, 0, 0), -- 68175 (Area: -1) (Auras: )
(68175, 1112, 3, 1, 845.9393, 416.8056, 192.8854, 3.797893, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 808.316, 422.2465, 192.8854, 3.797893, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 921.6059, 402.3472, 192.9254, 4.006752, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 970.6719, 332.9879, 192.9322, 3.08292, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 833.4809, 443.191, 192.8854, 3.945359, 7200, 0, 0), -- 68175 (Area: -1)
(68175, 1112, 3, 1, 953.5156, 403.7309, 112.8513, 0.1131939, 7200, 0, 0), -- 68175 (Area: -1)
(68096, 1112, 3, 1, 789.3234, 700.496, 73.09606, 2.20922, 7200, 0, 0), -- 68096 (Area: -1)
(24925, 1112, 3, 1, 813.4219, 698.4913, 74.22099, 3.416291, 7200, 0, 0), -- 24925 (Area: -1)
(68176, 1112, 3, 1, 920.9358, 467.2483, 192.928, 5.629481, 7200, 0, 0), -- 68176 (Area: -1)
(68096, 1112, 3, 1, 773.1044, 720.6663, 70.59444, 5.634838, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(68175, 1112, 3, 1, 936.2847, 453.8021, 192.9226, 5.010785, 7200, 0, 0), -- 68175 (Area: -1)
(68176, 1112, 3, 1, 619.5556, 429.4547, 112.7276, 4.275287, 7200, 0, 0), -- 68176 (Area: -1) (Auras: )
(68096, 1112, 3, 1, 614.496, 704.3826, 77.59982, 5.090357, 7200, 0, 0), -- 68096 (Area: -1)
(68096, 1112, 3, 1, 782.037, 752.1671, 69.97025, 2.286486, 7200, 0, 0), -- 68096 (Area: -1)
(68096, 1112, 3, 1, 625.982, 695.5641, 75.00004, 4.619586, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(24925, 1112, 3, 1, 813.1684, 742.6059, 69.88568, 3.416291, 7200, 0, 0), -- 24925 (Area: -1)
(68176, 1112, 3, 1, 869.5667, 544.0701, 150.371, 3.186027, 7200, 0, 0), -- 68176 (Area: -1)
(68096, 1112, 3, 1, 764.7236, 770.9492, 64.93471, 5.634678, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(24925, 1112, 3, 1, 594.0868, 706.5417, 76.09451, 0.02691444, 7200, 0, 0), -- 24925 (Area: -1)
(68173, 1112, 3, 1, 910.658, 349.1597, 112.8516, 2.081449, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 923.8768, 467.5642, 112.8513, 4.589949, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 911.3316, 468.3333, 112.8514, 4.589949, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 891.9829, 424.1826, 192.8246, 1.961445, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 887.9271, 427.1129, 192.9121, 3.639493, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 886.8629, 417.5712, 192.9131, 3.639493, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 918.4647, 337.0683, 112.7682, 4.043825, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 922.5322, 346.9235, 112.7682, 3.354351, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 943.1371, 417.3281, 192.4709, 3.639493, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 937.2552, 418.0017, 192.4709, 3.639493, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 942.1166, 428.0018, 192.3876, 1.249832, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 940.2733, 424.149, 192.3876, 5.349673, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 950.3464, 420.1337, 192.3876, 5.515597, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 957.2836, 419.1319, 192.3876, 3.582006, 7200, 0, 0), -- 68173 (Area: -1)
(68173, 1112, 3, 1, 951.2551, 422.6938, 192.3876, 4.570667, 7200, 0, 0), -- 68173 (Area: -1)
(68205, 1112, 3, 1, 927.1007, 524.6424, 139.387, 0, 7200, 0, 0), -- 68205 (Area: -1)
(68205, 1112, 3, 1, 904.2344, 551.6077, 139.387, 0, 7200, 0, 0), -- 68205 (Area: -1) (Auras: )
(24925, 1112, 3, 1, 833.5018, 851.7656, 60.90322, 3.416291, 7200, 0, 0), -- 24925 (Area: -1)
(68096, 1112, 3, 1, 802.7148, 849.0053, 60.81005, 2.766707, 7200, 0, 0), -- 68096 (Area: -1)
(68173, 1112, 3, 1, 821.4636, 534.1893, 165.8412, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 825.816, 548.191, 165.8412, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68096, 1112, 3, 1, 766.2195, 857.4915, 59.11313, 3.288553, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 827.441, 538.7188, 165.8412, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 816.2621, 547.0746, 165.8412, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 810.2847, 542.5452, 165.8412, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68096, 1112, 3, 1, 625.2845, 800.2937, 67.83463, 2.245055, 7200, 0, 0), -- 68096 (Area: -1) (Auras: )
(68173, 1112, 3, 1, 811.3489, 552.0868, 166.1041, 3.639493, 7200, 0, 0), -- 68173 (Area: -1) (Auras: )
(68096, 1112, 3, 1, 604.6937, 832.7332, 66.31116, 5.202237, 7200, 0, 0), -- 68096 (Area: 6614)
(24925, 1112, 3, 1, 932.6754, 101.7274, 192.9322, 1.226746, 7200, 0, 0), -- 24925 (Area: 6614)
(24925, 1112, 3, 1, 871.7413, 95.67709, 113.0359, 4.633818, 7200, 0, 0), -- 24925 (Area: 6614)
(24925, 1112, 3, 1, 958.3229, 102.8125, 192.9322, 1.526131, 7200, 0, 0), -- 24925 (Area: 6614)
(68096, 1112, 3, 1, 820.6684, 48.8316, 112.8208, 5.643242, 7200, 0, 0), -- 68096 (Area: 0)
(24925, 1112, 3, 1, 949.2743, 67.40625, 113.0689, 3.120959, 7200, 0, 0), -- 24925 (Area: 0)
(68096, 1112, 3, 1, 833.9844, 51.6007, 112.8208, 4.552809, 7200, 0, 0), -- 68096 (Area: 0)
(24925, 1112, 3, 1, 825.2604, 37.57639, 113.0549, 1.509913, 7200, 0, 0), -- 24925 (Area: 0)
(24925, 1112, 3, 1, 869.6927, 39.69618, 113.0337, 1.525022, 7200, 0, 0), -- 24925 (Area: 0)
(68206, 1112, 3, 1, 928.7292, 291.7986, 192.4512, 4.726189, 7200, 0, 0), -- 68206 (Area: 0) (Auras: )
(68205, 1112, 3, 1, 970.3611, 249.4288, 192.9013, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68205, 1112, 3, 1, 923.4462, 233.3941, 192.9283, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68205, 1112, 3, 1, 966.993, 231.7691, 192.9271, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68176, 1112, 3, 1, 778.507, 231.6771, 112.8501, 5.951292, 7200, 0, 0), -- 68176 (Area: 0) (Auras: )
(68174, 1112, 3, 1, 919.6823, 113.0885, 192.9322, 0.7683518, 7200, 0, 0), -- 68174 (Area: 0)
(68206, 1112, 3, 1, 951.2465, 162.6267, 197.1581, 1.673244, 7200, 0, 0), -- 68206 (Area: 0)
(68205, 1112, 3, 1, 920.8594, 170.0938, 192.9123, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68205, 1112, 3, 1, 970.3507, 171.2135, 192.9105, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68206, 1112, 3, 1, 940.2101, 161.3559, 197.1581, 1.673244, 7200, 0, 0), -- 68206 (Area: 0)
(68206, 1112, 3, 1, 957.8507, 108.9375, 192.9256, 2.306569, 7200, 0, 0), -- 68206 (Area: 0)
(68205, 1112, 3, 1, 931.9063, 110.3958, 192.9322, 0, 7200, 0, 0), -- 68205 (Area: 0)
(68129, 1112, 3, 1, 599.9757, 216.4601, 112.8204, 1.506386, 7200, 0, 0), -- 68129 (Area: 0)
(24925, 1112, 3, 1, 559.2552, 97.94444, 112.6822, 4.416274, 7200, 0, 0); -- 24925 (Area: 0)


UPDATE `creature` SET `spawnMask`='4096' WHERE `map` = '1112';

DELETE FROM `creature_equip_template` WHERE `entry` IN (68204, 68098, 68096, 68129, 68137, 68175, 68176);
INSERT INTO `creature_equip_template` (`entry`, `itemEntry1`, `itemEntry2`, `itemEntry3`) VALUES
(68096, 29651, 0, 13924), -- 68096
(68129, 29681, 0, 13924), -- 68129
(68137, 30699, 0, 0), -- 68137
(68175, 32731, 0, 0), -- 68175
(68176, 32729, 0, 0), -- 68176
(68098, 14707, 0, 0), -- 68098
(68204, 32731, 32731, 0); -- 68204

DELETE FROM `scenario_poi` WHERE `criteriaTreeId` IN (31009, 31011, 31013, 31020, 31018, 31022, 31035);
INSERT INTO `scenario_poi` (`criteriaTreeId`, `id`, `mapid`, `WorldMapAreaId`, `unk12`, `unk16`, `unk20`, `unk24`, `unk28`) VALUES
('31009', '0', '1112', '919', '0', '0', '0', '1359', '0'),
('31011', '1', '1112', '919', '2', '0', '0', '1566', '0'),
('31013', '2', '1112', '919', '3', '0', '0', '0', '0'),
('31020', '3', '1112', '919', '3', '0', '0', '0', '0'),
('31018', '4', '1112', '919', '3', '0', '0', '658', '0'),
('31022', '5', '1112', '919', '3', '0', '0', '0', '0'),
('31035', '5', '1112', '919', '7', '0', '0', '0', '0');

DELETE FROM `scenario_poi_points` WHERE `criteriaTreeId` IN (31009, 31011, 31013, 31020, 31018, 31022, 31035);
INSERT INTO `scenario_poi_points` (`criteriaTreeId`, `id`, `idx`, `x`, `y`) VALUES 
('31009', '0', '0', '702', '593'),
('31011', '0', '0', '702', '364'),
('31013', '0', '0', '687', '62'),
('31020', '0', '0', '496', '168'),
('31018', '0', '0', '494', '164'),
('31022', '0', '0', '779', '62'),
('31035', '0', '0', '677', '305');

