-- Add ruRU offer rewards for quest 10729,10730,10731,10732
-- https://wowroad.info/?quest=10729
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10729,10730,10731,10732) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10729, 'ruRU', 'Ты $Gуверен:уверена; в своем решении, $N? Тебе предстоит сделать очень непростой выбор.$B$BСила перстня Аметистового Ока станет возрастать по мере того, как ты будешь доказывать нам свою преданность.', 0),
(10730, 'ruRU', 'Ты $Gуверен:уверена; в своем решении, $N? Тебе предстоит сделать очень непростой выбор.$B$BСила перстня Аметистового Ока станет возрастать по мере того, как ты будешь доказывать нам свою преданность.', 0),
(10731, 'ruRU', 'Ты $Gуверен:уверена; в своем решении, $N? Тебе предстоит сделать очень непростой выбор.$B$BСила перстня Аметистового Ока станет возрастать по мере того, как ты будешь доказывать нам свою преданность.', 0),
(10732, 'ruRU', 'Ты $Gуверен:уверена; в своем решении, $N? Тебе предстоит сделать очень непростой выбор.$B$BСила перстня Аметистового Ока станет возрастать по мере того, как ты будешь доказывать нам свою преданность.', 0);

-- Add ruRU offer rewards for quest 11031,11032,11033,11034
-- https://wowroad.info/?quest=11031
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (11031,11032,11033,11034) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(11031, 'ruRU', 'Прими это следующее решение тщательно. Мы делаем все возможное, чтобы помочь нашим союзникам, но даже ресурсы Даларана имеют свои пределы.', 0),
(11032, 'ruRU', 'Прими это следующее решение тщательно. Мы делаем все возможное, чтобы помочь нашим союзникам, но даже ресурсы Даларана имеют свои пределы.', 0),
(11033, 'ruRU', 'Прими это следующее решение тщательно. Мы делаем все возможное, чтобы помочь нашим союзникам, но даже ресурсы Даларана имеют свои пределы.', 0),
(11034, 'ruRU', 'Прими это следующее решение тщательно. Мы делаем все возможное, чтобы помочь нашим союзникам, но даже ресурсы Даларана имеют свои пределы.', 0);

-- Add ruRU offer rewards for quest 13265,13269,13270,13272
-- https://wowroad.info/?quest=13265
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13265,13269,13270,13272) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13265, 'ruRU', 'Получи пару лишних кусочков ткани и сшей из них нечто сногсшибательное!', 0),
(13269, 'ruRU', 'Получи пару лишних кусочков ткани и сшей из них нечто сногсшибательное!', 0),
(13270, 'ruRU', 'Получи пару лишних кусочков ткани и сшей из них нечто сногсшибательное!', 0),
(13272, 'ruRU', 'Получи пару лишних кусочков ткани и сшей из них нечто сногсшибательное!', 0);

-- Add ruRU offer rewards for quest 9884,9885,9886,9887
-- https://wowroad.info/?quest=9884
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9884,9885,9886,9887) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9884, 'ruRU', 'Консорциум хорошо известен тем, что хорошо заботится о своих друзьях. В начале каждого месяца я буду иметь несколько драгоценных камней, готовых для тебя в качестве оплаты за ваши услуги.$B$BКачество драгоценных камней, которые ты получишь, будет зависеть от того, насколько ты $Gбыл:была; $Gлоялен:лояльна; к нам. Будем надеяться, что ты поступишь разумно и останешься с нами.', 0),
(9885, 'ruRU', 'Консорциум хорошо известен тем, что хорошо заботится о своих друзьях. В начале каждого месяца я буду иметь несколько драгоценных камней, готовых для тебя в качестве оплаты за ваши услуги.$B$BКачество драгоценных камней, которые ты получишь, будет зависеть от того, насколько ты $Gбыл:была; $Gлоялен:лояльна; к нам. Будем надеяться, что ты поступишь разумно и останешься с нами.', 0),
(9886, 'ruRU', 'Консорциум хорошо известен тем, что хорошо заботится о своих друзьях. В начале каждого месяца я буду иметь несколько драгоценных камней, готовых для тебя в качестве оплаты за ваши услуги.$B$BКачество драгоценных камней, которые ты получишь, будет зависеть от того, насколько ты $Gбыл:была; $Gлоялен:лояльна; к нам. Будем надеяться, что ты поступишь разумно и останешься с нами.', 0),
(9887, 'ruRU', 'Консорциум хорошо известен тем, что хорошо заботится о своих друзьях. В начале каждого месяца я буду иметь несколько драгоценных камней, готовых для тебя в качестве оплаты за ваши услуги.$B$BКачество драгоценных камней, которые ты получишь, будет зависеть от того, насколько ты $Gбыл:была; $Gлоялен:лояльна; к нам. Будем надеяться, что ты поступишь разумно и останешься с нами.', 0);

-- Add ruRU offer rewards for quest 11103,11104,11105,11106
-- https://wowroad.info/?quest=11103
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (11103,11104,11105,11106) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(11103, 'ruRU', 'Пески времени легко текут вперед. Их можно заставить течь назад, но с большим трудом.', 0),
(11104, 'ruRU', 'Пески времени легко текут вперед. Их можно заставить течь назад, но с большим трудом.', 0),
(11105, 'ruRU', 'Пески времени легко текут вперед. Их можно заставить течь назад, но с большим трудом.', 0),
(11106, 'ruRU', 'Пески времени легко текут вперед. Их можно заставить течь назад, но с большим трудом.', 0);

-- Add ruRU offer rewards for quest 10725,10726,10727,10728
-- https://wowroad.info/?quest=10725
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10725,10726,10727,10728) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10725, 'ruRU', 'Теперь твой перстень сравнялся по силе с перстнем любого из верховных магов Совета. Носи его, не снимая. По нему посвященный признает, чьим союзником ты являешься. И пусть сила послужить тебе добром, так же, как ты $Gслужил:служила; нам!', 0),
(10726, 'ruRU', 'Теперь твой перстень сравнялся по силе с перстнем любого из верховных магов Совета. Носи его, не снимая. По нему посвященный признает, чьим союзником ты являешься. И пусть сила послужить тебе добром, так же, как ты $Gслужил:служила; нам!', 0),
(10727, 'ruRU', 'Теперь твой перстень сравнялся по силе с перстнем любого из верховных магов Совета. Носи его, не снимая. По нему посвященный признает, чьим союзником ты являешься. И пусть сила послужить тебе добром, так же, как ты $Gслужил:служила; нам!', 0),
(10728, 'ruRU', 'Теперь твой перстень сравнялся по силе с перстнем любого из верховных магов Совета. Носи его, не снимая. По нему посвященный признает, чьим союзником ты являешься. И пусть сила послужить тебе добром, так же, как ты $Gслужил:служила; нам!', 0);

-- Add ruRU offer rewards for quest 11657,11923,11924,11925
-- https://cata.wowroad.info/?quest=11657
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (11657,11923,11924,11925) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(11657, 'ruRU', 'Не $Gобжегся:обожглась;? Если да, то дважды подумай прежде, чем играть с огнем...$B$BШучу! Все вышло здорово! И это уже не шутка. Ты – отличный огненный жонглер! Теперь иди, веселись!', 0),
(11923, 'ruRU', 'Не $Gобжегся:обожглась;? Если да, то дважды подумай прежде, чем играть с огнем...$B$BШучу! Все вышло здорово! И это уже не шутка. Ты – отличный огненный жонглер! Теперь иди, веселись!', 0),
(11924, 'ruRU', 'Не $Gобжегся:обожглась;? Если да, то дважды подумай прежде, чем играть с огнем...$B$BШучу! Все вышло здорово! И это уже не шутка. Ты – отличный огненный жонглер! Теперь иди, веселись!', 0),
(11925, 'ruRU', 'Не $Gобжегся:обожглась;? Если да, то дважды подумай прежде, чем играть с огнем...$B$BШучу! Все вышло здорово! И это уже не шутка. Ты – отличный огненный жонглер! Теперь иди, веселись!', 0);

-- Add ruRU offer rewards for quest 13676,13777,13782,13787
-- https://cata.wowroad.info/?quest=13676
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13676,13777,13782,13787) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13676, 'ruRU', 'Ты $Gпоказал:показала; свою силу в бою, $N, и твой пример вдохновит других претендентов, желающих сражаться под знаменами Альянса.', 0),
(13777, 'ruRU', 'Ты $Gпоказал:показала; свою силу в бою, $N, и твой пример вдохновит других претендентов, желающих сражаться под знаменами Альянса.', 0),
(13782, 'ruRU', 'Ты $Gпоказал:показала; свою силу в бою, $N, и твой пример вдохновит других претендентов, желающих сражаться под знаменами Альянса.', 0),
(13787, 'ruRU', 'Ты $Gпоказал:показала; свою силу в бою, $N, и твой пример вдохновит других претендентов, желающих сражаться под знаменами Альянса.', 0);

-- Add ruRU offer rewards for quest 13592,13744,13755,13760
-- https://cata.wowroad.info/?quest=13592
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13592,13744,13755,13760) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13592, 'ruRU', 'С возвращением, $N. Даже во время тренировок мы не должны забывать о реальной угрозе, с которой придется иметь дело после окончания турнира.', 0),
(13744, 'ruRU', 'С возвращением, $N. Даже во время тренировок мы не должны забывать о реальной угрозе, с которой придется иметь дело после окончания турнира.', 0),
(13755, 'ruRU', 'С возвращением, $N. Даже во время тренировок мы не должны забывать о реальной угрозе, с которой придется иметь дело после окончания турнира.', 0),
(13760, 'ruRU', 'С возвращением, $N. Даже во время тренировок мы не должны забывать о реальной угрозе, с которой придется иметь дело после окончания турнира.', 0);

-- Add ruRU offer rewards for quest 10468,10469,10470,10471
-- https://cata.wowroad.info/?quest=10468
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10468,10469,10470,10471) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10468, 'ruRU', 'Ты $Gдостойный:достойная; $Gсоюзник:союзница;. Ты растешь в наших глазах, а вместе с тем прирастает и сила твоего кольца Вечности.', 0),
(10469, 'ruRU', 'Ты $Gдостойный:достойная; $Gсоюзник:союзница;. Ты растешь в наших глазах, а вместе с тем прирастает и сила твоего кольца Вечности.', 0),
(10470, 'ruRU', 'Ты $Gдостойный:достойная; $Gсоюзник:союзница;. Ты растешь в наших глазах, а вместе с тем прирастает и сила твоего кольца Вечности.', 0),
(10471, 'ruRU', 'Ты $Gдостойный:достойная; $Gсоюзник:союзница;. Ты растешь в наших глазах, а вместе с тем прирастает и сила твоего кольца Вечности.', 0);

-- Add ruRU offer rewards for quest 10472,10473,10474,10475
-- https://cata.wowroad.info/?quest=10472
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10472,10473,10474,10475) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10472, 'ruRU', 'Ты пребываешь в единстве со временем, $N. Ты – $Gодин:одна; из нас. В капле воды из Источника Вечности заключена величайшая сила, превосходящая воображение смертных.$B$BПрими этот дар, и пусть все знают, что ты $Gзаключил:заключила; договор с драконами Песчаной Чешуи... а это значит, что ты $Gзаключил:заключила; договор с самим временем.', 0),
(10473, 'ruRU', 'Ты пребываешь в единстве со временем, $N. Ты – $Gодин:одна; из нас. В капле воды из Источника Вечности заключена величайшая сила, превосходящая воображение смертных.$B$BПрими этот дар, и пусть все знают, что ты $Gзаключил:заключила; договор с драконами Песчаной Чешуи... а это значит, что ты $Gзаключил:заключила; договор с самим временем.', 0),
(10474, 'ruRU', 'Ты пребываешь в единстве со временем, $N. Ты – $Gодин:одна; из нас. В капле воды из Источника Вечности заключена величайшая сила, превосходящая воображение смертных.$B$BПрими этот дар, и пусть все знают, что ты $Gзаключил:заключила; договор с драконами Песчаной Чешуи... а это значит, что ты $Gзаключил:заключила; договор с самим временем.', 0),
(10475, 'ruRU', 'Ты пребываешь в единстве со временем, $N. Ты – $Gодин:одна; из нас. В капле воды из Источника Вечности заключена величайшая сила, превосходящая воображение смертных.$B$BПрими этот дар, и пусть все знают, что ты $Gзаключил:заключила; договор с драконами Песчаной Чешуи... а это значит, что ты $Gзаключил:заключила; договор с самим временем.', 0);

-- Add ruRU offer rewards for quest 10326,10327,10654,10655
-- https://cata.wowroad.info/?quest=10326
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10326,10327,10654,10655) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10326, 'ruRU', 'Вы растете в наших глазах, $N. Боритесь с врагами Света повсюду, и ваши подвиги будут достойно вознаграждены.$B$B<Это задание можно выполнять до тех пор, пока вы не заслужите почтительное отношение.>', 0),
(10327, 'ruRU', 'Вы растете в наших глазах, $N. Боритесь с врагами Света повсюду, и ваши подвиги будут достойно вознаграждены.$B$B<Это задание можно выполнять до тех пор, пока вы не заслужите почтительное отношение.>', 0),
(10654, 'ruRU', 'Вы растете в наших глазах, $N. Боритесь с врагами Света повсюду, и ваши подвиги будут достойно вознаграждены.$B$B<Это задание можно выполнять до тех пор, пока вы не заслужите почтительное отношение.>', 0),
(10655, 'ruRU', 'Вы растете в наших глазах, $N. Боритесь с врагами Света повсюду, и ваши подвиги будут достойно вознаграждены.$B$B<Это задание можно выполнять до тех пор, пока вы не заслужите почтительное отношение.>', 0);

-- Add ruRU offer rewards for quest 10733,10734,10735,10736
-- https://cata.wowroad.info/?quest=10733
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10733,10734,10735,10736) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10733, 'ruRU', 'Ты оказываешь нам честь своей службой, $N. Смотри, как я высвобождаю силу, заключенную в твоей печатке!', 0),
(10734, 'ruRU', 'Ты оказываешь нам честь своей службой, $N. Смотри, как я высвобождаю силу, заключенную в твоей печатке!', 0),
(10735, 'ruRU', 'Ты оказываешь нам честь своей службой, $N. Смотри, как я высвобождаю силу, заключенную в твоей печатке!', 0),
(10736, 'ruRU', 'Ты оказываешь нам честь своей службой, $N. Смотри, как я высвобождаю силу, заключенную в твоей печатке!', 0);

-- Add ruRU offer rewards for quest 10738,10739,10740,10741
-- https://cata.wowroad.info/?quest=10738
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10738,10739,10740,10741) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10738, 'ruRU', 'Твое служение не осталось незамеченным, $N. Этот перстень внешне не изменяется, но сила его возрастает по мере того, как ты доказываешь нам свою преданность.', 0),
(10739, 'ruRU', 'Твое служение не осталось незамеченным, $N. Этот перстень внешне не изменяется, но сила его возрастает по мере того, как ты доказываешь нам свою преданность.', 0),
(10740, 'ruRU', 'Твое служение не осталось незамеченным, $N. Этот перстень внешне не изменяется, но сила его возрастает по мере того, как ты доказываешь нам свою преданность.', 0),
(10741, 'ruRU', 'Твое служение не осталось незамеченным, $N. Этот перстень внешне не изменяется, но сила его возрастает по мере того, как ты доказываешь нам свою преданность.', 0);

-- Add ruRU offer rewards for quest 9617,10529,10530
-- https://wowroad.info/?quest=9617
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9617,10529,10530) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9617, 'ruRU', '$N, хорошо, что вы пришли. Список наших союзников становится все меньше, и даже тем, кто разделяет наше дело, не полностью доверяют. Именно поэтому мы обращаемся за помощью к природе.$B$BВ союзниках леса мы находим глубокую связь, не знающую обмана.', 0),
(10529, 'ruRU', '$N, хорошо, что вы пришли. Список наших союзников становится все меньше, и даже тем, кто разделяет наше дело, не полностью доверяют. Именно поэтому мы обращаемся за помощью к природе.$B$BВ союзниках леса мы находим глубокую связь, не знающую обмана.', 0),
(10530, 'ruRU', '$N, хорошо, что вы пришли. Список наших союзников становится все меньше, и даже тем, кто разделяет наше дело, не полностью доверяют. Именно поэтому мы обращаемся за помощью к природе.$B$BВ союзниках леса мы находим глубокую связь, не знающую обмана.', 0);

-- Add ruRU offer rewards for quest 12785,12788,12812
-- https://wowroad.info/?quest=12785
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (12785,12788,12812) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(12785, 'ruRU', 'Ах, очень хорошо. Болезни, которые несет эта сгнившая голова, смертельны, но мы не должны избегать опасности или того, что нам неприятно. Когда-нибудь, $N, ты узнаешь, что проклятие - это путь к спасению…', 0),
(12788, 'ruRU', 'Ах, очень хорошо. Болезни, которые несет эта сгнившая голова, смертельны, но мы не должны избегать опасности или того, что нам неприятно. Когда-нибудь, $N, ты узнаешь, что проклятие - это путь к спасению…', 0),
(12812, 'ruRU', 'Ах, очень хорошо. Болезни, которые несет эта сгнившая голова, смертельны, но мы не должны избегать опасности или того, что нам неприятно. Когда-нибудь, $N, ты узнаешь, что проклятие - это путь к спасению…', 0);

-- Add ruRU offer rewards for quest 13318,13323,13353
-- https://wowroad.info/?quest=13318
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13318,13323,13353) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13318, 'ruRU', 'Не правда ли, эффективное оружие – в соответствующих обстоятельствах, конечно?$B$BЭтот трюк никогда не устаревает...', 0),
(13323, 'ruRU', 'Не правда ли, эффективное оружие – в соответствующих обстоятельствах, конечно?$B$BЭтот трюк никогда не устаревает...', 0),
(13353, 'ruRU', 'Не правда ли, эффективное оружие – в соответствующих обстоятельствах, конечно?$B$BЭтот трюк никогда не устаревает...', 0);

-- Add ruRU offer rewards for quest 9547,9551,10491
-- https://wowroad.info/?quest=9547
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9547,9551,10491) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9547, 'ruRU', 'И, наконец, мы подошли к последнему из четырех великих элементов: воздуху. Ты считаешь себя достаточно $Gмудрым:мудрой;, чтобы продолжить, $N?', 0),
(9551, 'ruRU', 'И, наконец, мы подошли к последнему из четырех великих элементов: воздуху. Ты считаешь себя достаточно $Gмудрым:мудрой;, чтобы продолжить, $N?', 0),
(10491, 'ruRU', 'И, наконец, мы подошли к последнему из четырех великих элементов: воздуху. Ты считаешь себя достаточно $Gмудрым:мудрой;, чтобы продолжить, $N?', 0);

-- Add ruRU offer rewards for quest 10460,10462,10463
-- https://wowroad.info/?quest=10460
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10460,10462,10463) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10460, 'ruRU', 'Ты $Gверен:уверена;, что хочешь избрать этот путь, $N? Он будет нелегким, так что трижды подумай, прежде чем примешь решение.$B$BВ этом кольце заключена капля воды из Источника Вечности. Его сила возрастет, когда ты заслужишь доверие драконов Песчаной Чешуи.', 0),
(10462, 'ruRU', 'Ты $Gверен:уверена;, что хочешь избрать этот путь, $N? Он будет нелегким, так что трижды подумай, прежде чем примешь решение.$B$BВ этом кольце заключена капля воды из Источника Вечности. Его сила возрастет, когда ты заслужишь доверие драконов Песчаной Чешуи.', 0),
(10463, 'ruRU', 'Ты $Gверен:уверена;, что хочешь избрать этот путь, $N? Он будет нелегким, так что трижды подумай, прежде чем примешь решение.$B$BВ этом кольце заключена капля воды из Источника Вечности. Его сила возрастет, когда ты заслужишь доверие драконов Песчаной Чешуи.', 0);

-- Add ruRU offer rewards for quest 13154,13196,13197
-- https://wowroad.info/?quest=13154
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13154,13196,13197) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13154, 'ruRU', 'Прекрасно! Этих дровишек хватит, чтобы костер войны не угасал еще долго.', 0),
(13196, 'ruRU', 'Прекрасно! Этих дровишек хватит, чтобы костер войны не угасал еще долго.', 0),
(13197, 'ruRU', 'Прекрасно! Этих дровишек хватит, чтобы костер войны не угасал еще долго.', 0);

-- Add ruRU offer rewards for quest 12763,12770,12793
-- https://wowroad.info/?quest=12763
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (12763,12770,12793) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(12763, 'ruRU', 'Во имя Света!', 0),
(12770, 'ruRU', 'Во имя Света!', 0),
(12793, 'ruRU', 'Во имя Света!', 0);

-- Add ruRU offer rewards for quest 9114,9115,9116
-- https://wowroad.info/?quest=9114,9115,9116
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9114,9115,9116) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9114, 'ruRU', 'Отлично, $N! У тебя все то, что мне нужно и теперь я сделаю для тебя наплечные пластины Веры.', 0),
(9115, 'ruRU', 'Отлично, $N! У тебя все то, что мне нужно и теперь я сделаю для тебя наплечные пластины Веры.', 0),
(9116, 'ruRU', 'Отлично, $N! У тебя все то, что мне нужно и теперь я сделаю для тебя наплечные пластины Веры.', 0);

-- Add ruRU offer rewards for quest 9208,9209,9210
-- https://wowroad.info/?quest=9208
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9208,9209,9210) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9208, 'ruRU', 'Беспокойная магия этих чар, усиливает мой гнев. Гнев, дает мне силы.$B$BПриноси мне больше таких знаков и я выдам тебе еще один такой знак защиты.', 0),
(9209, 'ruRU', 'Беспокойная магия этих чар, усиливает мой гнев. Гнев, дает мне силы.$B$BПриноси мне больше таких знаков и я выдам тебе еще один такой знак защиты.', 0),
(9210, 'ruRU', 'Беспокойная магия этих чар, усиливает мой гнев. Гнев, дает мне силы.$B$BПриноси мне больше таких знаков и я выдам тебе еще один такой знак защиты.', 0);

-- Add ruRU offer rewards for quest 13321,13322,13357
-- https://wowroad.info/?quest=13321,13322,13357
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (13321,13322,13357) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13321, 'ruRU', 'Ур-ра!$B$BТо-то же! Будут знать!', 0),
(13322, 'ruRU', 'Ур-ра!$B$BТо-то же! Будут знать!', 0),
(13357, 'ruRU', 'Ур-ра!$B$BТо-то же! Будут знать!', 0);

-- Add ruRU offer rewards for quest 9500,9502,10490
-- https://wowroad.info/?quest=9500
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9500,9502,10490) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9500, 'ruRU', 'Мы встретились снова. Я издали наблюдал за твоими успехами, $C, и я доволен.$B$BПришло время тебе пообщаться с водной стихией, узнать ее тайны и отдаться воде, чтобы ты, в свою очередь, $Gнаучился:научилась; управлять ею.', 0),
(9502, 'ruRU', 'Мы встретились снова. Я издали наблюдал за твоими успехами, $C, и я доволен.$B$BПришло время тебе пообщаться с водной стихией, узнать ее тайны и отдаться воде, чтобы ты, в свою очередь, $Gнаучился:научилась; управлять ею.', 0),
(10490, 'ruRU', 'Мы встретились снова. Я издали наблюдал за твоими успехами, $C, и я доволен.$B$BПришло время тебе пообщаться с водной стихией, узнать ее тайны и отдаться воде, чтобы ты, в свою очередь, $Gнаучился:научилась; управлять ею.', 0);

-- Add ruRU offer rewards for quest 11921,11922,11926
-- https://cata.wowroad.info/?quest=11921
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (11921,11922,11926) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(11921, 'ruRU', 'Ух ты! Ну ты и даешь! Может, на следующий год получишь работку на празднике!', 0),
(11922, 'ruRU', 'Ух ты! Ну ты и даешь! Может, на следующий год получишь работку на празднике!', 0),
(11926, 'ruRU', 'Ух ты! Ну ты и даешь! Может, на следующий год получишь работку на празднике!', 0);

-- Add ruRU offer rewards for quest 9121,9122,9123
-- https://cata.wowroad.info/?quest=9121
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (9121,9122,9123) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(9121, 'ruRU', 'Ты почувствуешь легкое покалывание, $N. Это ощущение означает, что все сработало. После окончания, ты сможешь зайти в Наксрамас, ступив на руны портала в чаще Чумного леса.', 0),
(9122, 'ruRU', 'Ты почувствуешь легкое покалывание, $N. Это ощущение означает, что все сработало. После окончания, ты сможешь зайти в Наксрамас, ступив на руны портала в чаще Чумного леса.', 0),
(9123, 'ruRU', 'Ты почувствуешь легкое покалывание, $N. Это ощущение означает, что все сработало. После окончания, ты сможешь зайти в Наксрамас, ступив на руны портала в чаще Чумного леса.', 0);

-- Add ruRU offer rewards for quest 10464,10465,10466
-- https://cata.wowroad.info/?quest=10464
DELETE FROM `quest_offer_reward_locale` WHERE `id` IN (10464,10465,10466) AND `locale` = 'ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(10464, 'ruRU', 'Ты оправдал наше доверие, |3-6($R). Во всяком случае, до сих пор у нас не было повода усомниться в тебе.$B$BУчти, что доверие супруги и помощницы Ноздорму непросто заслужить.', 0),
(10465, 'ruRU', 'Ты оправдал наше доверие, |3-6($R). Во всяком случае, до сих пор у нас не было повода усомниться в тебе.$B$BУчти, что доверие супруги и помощницы Ноздорму непросто заслужить.', 0),
(10466, 'ruRU', 'Ты оправдал наше доверие, |3-6($R). Во всяком случае, до сих пор у нас не было повода усомниться в тебе.$B$BУчти, что доверие супруги и помощницы Ноздорму непросто заслужить.', 0);
