--
DELETE FROM `quest_request_items_locale` WHERE `id` IN (9034,9036,9037,9038,9039,9040,9041,9042,9043,9044,9045,9046,9047,9048,9049,9050,9054,9055,9056,9057,9058,9059,9060,9061,9068,9069,9070,9071,9072,9074,9077,9079,9096,9097,9098,9099,9100,9101,9102,9103,9104,9105,9106,9107,9108,9109,9110,9111,9112,9113,9117,9118) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9034, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9036, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9037, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9038, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9039, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9040, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9041, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9042, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9043, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9044, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9045, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9046, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9047, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9048, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9049, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9050, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9054, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9055, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9056, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9057, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9058, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9059, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9060, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9061, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9068, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9069, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9070, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9071, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9072, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9074, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9077, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9079, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9096, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9097, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9098, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9099, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9100, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9101, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9102, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9103, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9104, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9105, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9106, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9107, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9108, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9109, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9110, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9111, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9112, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9113, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9117, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0),
(9118, 'ruRU', "У вас есть недостающие детали для задания, пожалуйста, идите и получите их все!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8496,8497,8540,8541,8778,8779,8780,8781,8782,8783,8786,8787,8804,8805,8806,8807,8808,8809,8810,8829) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8496, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8497, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8540, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8541, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8778, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8779, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8780, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8781, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8782, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8783, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8786, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8787, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8804, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8805, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8806, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8807, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8808, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8809, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8810, 'ruRU', "У тебя есть что-то для меня, $N?", 0),
(8829, 'ruRU', "У тебя есть что-то для меня, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24819,24836,24837,24838,24839,24840,24841,24842,24843,24844,24845,24846,24847,25246,25247,25248,25249) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24819, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24836, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24837, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24838, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24839, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24840, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24841, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24842, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24843, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24844, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24845, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24846, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(24847, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(25246, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(25247, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(25248, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0),
(25249, 'ruRU', "Ты хочешь изменить свой путь, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24666,24638,24645,24647,24648,24649,24650,24651,24652,24658,24659,24660,24662,24663,24664,24665) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24666, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24638, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24645, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24647, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24648, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24649, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24650, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24651, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24652, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24658, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24659, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24660, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24662, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24663, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24664, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0),
(24665, 'ruRU', "Ты $Gпреподал:преподала; им урок?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8559,8596,8621,8622,8623,8624,8626,8631,8634,8637,8640,8655,8658,8660,8665) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8559, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8596, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8621, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8622, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8623, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8624, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8626, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8631, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8634, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8637, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8640, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8655, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8658, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8660, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0),
(8665, 'ruRU', "Тебе удалось добыть то, о чем я просил, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13952,14166,14167,14168,14169,14170,14171,14172,14173,14174,14175,14176,14177) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13952, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14166, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14167, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14168, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14169, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14170, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14171, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14172, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14173, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14174, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14175, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14176, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0),
(14177, 'ruRU', "Ты уже $Gпринес:принесла; поминальный хлеб?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9234,9235,9236,9237,9239,9240,9241,9242,9243,9244,9245,9246) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9234, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9235, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9236, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9237, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9239, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9240, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9241, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9242, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9243, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9244, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9245, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0),
(9246, 'ruRU', "Ты $Gпринес:принесла; мне материалы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8368,8389,8426,8427,8428,8429,8430,8431,8432,8433,8434,8435) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8368, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8389, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8426, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8427, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8428, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8429, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8430, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8431, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8432, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8433, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8434, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0),
(8435, 'ruRU', "Сражение в Ущелье Песни Войны против Стражей Среброкрылых имеет огромное значение. Под предлогом защиты леса, который им не принадлежит, Альянс пытается лишить Орду одного из наших крупнейших источников древесины.$B$BНе позволь этому случиться, $N! Возвращайся ко мне с доказательством того, что ты достойно служишь Орде!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13600,13669,13674,13742,13747,13753,13758,13763,13769,13774,13779,13784) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13600, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13669, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13674, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13742, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13747, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13753, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13758, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13763, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13769, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13774, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13779, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0),
(13784, 'ruRU', "Так барды говорят правду? Меч действительно существует?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13603,13666,13673,13741,13746,13752,13757,13762,13768,13773,13778,13783) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13603, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13666, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13673, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13741, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13746, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13752, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13757, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13762, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13768, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13773, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13778, 'ruRU', "Вам удалось вернуть клинок?", 0),
(13783, 'ruRU', "Вам удалось вернуть клинок?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (97,98,995,1265,10887,10957,10959,11085,11304,12133,12155,12327,12671,12971) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(97, 'ruRU', "Да, $N?", 0),
(98, 'ruRU', "Да, $N?", 0),
(995, 'ruRU', "Да, $N?", 0),
(1265, 'ruRU', "Да, $N?", 0),
(10887, 'ruRU', "Да, $N?", 0),
(10957, 'ruRU', "Да, $N?", 0),
(10959, 'ruRU', "Да, $N?", 0),
(11085, 'ruRU', "Да, $N?", 0),
(11304, 'ruRU', "Да, $N?", 0),
(12133, 'ruRU', "Да, $N?", 0),
(12155, 'ruRU', "Да, $N?", 0),
(12327, 'ruRU', "Да, $N?", 0),
(12671, 'ruRU', "Да, $N?", 0),
(12971, 'ruRU', "Да, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7498,7499,7500,7501,7502,7503,7504,7505,7506,7649,7650,7651) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7498, 'ruRU', "Вы ее нашли!", 0),
(7499, 'ruRU', "Вы ее нашли!", 0),
(7500, 'ruRU', "Вы ее нашли!", 0),
(7501, 'ruRU', "Вы ее нашли!", 0),
(7502, 'ruRU', "Вы ее нашли!", 0),
(7503, 'ruRU', "Вы ее нашли!", 0),
(7504, 'ruRU', "Вы ее нашли!", 0),
(7505, 'ruRU', "Вы ее нашли!", 0),
(7506, 'ruRU', "Вы ее нашли!", 0),
(7649, 'ruRU', "Вы ее нашли!", 0),
(7650, 'ruRU', "Вы ее нашли!", 0),
(7651, 'ruRU', "Вы ее нашли!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14079,14081,14082,14083,14084,14085,14086,14087,14088,14089) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14079, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14081, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14082, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14083, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14084, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14085, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14086, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14087, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14088, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0),
(14089, 'ruRU', "О, вы получили мое письмо? Хорошо.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13697,13714,13715,13716,13717,13718,13719,13720,13721,13722) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13697, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13714, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13715, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13716, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13717, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13718, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13719, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13720, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13721, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0),
(13722, 'ruRU', "Ты $Gготов:готова; продемонстрировать свое искусство искателя славы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13847,13851,13852,13854,13855,13856,13857,13858,13859,13860) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13847, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13851, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13852, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13854, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13855, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13856, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13857, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13858, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13859, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0),
(13860, 'ruRU', "Служили вместе с крестоносцами при Дворе Костей?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8544,8594,8602,8625,8628,8630,8641,8659,8664,8669) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8544, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8594, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8602, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8625, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8628, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8630, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8641, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8659, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8664, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0),
(8669, 'ruRU', "Тебе удалось собрать все, что мне нужно?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13665,13745,13750,13756,13761,13767,13772,13777,13782,13787) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13665, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13745, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13750, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13756, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13761, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13767, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13772, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13777, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13782, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0),
(13787, 'ruRU', "Ты уже $Gготов:готова; принять участие в великой битве?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7930,7931,7932,7933,7934,7935,7936,7940,7981,9249) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7930, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7931, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7932, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7933, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7934, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7935, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7936, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7940, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(7981, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0),
(9249, 'ruRU', "Налетай, торопись, выбирай себе приз! У кого есть купоны ярмарки Новолуния – подходите и обменяйте их на диковины волшебного свойства и исключительного качества! Ни орк, ни дворф не уйдет без призов!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8895,9813,12307,13264,13276,13289,13319,13342,13344,13358,13365) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8895, 'ruRU', "Да, $C?", 0),
(9813, 'ruRU', "Да, $C?", 0),
(12307, 'ruRU', "Да, $C?", 0),
(13264, 'ruRU', "Да, $C?", 0),
(13276, 'ruRU', "Да, $C?", 0),
(13289, 'ruRU', "Да, $C?", 0),
(13319, 'ruRU', "Да, $C?", 0),
(13342, 'ruRU', "Да, $C?", 0),
(13344, 'ruRU', "Да, $C?", 0),
(13358, 'ruRU', "Да, $C?", 0),
(13365, 'ruRU', "Да, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8951,8952,8953,8954,8955,8956,8957,8958,8959,10496) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8951, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8952, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8953, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8954, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8955, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8956, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8957, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8958, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(8959, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0),
(10496, 'ruRU', "Ты $Gвернулся:вернулась;, $N. Ты $Gдолжен:должна; рассказать мне все о том, что $Gузнал:узнала;. Но сначала давай договоримся о твоей награде.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7795,7800,7811,7818,7823,7824,7836,10357,10362) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7795, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7800, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7811, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7818, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7823, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7824, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(7836, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(10357, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0),
(10362, 'ruRU', "$N, ты исправно снабжаешь нас тканями. На сей раз у нас случилась новая беда: запасы рунной ткани подошли к концу. Это просто ужасно, мы не знаем, что делать – не осталось ни кусочка, ни ниточки! Мы помним, что раньше могли рассчитывать на тебя, и опять просим о помощи.$B$BЕсли у тебя есть рунная ткань – пожалуйста, пожертвуй ее нам. Нужно всего-то 60 отрезов.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8184,8185,8186,8187,8188,8189,8190,8191,8192) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8184, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8185, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8186, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8187, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8188, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8189, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8190, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8191, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0),
(8192, 'ruRU', "Принеси мне все компоненты и я сделаю для тебя могущественный амулет!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8556,8697,8698,8699,8700,8701,8702,8703,8704) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8556, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8697, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8698, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8699, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8700, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8701, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8702, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8703, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0),
(8704, 'ruRU', "Ты $Gпринес:принесла; мне кольцо и материалы, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8905,8906,8907,8908,8909,8910,8911,8912,10492) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8905, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8906, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8907, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8908, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8909, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8910, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8911, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(8912, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0),
(10492, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просил, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8913,8914,8915,8916,8917,8918,8919,8920,10493) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8913, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8914, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8915, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8916, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8917, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8918, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8919, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(8920, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0),
(10493, 'ruRU', "Ты $Gполучил:получила; нужные мне предметы, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7796,7801,7806,7812,7825,7832,7837,10358,10363) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7796, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7801, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7806, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7812, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7825, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7832, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(7837, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(10358, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0),
(10363, 'ruRU', "Всякий раз, когда ты будешь приносить мне руническую ткань, я приму её.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8446,12146,12638,13318,13323,13352,13353,13354,13414) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8446, 'ruRU', "Да, $R?", 0),
(12146, 'ruRU', "Да, $R?", 0),
(12638, 'ruRU', "Да, $R?", 0),
(13318, 'ruRU', "Да, $R?", 0),
(13323, 'ruRU', "Да, $R?", 0),
(13352, 'ruRU', "Да, $R?", 0),
(13353, 'ruRU', "Да, $R?", 0),
(13354, 'ruRU', "Да, $R?", 0),
(13414, 'ruRU', "Да, $R?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8927,8938,8939,8940,8941,8942,8943,8944,10495) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8927, 'ruRU', "Вы готовы произвести обмен?", 0),
(8938, 'ruRU', "Вы готовы произвести обмен?", 0),
(8939, 'ruRU', "Вы готовы произвести обмен?", 0),
(8940, 'ruRU', "Вы готовы произвести обмен?", 0),
(8941, 'ruRU', "Вы готовы произвести обмен?", 0),
(8942, 'ruRU', "Вы готовы произвести обмен?", 0),
(8943, 'ruRU', "Вы готовы произвести обмен?", 0),
(8944, 'ruRU', "Вы готовы произвести обмен?", 0),
(10495, 'ruRU', "Вы готовы произвести обмен?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8926,8931,8932,8933,8934,8935,8936,8937,10494) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8926, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8931, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8932, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8933, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8934, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8935, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8936, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(8937, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0),
(10494, 'ruRU', "Ну, $Gготов:готова; к обмену?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9221,9222,9223,9224,9225,9226,9227,9228) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9221, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9222, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9223, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9224, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9225, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9226, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9227, 'ruRU', "Выбирай внимательно. Без возврата.", 0),
(9228, 'ruRU', "Выбирай внимательно. Без возврата.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8558,8705,8706,8707,8709,8710,8711,8712) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8558, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8705, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8706, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8707, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8709, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8710, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8711, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0),
(8712, 'ruRU', "Ты $Gпринес:принесла; то, что мне нужно, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8557,8689,8690,8691,8692,8693,8694,8696) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8557, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8689, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8690, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8691, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8692, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8693, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8694, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0),
(8696, 'ruRU', "Ты $Gпринес:принесла; мне материалы для плаща, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8962,8963,8964,8965,8985,8986,8987,8988) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8962, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8963, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8964, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8965, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8985, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8986, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8987, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0),
(8988, 'ruRU', "Ты уже вернулся, $C, с тем, за чем я тебя посылал собрать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13592,13671,13749,13760,13789,13791,13810,13813) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13592, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13671, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13749, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13760, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13789, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13791, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13810, 'ruRU', "Ты испытал себя в бою против Плети?", 0),
(13813, 'ruRU', "Ты испытал себя в бою против Плети?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9086,9087,9088,9089,9090,9091,9092,9093) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9086, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9087, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9088, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9089, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9090, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9091, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9092, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0),
(9093, 'ruRU', "Стоимость материала высока, но вскоре о ней забывают.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24597,24609,24610,24611,24612,24613,24614,24615) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24597, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24609, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24610, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24611, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24612, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24613, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24614, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0),
(24615, 'ruRU', "Приятное знакомство, |3-6($C). У тебя есть что-нибудь для меня?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9324,9325,9326,9330,9331,9332,11933,11935) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9324, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(9325, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(9326, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(9330, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(9331, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(9332, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(11933, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0),
(11935, 'ruRU', "Ты поистине светишься, |3-6($R). Что у тебя там?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8562,8603,8627,8633,8638,8656,8666) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8562, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8603, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8627, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8633, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8638, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8656, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0),
(8666, 'ruRU', "К'Тун, внушающий ужас всему живому, дремлет в глубинах Ан'Киража в ожидании пробуждения.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8561,8592,8632,8639,8657,8662,8667) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8561, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8592, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8632, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8639, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8657, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8662, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0),
(8667, 'ruRU', "Ты $Gпринес:принесла; мне то, о чем я просила, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13670,13675,13764,13770,13775,13780,13785) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13670, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13675, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13764, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13770, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13775, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13780, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13785, 'ruRU', "Ну как? Получилось добыть меч?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13724,13725,13726,13727,13728,13729,13731) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13724, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13725, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13726, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13727, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13728, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13729, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0),
(13731, 'ruRU', "Вы победили чемпиона Серебряного Авангарда?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10750,10751,10768,10772,10773,10774,10775) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10750, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10751, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10768, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10772, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10773, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10774, 'ruRU', "Что тебе сообщить, солдат?", 0),
(10775, 'ruRU', "Что тебе сообщить, солдат?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8502,8539,8687,8770,8771,8772,8773) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8502, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8539, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8687, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8770, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8771, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8772, 'ruRU', "Ты хочешь что-то сказать, $C?", 0),
(8773, 'ruRU', "Ты хочешь что-то сказать, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10021,10241,10246,11096,11072,11885) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10021, 'ruRU', "Вы выполнили свою задачу, $N?", 0),
(10241, 'ruRU', "Вы выполнили свою задачу, $N?", 0),
(10246, 'ruRU', "Вы выполнили свою задачу, $N?", 0),
(11096, 'ruRU', "Вы выполнили свою задачу, $N?", 0),
(11072, 'ruRU', "Вы выполнили свою задачу, $N?", 0),
(11885, 'ruRU', "Вы выполнили свою задачу, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7794,7799,7809,7817,10356,10361) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7794, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0),
(7799, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0),
(7809, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0),
(7817, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0),
(10356, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0),
(10361, 'ruRU', "Если у тебя есть 60 отрезов магической ткани, я могу принять их у тебя в качестве пожертвования.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5102,10588,10720,11938,12143,13161) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5102, 'ruRU', "Это сделано?", 0),
(10588, 'ruRU', "Это сделано?", 0),
(10720, 'ruRU', "Это сделано?", 0),
(11938, 'ruRU', "Это сделано?", 0),
(12143, 'ruRU', "Это сделано?", 0),
(13161, 'ruRU', "Это сделано?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8535,8536,8537,8538,8737,8740) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8535, 'ruRU', "Твоя задача уже выполнена, $N?", 0),
(8536, 'ruRU', "Твоя задача уже выполнена, $N?", 0),
(8537, 'ruRU', "Твоя задача уже выполнена, $N?", 0),
(8538, 'ruRU', "Твоя задача уже выполнена, $N?", 0),
(8737, 'ruRU', "Твоя задача уже выполнена, $N?", 0),
(8740, 'ruRU', "Твоя задача уже выполнена, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11917,11947,11948,11952,11953,11954) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11917, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0),
(11947, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0),
(11948, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0),
(11952, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0),
(11953, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0),
(11954, 'ruRU', "Ты $Gвернулся:вернулась; $Gпобедителем:победительницей;?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9016,9017,9018,9019,9020,9021) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9016, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0),
(9017, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0),
(9018, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0),
(9019, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0),
(9020, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0),
(9021, 'ruRU', "Ты $Gвернулся:вернулась;, и по твоим глазам я вижу, что тебе есть что сказать мне, $N. Позвольте нам в первую очередь позаботиться о вашей награде.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8124,8163,8164,8165,8300) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8124, 'ruRU', "$N, у Осквернителей есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8163, 'ruRU', "$N, у Осквернителей есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8164, 'ruRU', "$N, у Осквернителей есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8165, 'ruRU', "$N, у Осквернителей есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8300, 'ruRU', "$N, у Осквернителей есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8081,8157,8158,8159,8298) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8081, 'ruRU', "$N, у Лиги Аратора есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8157, 'ruRU', "$N, у Лиги Аратора есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8158, 'ruRU', "$N, у Лиги Аратора есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8159, 'ruRU', "$N, у Лиги Аратора есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0),
(8298, 'ruRU', "$N, у Лиги Аратора есть постоянная миссия: вернуться в низину Арати, добыть еще ящики с ресурсами и принести их мне.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10781,10884,10885,10886,10888) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10781, 'ruRU', "<А'дал приветствует вас.>", 0),
(10884, 'ruRU', "<А'дал приветствует вас.>", 0),
(10885, 'ruRU', "<А'дал приветствует вас.>", 0),
(10886, 'ruRU', "<А'дал приветствует вас.>", 0),
(10888, 'ruRU', "<А'дал приветствует вас.>", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13765,13771,13776,13781,13786) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13765, 'ruRU', "Хороший тренировочный день никому не повредит. Рад видеть, что ты не $отставал:отставала;.", 0),
(13771, 'ruRU', "Хороший тренировочный день никому не повредит. Рад видеть, что ты не $отставал:отставала;.", 0),
(13776, 'ruRU', "Хороший тренировочный день никому не повредит. Рад видеть, что ты не $отставал:отставала;.", 0),
(13781, 'ruRU', "Хороший тренировочный день никому не повредит. Рад видеть, что ты не $отставал:отставала;.", 0),
(13786, 'ruRU', "Хороший тренировочный день никому не повредит. Рад видеть, что ты не $отставал:отставала;.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (4982,10522,10970,11495,13832) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(4982, 'ruRU', "Ну, как успехи?", 0),
(10522, 'ruRU', "Ну, как успехи?", 0),
(10970, 'ruRU', "Ну, как успехи?", 0),
(11495, 'ruRU', "Ну, как успехи?", 0),
(13832, 'ruRU', "Ну, как успехи?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7803,7808,7821,7827,7834) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7803, 'ruRU', "Наши запасы тканей подходят к концу, и особенно нам не хватает шелка. Остается надеяться только на щедрость горожан и заезжих героев.$B$BЕсли ты можешь пожертвовать 60 отрезов шелка, я с благодарностью приму твой дар прямо сейчас. И помни: добрые дела приносят добрую славу!", 0),
(7808, 'ruRU', "Наши запасы тканей подходят к концу, и особенно нам не хватает шелка. Остается надеяться только на щедрость горожан и заезжих героев.$B$BЕсли ты можешь пожертвовать 60 отрезов шелка, я с благодарностью приму твой дар прямо сейчас. И помни: добрые дела приносят добрую славу!", 0),
(7821, 'ruRU', "Наши запасы тканей подходят к концу, и особенно нам не хватает шелка. Остается надеяться только на щедрость горожан и заезжих героев.$B$BЕсли ты можешь пожертвовать 60 отрезов шелка, я с благодарностью приму твой дар прямо сейчас. И помни: добрые дела приносят добрую славу!", 0),
(7827, 'ruRU', "Наши запасы тканей подходят к концу, и особенно нам не хватает шелка. Остается надеяться только на щедрость горожан и заезжих героев.$B$BЕсли ты можешь пожертвовать 60 отрезов шелка, я с благодарностью приму твой дар прямо сейчас. И помни: добрые дела приносят добрую славу!", 0),
(7834, 'ruRU', "Наши запасы тканей подходят к концу, и особенно нам не хватает шелка. Остается надеяться только на щедрость горожан и заезжих героев.$B$BЕсли ты можешь пожертвовать 60 отрезов шелка, я с благодарностью приму твой дар прямо сейчас. И помни: добрые дела приносят добрую славу!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8560,8593,8629,8663,8668) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8560, 'ruRU', "Ты $Gпринес:принесла; не обходимые мне компоненты, $N?", 0),
(8593, 'ruRU', "Ты $Gпринес:принесла; не обходимые мне компоненты, $N?", 0),
(8629, 'ruRU', "Ты $Gпринес:принесла; не обходимые мне компоненты, $N?", 0),
(8663, 'ruRU', "Ты $Gпринес:принесла; не обходимые мне компоненты, $N?", 0),
(8668, 'ruRU', "Ты $Gпринес:принесла; не обходимые мне компоненты, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13616,13743,13748,13754,13759) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13616, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13743, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13748, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13754, 'ruRU', "Ну как? Получилось добыть меч?", 0),
(13759, 'ruRU', "Ну как? Получилось добыть меч?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8080,8154,8155,8156,8297) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8080, 'ruRU', "У тебя есть ящик с ресурсами, $N? Без них Лига Аратора не сможет вести достойную битву...", 0),
(8154, 'ruRU', "У тебя есть ящик с ресурсами, $N? Без них Лига Аратора не сможет вести достойную битву...", 0),
(8155, 'ruRU', "У тебя есть ящик с ресурсами, $N? Без них Лига Аратора не сможет вести достойную битву...", 0),
(8156, 'ruRU', "У тебя есть ящик с ресурсами, $N? Без них Лига Аратора не сможет вести достойную битву...", 0),
(8297, 'ruRU', "У тебя есть ящик с ресурсами, $N? Без них Лига Аратора не сможет вести достойную битву...", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5805,5842,5844,5847,9278) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5805, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный купон. Отдай его мне, и я предложу кое-что взамен.", 0),
(5842, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный купон. Отдай его мне, и я предложу кое-что взамен.", 0),
(5844, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный купон. Отдай его мне, и я предложу кое-что взамен.", 0),
(5847, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный купон. Отдай его мне, и я предложу кое-что взамен.", 0),
(9278, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный купон. Отдай его мне, и я предложу кое-что взамен.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7813,7826,7833,10352,10359) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7813, 'ruRU', "Если у тебя при себе имеется 60 отрезов шерсти и ты $Gготов:готова; ее пожертвовать, я могу принять шерсть прямо сейчас.", 0),
(7826, 'ruRU', "Если у тебя при себе имеется 60 отрезов шерсти и ты $Gготов:готова; ее пожертвовать, я могу принять шерсть прямо сейчас.", 0),
(7833, 'ruRU', "Если у тебя при себе имеется 60 отрезов шерсти и ты $Gготов:готова; ее пожертвовать, я могу принять шерсть прямо сейчас.", 0),
(10352, 'ruRU', "Если у тебя при себе имеется 60 отрезов шерсти и ты $Gготов:готова; ее пожертвовать, я могу принять шерсть прямо сейчас.", 0),
(10359, 'ruRU', "Если у тебя при себе имеется 60 отрезов шерсти и ты $Gготов:готова; ее пожертвовать, я могу принять шерсть прямо сейчас.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11336,11337,13427,14178,14179) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11336, 'ruRU', "Скажи мне, $N. Какие новости с фронта?", 0),
(11337, 'ruRU', "Скажи мне, $N. Какие новости с фронта?", 0),
(13427, 'ruRU', "Скажи мне, $N. Какие новости с фронта?", 0),
(14178, 'ruRU', "Скажи мне, $N. Какие новости с фронта?", 0),
(14179, 'ruRU', "Скажи мне, $N. Какие новости с фронта?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7789,7874,7875,7876,8294) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7789, 'ruRU', "Кровь наших врагов - знак чести. У тебя есть такая отметка?", 0),
(7874, 'ruRU', "Кровь наших врагов - знак чести. У тебя есть такая отметка?", 0),
(7875, 'ruRU', "Кровь наших врагов - знак чести. У тебя есть такая отметка?", 0),
(7876, 'ruRU', "Кровь наших врагов - знак чести. У тебя есть такая отметка?", 0),
(8294, 'ruRU', "Кровь наших врагов - знак чести. У тебя есть такая отметка?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10569,10760,11343,11344,12616) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10569, 'ruRU', "Что тебе удалось узнать?", 0),
(10760, 'ruRU', "Что тебе удалось узнать?", 0),
(11343, 'ruRU', "Что тебе удалось узнать?", 0),
(11344, 'ruRU', "Что тебе удалось узнать?", 0),
(12616, 'ruRU', "Что тебе удалось узнать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8501,8774,8775,8776,8777) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8501, 'ruRU', "Ты хочешь что-то сказать, $N?", 0),
(8774, 'ruRU', "Ты хочешь что-то сказать, $N?", 0),
(8775, 'ruRU', "Ты хочешь что-то сказать, $N?", 0),
(8776, 'ruRU', "Ты хочешь что-то сказать, $N?", 0),
(8777, 'ruRU', "Ты хочешь что-то сказать, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7793,7814,10354,10360) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7793, 'ruRU', "Могу ли я добавить, что такой благотворительный подарок, как шелк, несомненно, повысит ваше положение в обществе! Если у вас есть 60 отрезов шелковой ткани и вы готовы пожертвовать их, я могу забрать их у вас прямо сейчас.", 0),
(7814, 'ruRU', "Могу ли я добавить, что такой благотворительный подарок, как шелк, несомненно, повысит ваше положение в обществе! Если у вас есть 60 отрезов шелковой ткани и вы готовы пожертвовать их, я могу забрать их у вас прямо сейчас.", 0),
(10354, 'ruRU', "Могу ли я добавить, что такой благотворительный подарок, как шелк, несомненно, повысит ваше положение в обществе! Если у вас есть 60 отрезов шелковой ткани и вы готовы пожертвовать их, я могу забрать их у вас прямо сейчас.", 0),
(10360, 'ruRU', "Могу ли я добавить, что такой благотворительный подарок, как шелк, несомненно, повысит ваше положение в обществе! Если у вас есть 60 отрезов шелковой ткани и вы готовы пожертвовать их, я могу забрать их у вас прямо сейчас.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9158,10323,10587,10687) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9158, 'ruRU', "Ты $Gвыполнил:выполнила; задание, о котором я тебя просила, $N?", 0),
(10323, 'ruRU', "Ты $Gвыполнил:выполнила; задание, о котором я тебя просила, $N?", 0),
(10587, 'ruRU', "Ты $Gвыполнил:выполнила; задание, о котором я тебя просила, $N?", 0),
(10687, 'ruRU', "Ты $Gвыполнил:выполнила; задание, о котором я тебя просила, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13682,13788,13809,13812) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13682, 'ruRU', "Вы одержали победили отряд сектантов Культа Проклятых?", 0),
(13788, 'ruRU', "Вы одержали победили отряд сектантов Культа Проклятых?", 0),
(13809, 'ruRU', "Вы одержали победили отряд сектантов Культа Проклятых?", 0),
(13812, 'ruRU', "Вы одержали победили отряд сектантов Культа Проклятых?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11538,11913,12220,12453) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11538, 'ruRU', "Ты сделал то, о чем я тебя просил, $N?", 0),
(11913, 'ruRU', "Ты сделал то, о чем я тебя просил, $N?", 0),
(12220, 'ruRU', "Ты сделал то, о чем я тебя просил, $N?", 0),
(12453, 'ruRU', "Ты сделал то, о чем я тебя просил, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13861,13862,13863,13864) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13861, 'ruRU', "Сражались ли вы с врагом при Дворе Костей?", 0),
(13862, 'ruRU', "Сражались ли вы с врагом при Дворе Костей?", 0),
(13863, 'ruRU', "Сражались ли вы с врагом при Дворе Костей?", 0),
(13864, 'ruRU', "Сражались ли вы с врагом при Дворе Костей?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3526,3629,3633,4181) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3526, 'ruRU', "Новичков я чую за версту – лучше, чем самый качественный порох. Ты ведь желаешь приобщиться к великому искусству изготовления взрывчатки?", 0),
(3629, 'ruRU', "Новичков я чую за версту – лучше, чем самый качественный порох. Ты ведь желаешь приобщиться к великому искусству изготовления взрывчатки?", 0),
(3633, 'ruRU', "Новичков я чую за версту – лучше, чем самый качественный порох. Ты ведь желаешь приобщиться к великому искусству изготовления взрывчатки?", 0),
(4181, 'ruRU', "Новичков я чую за версту – лучше, чем самый качественный порох. Ты ведь желаешь приобщиться к великому искусству изготовления взрывчатки?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3644,3645,3646,3647) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3644, 'ruRU', "Чтобы продлить членский билет, тебе придется заплатить пошлину в размере двух золотых.", 0),
(3645, 'ruRU', "Чтобы продлить членский билет, тебе придется заплатить пошлину в размере двух золотых.", 0),
(3646, 'ruRU', "Чтобы продлить членский билет, тебе придется заплатить пошлину в размере двух золотых.", 0),
(3647, 'ruRU', "Чтобы продлить членский билет, тебе придется заплатить пошлину в размере двух золотых.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10474,10475,10473,10472) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10474, 'ruRU', "Пусть время всегда работает на тебя, $N.", 0),
(10475, 'ruRU', "Пусть время всегда работает на тебя, $N.", 0),
(10473, 'ruRU', "Пусть время всегда работает на тебя, $N.", 0),
(10472, 'ruRU', "Пусть время всегда работает на тебя, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13265,13269,13270,13272) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13265, 'ruRU', "Многие северяне-гуманоиды носят одежду, которая легко может быть обращена в материал, если знать пару хитростей.$B$BЗа сущие копейки я могу научить тебя, как распарывать их одежду так, чтобы нарезать немного дополнительной ткани.", 0),
(13269, 'ruRU', "Многие северяне-гуманоиды носят одежду, которая легко может быть обращена в материал, если знать пару хитростей.$B$BЗа сущие копейки я могу научить тебя, как распарывать их одежду так, чтобы нарезать немного дополнительной ткани.", 0),
(13270, 'ruRU', "Многие северяне-гуманоиды носят одежду, которая легко может быть обращена в материал, если знать пару хитростей.$B$BЗа сущие копейки я могу научить тебя, как распарывать их одежду так, чтобы нарезать немного дополнительной ткани.", 0),
(13272, 'ruRU', "Многие северяне-гуманоиды носят одежду, которая легко может быть обращена в материал, если знать пару хитростей.$B$BЗа сущие копейки я могу научить тебя, как распарывать их одежду так, чтобы нарезать немного дополнительной ткани.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11103,11104,11105,11106) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11103, 'ruRU', "Сила, заключенная в твоем кольце, гибка и податлива, но ты $Gсделал:сделал; выбор, и отменить этот выбор непросто. Ты действительно собираешься отказаться от избранного пути?", 0),
(11104, 'ruRU', "Сила, заключенная в твоем кольце, гибка и податлива, но ты $Gсделал:сделал; выбор, и отменить этот выбор непросто. Ты действительно собираешься отказаться от избранного пути?", 0),
(11105, 'ruRU', "Сила, заключенная в твоем кольце, гибка и податлива, но ты $Gсделал:сделал; выбор, и отменить этот выбор непросто. Ты действительно собираешься отказаться от избранного пути?", 0),
(11106, 'ruRU', "Сила, заключенная в твоем кольце, гибка и податлива, но ты $Gсделал:сделал; выбор, и отменить этот выбор непросто. Ты действительно собираешься отказаться от избранного пути?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2973,8611,8613,8615) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2973, 'ruRU', "Летучие хамелеоны могут быть очень опасны, когда на них нападают. Так что смотри в оба, |3-6($R)! Тем более, опасаться приходится не только дракончиков, но и тамошних ночных эльфов.$B$BКогда наберешь нужное количество крыльев, дай мне знать, уж я в долгу не останусь!", 0),
(8611, 'ruRU', "Летучие хамелеоны могут быть очень опасны, когда на них нападают. Так что смотри в оба, |3-6($R)! Тем более, опасаться приходится не только дракончиков, но и тамошних ночных эльфов.$B$BКогда наберешь нужное количество крыльев, дай мне знать, уж я в долгу не останусь!", 0),
(8613, 'ruRU', "Летучие хамелеоны могут быть очень опасны, когда на них нападают. Так что смотри в оба, |3-6($R)! Тем более, опасаться приходится не только дракончиков, но и тамошних ночных эльфов.$B$BКогда наберешь нужное количество крыльев, дай мне знать, уж я в долгу не останусь!", 0),
(8615, 'ruRU', "Летучие хамелеоны могут быть очень опасны, когда на них нападают. Так что смотри в оба, |3-6($R)! Тем более, опасаться приходится не только дракончиков, но и тамошних ночных эльфов.$B$BКогда наберешь нужное количество крыльев, дай мне знать, уж я в долгу не останусь!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10182,10305,10306,10307) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10182, 'ruRU', "Что это за находка, $N?", 0),
(10305, 'ruRU', "Что это за находка, $N?", 0),
(10306, 'ruRU', "Что это за находка, $N?", 0),
(10307, 'ruRU', "Что это за находка, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11321,11413,13932,13931) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11321, 'ruRU', "Что происходит? Есть что-нибудь для меня?", 0),
(11413, 'ruRU', "Что происходит? Есть что-нибудь для меня?", 0),
(13932, 'ruRU', "Что происходит? Есть что-нибудь для меня?", 0),
(13931, 'ruRU', "Что происходит? Есть что-нибудь для меня?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2583,2584,2585,2586) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2583, 'ruRU', "Так где органы, $N!?", 0),
(2584, 'ruRU', "Так где органы, $N!?", 0),
(2585, 'ruRU', "Так где органы, $N!?", 0),
(2586, 'ruRU', "Так где органы, $N!?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10283,12855,24849,24851) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10283, 'ruRU', "Кто ты?", 0),
(12855, 'ruRU', "Кто ты?", 0),
(24849, 'ruRU', "Кто ты?", 0),
(24851, 'ruRU', "Кто ты?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (219,567,3121,12847) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(219, 'ruRU', "Да?", 0),
(567, 'ruRU', "Да?", 0),
(3121, 'ruRU', "Да?", 0),
(12847, 'ruRU', "Да?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10467,10466,10465,10464) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10467, 'ruRU', "Ты по-прежнему служишь нам верой и правдой, $N.", 0),
(10466, 'ruRU', "Ты по-прежнему служишь нам верой и правдой, $N.", 0),
(10465, 'ruRU', "Ты по-прежнему служишь нам верой и правдой, $N.", 0),
(10464, 'ruRU', "Ты по-прежнему служишь нам верой и правдой, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11031,11032,11033,11034) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11031, 'ruRU', "Ты $Gрешил:решила; отказаться от своего предыдущего выбора?$B$BЯ полагаю, что могу помочь вам обратить его вспять. В конце концов, Даларан больше заботится о твоей преданности, чем о том, как ты ее проявляешь.$B$BЭто будет недешево. И конечно, мне нужно будет вернуть твое старое кольцо.", 0),
(11032, 'ruRU', "Ты $Gрешил:решила; отказаться от своего предыдущего выбора?$B$BЯ полагаю, что могу помочь вам обратить его вспять. В конце концов, Даларан больше заботится о твоей преданности, чем о том, как ты ее проявляешь.$B$BЭто будет недешево. И конечно, мне нужно будет вернуть твое старое кольцо.", 0),
(11033, 'ruRU', "Ты $Gрешил:решила; отказаться от своего предыдущего выбора?$B$BЯ полагаю, что могу помочь вам обратить его вспять. В конце концов, Даларан больше заботится о твоей преданности, чем о том, как ты ее проявляешь.$B$BЭто будет недешево. И конечно, мне нужно будет вернуть твое старое кольцо.", 0),
(11034, 'ruRU', "Ты $Gрешил:решила; отказаться от своего предыдущего выбора?$B$BЯ полагаю, что могу помочь вам обратить его вспять. В конце концов, Даларан больше заботится о твоей преданности, чем о том, как ты ее проявляешь.$B$BЭто будет недешево. И конечно, мне нужно будет вернуть твое старое кольцо.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (910,911,1800) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(910, 'ruRU', "Мы уже на месте?", 0),
(911, 'ruRU', "Мы уже на месте?", 0),
(1800, 'ruRU', "Мы уже на месте?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9001,9014,10499) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9001, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части магистра в обмен на новую Корону и Одеяния волшебника?", 0),
(9014, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части магистра в обмен на новую Корону и Одеяния волшебника?", 0),
(10499, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части магистра в обмен на новую Корону и Одеяния волшебника?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8999,9007,10498) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8999, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Дикого Сердца в обмен на новый Клобук и Жилет Буйного Сердца?", 0),
(9007, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Дикого Сердца в обмен на новый Клобук и Жилет Буйного Сердца?", 0),
(10498, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Дикого Сердца в обмен на новый Клобук и Жилет Буйного Сердца?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8764,8765,8766) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8764, 'ruRU', "Чемпион, Если ты решишь пойти другим путем, Подари мне свой перстень с печаткой и гору скарабеев от наших врагов в Ан'Кираж.", 0),
(8765, 'ruRU', "Чемпион, Если ты решишь пойти другим путем, Подари мне свой перстень с печаткой и гору скарабеев от наших врагов в Ан'Кираж.", 0),
(8766, 'ruRU', "Чемпион, Если ты решишь пойти другим путем, Подари мне свой перстень с печаткой и гору скарабеев от наших врагов в Ан'Кираж.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8750, 8755, 8760) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8750, 'ruRU', "Посвящение такого масштаба является редкостью. Ты $Gпоказал:показала;, что твоя воля не изменилась, $N. Вы будете очень вознаграждены за ваши стойкие часы над нашим миром.$B$BДай мне свое перстень с печаткой, чтобы я мог усилить его чары.", 0),
(8755, 'ruRU', "Посвящение такого масштаба является редкостью. Ты $Gпоказал:показала;, что твоя воля не изменилась, $N. Вы будете очень вознаграждены за ваши стойкие часы над нашим миром.$B$BДай мне свое перстень с печаткой, чтобы я мог усилить его чары.", 0),
(8760, 'ruRU', "Посвящение такого масштаба является редкостью. Ты $Gпоказал:показала;, что твоя воля не изменилась, $N. Вы будете очень вознаграждены за ваши стойкие часы над нашим миром.$B$BДай мне свое перстень с печаткой, чтобы я мог усилить его чары.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9208,9209,9210) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9208, 'ruRU', "У тебя есть аркан?", 0),
(9209, 'ruRU', "У тебя есть аркан?", 0),
(9210, 'ruRU', "У тебя есть аркан?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9528,12019,13349) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9528, 'ruRU', "Привет, $N.", 0),
(12019, 'ruRU', "Привет, $N.", 0),
(13349, 'ruRU', "Привет, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9114,9115,9116) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9114, 'ruRU', "Ты $Gпринес:принесла; мне реагенты, дитя?", 0),
(9115, 'ruRU', "Ты $Gпринес:принесла; мне реагенты, дитя?", 0),
(9116, 'ruRU', "Ты $Gпринес:принесла; мне реагенты, дитя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10321,10322,12413) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10321, 'ruRU', "Удалось ли тебе выполнить задачу, $N?", 0),
(10322, 'ruRU', "Удалось ли тебе выполнить задачу, $N?", 0),
(12413, 'ruRU', "Удалось ли тебе выполнить задачу, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13793,13811,13814) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13793, 'ruRU', "Ты $Gзакончил:закончила; тренироваться вместе с другими чемпионами?", 0),
(13811, 'ruRU', "Ты $Gзакончил:закончила; тренироваться вместе с другими чемпионами?", 0),
(13814, 'ruRU', "Ты $Gзакончил:закончила; тренироваться вместе с другими чемпионами?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (4285,4287,4288) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(4285, 'ruRU', "Ты $Gбыл:была; у пилона, $N?", 0),
(4287, 'ruRU', "Ты $Gбыл:была; у пилона, $N?", 0),
(4288, 'ruRU', "Ты $Gбыл:была; у пилона, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8897,8898,8899) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8897, 'ruRU', "Привет, $Gкрасавчик:красотка;. Я могу тебе чем-нибудь помочь?", 0),
(8898, 'ruRU', "Привет, $Gкрасавчик:красотка;. Я могу тебе чем-нибудь помочь?", 0),
(8899, 'ruRU', "Привет, $Gкрасавчик:красотка;. Я могу тебе чем-нибудь помочь?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9082,9083,9084) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9082, 'ruRU', "Как ты думаешь, что я сделаю без нужных предметов?", 0),
(9083, 'ruRU', "Как ты думаешь, что я сделаю без нужных предметов?", 0),
(9084, 'ruRU', "Как ты думаешь, что я сделаю без нужных предметов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8195,8238,8239) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8195, 'ruRU', "Я ищу Знаки Силы, известные как Монеты Племен. Это валюта, используемая различными обитателями Зул'Гуруба, и каждый из них наделен тонким, но могущественным моджо.$B$BМожно найти девять различных видов. Если у тебя есть лишние, я обменяю один из наших жетонов чести на набор из трех. Вы можете использовать Жетоны с Торговцем Рин'вошо; он предлагает нашим героям специальные предметы за них.", 0),
(8238, 'ruRU', "Я ищу Знаки Силы, известные как Монеты Племен. Это валюта, используемая различными обитателями Зул'Гуруба, и каждый из них наделен тонким, но могущественным моджо.$B$BМожно найти девять различных видов. Если у тебя есть лишние, я обменяю один из наших жетонов чести на набор из трех. Вы можете использовать Жетоны с Торговцем Рин'вошо; он предлагает нашим героям специальные предметы за них.", 0),
(8239, 'ruRU', "Я ищу Знаки Силы, известные как Монеты Племен. Это валюта, используемая различными обитателями Зул'Гуруба, и каждый из них наделен тонким, но могущественным моджо.$B$BМожно найти девять различных видов. Если у тебя есть лишние, я обменяю один из наших жетонов чести на набор из трех. Вы можете использовать Жетоны с Торговцем Рин'вошо; он предлагает нашим героям специальные предметы за них.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8548,8573,8574) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8548, 'ruRU', "В наших интересах держать наших самых верных союзников в хорошей форме, $N.", 0),
(8573, 'ruRU', "В наших интересах держать наших самых верных союзников в хорошей форме, $N.", 0),
(8574, 'ruRU', "В наших интересах держать наших самых верных союзников в хорошей форме, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8751,8756,8761) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8751, 'ruRU', "Никогда прежде мне не случалось видеть такой стойкости! Бронзовые драконы даруют тебе свои последние чары. Этого потребовал сам Вневременный!$B$BДай мне свой перстень, и я наложу на него еще одно заклятье.", 0),
(8756, 'ruRU', "Никогда прежде мне не случалось видеть такой стойкости! Бронзовые драконы даруют тебе свои последние чары. Этого потребовал сам Вневременный!$B$BДай мне свой перстень, и я наложу на него еще одно заклятье.", 0),
(8761, 'ruRU', "Никогда прежде мне не случалось видеть такой стойкости! Бронзовые драконы даруют тебе свои последние чары. Этого потребовал сам Вневременный!$B$BДай мне свой перстень, и я наложу на него еще одно заклятье.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9121,9122,9123) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9121, 'ruRU', "Ещё никому не удалось выйти живым из Наксрамаса, чтобы рассказать эту историю.", 0),
(9122, 'ruRU', "Ещё никому не удалось выйти живым из Наксрамаса, чтобы рассказать эту историю.", 0),
(9123, 'ruRU', "Ещё никому не удалось выйти живым из Наксрамаса, чтобы рассказать эту историю.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8900,8901,8902) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8900, 'ruRU', "О, и чему я обязана такой радостью?", 0),
(8901, 'ruRU', "О, и чему я обязана такой радостью?", 0),
(8902, 'ruRU', "О, и чему я обязана такой радостью?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11921,11922,11926) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11921, 'ruRU', "Быстро! Нет времени чтобы терять его зря!", 0),
(11922, 'ruRU', "Быстро! Нет времени чтобы терять его зря!", 0),
(11926, 'ruRU', "Быстро! Нет времени чтобы терять его зря!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5517,5521,5524) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5517, 'ruRU', "Приветствую, $Gмогучий:могучая; $C! Вы принесли знаки доблести, о которых я просил? Как только вы передадите их мне, я дам вам вашу собственную Многоцветную драгоценность рассвета.", 0),
(5521, 'ruRU', "Приветствую, $Gмогучий:могучая; $C! Вы принесли знаки доблести, о которых я просил? Как только вы передадите их мне, я дам вам вашу собственную Многоцветную драгоценность рассвета.", 0),
(5524, 'ruRU', "Приветствую, $Gмогучий:могучая; $C! Вы принесли знаки доблести, о которых я просил? Как только вы передадите их мне, я дам вам вашу собственную Многоцветную драгоценность рассвета.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8280,8542,8604) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8280, 'ruRU', "Ударные земснаряды представляют собой серьезную угрозу, и с ними нужно быстро бороться!", 0),
(8542, 'ruRU', "Ударные земснаряды представляют собой серьезную угрозу, и с ними нужно быстро бороться!", 0),
(8604, 'ruRU', "Ударные земснаряды представляют собой серьезную угрозу, и с ними нужно быстро бороться!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13889,13903,13917) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13889, 'ruRU', "Детеныш поднимает голову и смотрит на вас.", 0),
(13903, 'ruRU', "Детеныш поднимает голову и смотрит на вас.", 0),
(13917, 'ruRU', "Детеныш поднимает голову и смотрит на вас.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2953,4603,4604) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2953, 'ruRU', "Приемник Чистера 5200 пуст. Чтобы машина заработала, требуется загрязненный предмет и три серебряные монетки.", 0),
(4603, 'ruRU', "Приемник Чистера 5200 пуст. Чтобы машина заработала, требуется загрязненный предмет и три серебряные монетки.", 0),
(4604, 'ruRU', "Приемник Чистера 5200 пуст. Чтобы машина заработала, требуется загрязненный предмет и три серебряные монетки.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5063,5067,5068) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5063, 'ruRU', "Если у тебя нет всего, что мне нужно, ты зря тратишь мое время.", 0),
(5067, 'ruRU', "Если у тебя нет всего, что мне нужно, ты зря тратишь мое время.", 0),
(5068, 'ruRU', "Если у тебя нет всего, что мне нужно, ты зря тратишь мое время.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13346,13350,13368) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13346, 'ruRU', "Ну что, друг? $GБыл:Была; ли ты $Gуспешен:успешна; против Алумета?", 0),
(13350, 'ruRU', "Ну что, друг? $GБыл:Была; ли ты $Gуспешен:успешна; против Алумета?", 0),
(13368, 'ruRU', "Ну что, друг? $GБыл:Была; ли ты $Gуспешен:успешна; против Алумета?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13177,13179,13180) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13177, 'ruRU', "Ну что, ты $Gсправился:справилась; с поручением?", 0),
(13179, 'ruRU', "Ну что, ты $Gсправился:справилась; с поручением?", 0),
(13180, 'ruRU', "Ну что, ты $Gсправился:справилась; с поручением?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10563,10596,13663) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10563, 'ruRU', "Что тебе удалось узнать?", 0),
(10596, 'ruRU', "Что тебе удалось узнать?", 0),
(13663, 'ruRU', "Что тебе удалось узнать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10621,10623,11632) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10621, 'ruRU', "Что это у тебя?", 0),
(10623, 'ruRU', "Что это у тебя?", 0),
(11632, 'ruRU', "Что это у тебя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11986,11998,12507) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11986, 'ruRU', "Что ты мне $Gпринес:принесла;?", 0),
(11998, 'ruRU', "Что ты мне $Gпринес:принесла;?", 0),
(12507, 'ruRU', "Что ты мне $Gпринес:принесла;?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3630,3632,3634) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3630, 'ruRU', "Да-да, чем я могу сегодня тебе помочь? Конечно же, я могу отвлечься на это, ведь я целый день стою здесь, пока наш любимый город лежит в обломках, заполненный радикоактивными газами.", 0),
(3632, 'ruRU', "Да-да, чем я могу сегодня тебе помочь? Конечно же, я могу отвлечься на это, ведь я целый день стою здесь, пока наш любимый город лежит в обломках, заполненный радикоактивными газами.", 0),
(3634, 'ruRU', "Да-да, чем я могу сегодня тебе помочь? Конечно же, я могу отвлечься на это, ведь я целый день стою здесь, пока наш любимый город лежит в обломках, заполненный радикоактивными газами.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8749,8754,8759) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8749, 'ruRU', "Ты чтишь мой род, $N. Убей врагов Калимдора! Покажите им, что значит уничтожить землю вечного звездного света.$B$BВы заработали еще одно улучшение. Дай мне свое перстень, чтобы я мог усилить его силу.", 0),
(8754, 'ruRU', "Ты чтишь мой род, $N. Убей врагов Калимдора! Покажите им, что значит уничтожить землю вечного звездного света.$B$BВы заработали еще одно улучшение. Дай мне свое перстень, чтобы я мог усилить его силу.", 0),
(8759, 'ruRU', "Ты чтишь мой род, $N. Убей врагов Калимдора! Покажите им, что значит уничтожить землю вечного звездного света.$B$BВы заработали еще одно улучшение. Дай мне свое перстень, чтобы я мог усилить его силу.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11341,11342,14181) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11341, 'ruRU', "Ты уже $Gвернулся:вернулась;. Ты несешь весть о победе?", 0),
(11342, 'ruRU', "Ты уже $Gвернулся:вернулась;. Ты несешь весть о победе?", 0),
(14181, 'ruRU', "Ты уже $Gвернулся:вернулась;. Ты несешь весть о победе?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13428,14182,14183) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13428, 'ruRU', "Ты $Gвернулся:вернулась;! Ты $Gпринес:принесла; весть о победе?", 0),
(14182, 'ruRU', "Ты $Gвернулся:вернулась;! Ты $Gпринес:принесла; весть о победе?", 0),
(14183, 'ruRU', "Ты $Gвернулся:вернулась;! Ты $Gпринес:принесла; весть о победе?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10707,12675,12797) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10707, 'ruRU', "Ты $Gвернулся:вернулась;, $N.", 0),
(12675, 'ruRU', "Ты $Gвернулся:вернулась;, $N.", 0),
(12797, 'ruRU', "Ты $Gвернулся:вернулась;, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10470,10469,10468) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10470, 'ruRU', "Ты $Gвернулся:вернулась;. Тебе есть о чем рассказать?", 0),
(10469, 'ruRU', "Ты $Gвернулся:вернулась;. Тебе есть о чем рассказать?", 0),
(10468, 'ruRU', "Ты $Gвернулся:вернулась;. Тебе есть о чем рассказать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8748,8753,8758) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8748, 'ruRU', "Мы не забудем, как ты $Gзащищал:защищала; детей Калимдора. Дай мне свой перстень-печатку, и я наложу на него более сложные чары.", 0),
(8753, 'ruRU', "Мы не забудем, как ты $Gзащищал:защищала; детей Калимдора. Дай мне свой перстень-печатку, и я наложу на него более сложные чары.", 0),
(8758, 'ruRU', "Мы не забудем, как ты $Gзащищал:защищала; детей Калимдора. Дай мне свой перстень-печатку, и я наложу на него более сложные чары.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11131,12135) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11131, 'ruRU', "$N, ты $Gобещал:обещала; спасти детей!", 0),
(12135, 'ruRU', "$N, ты $Gобещал:обещала; спасти детей!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (4022,4023) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(4022, 'ruRU', "<Глаза Цируса вспыхивают, как две пылающих сферы.>", 0),
(4023, 'ruRU', "<Глаза Цируса вспыхивают, как две пылающих сферы.>", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5504,5507) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5504, 'ruRU', "А, $Gблагородный:благородная; $C! Ты $Gпринес:принесла; мне знаки доблести? Как только ты передашь мне все десять, я предложу на выбор наши оплечья.", 0),
(5507, 'ruRU', "А, $Gблагородный:благородная; $C! Ты $Gпринес:принесла; мне знаки доблести? Как только ты передашь мне все десять, я предложу на выбор наши оплечья.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5229,5233) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5229, 'ruRU', "Панель доступа к котлу остается надежно закрытой. Чтобы открыть его, вам нужно будет найти ключ.", 0),
(5233, 'ruRU', "Панель доступа к котлу остается надежно закрытой. Чтобы открыть его, вам нужно будет найти ключ.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5231,5235) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5231, 'ruRU', "Панель доступа к котлу по-прежнему надежно закреплена. Без ключа ее не открыть.", 0),
(5235, 'ruRU', "Панель доступа к котлу по-прежнему надежно закреплена. Без ключа ее не открыть.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (109,6185) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(109, 'ruRU', "Ну... Как дела?", 0),
(6185, 'ruRU', "Ну... Как дела?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10571,10684) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10571, 'ruRU', "Как успехи, $N? Время сейчас играет против нас.", 0),
(10684, 'ruRU', "Как успехи, $N? Время сейчас играет против нас.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13277,13294) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13277, 'ruRU', "Ну что, |3-6($R), удалось ли тебе одолеть великанов?", 0),
(13294, 'ruRU', "Ну что, |3-6($R), удалось ли тебе одолеть великанов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8388,13476) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8388, 'ruRU', "Арати до сих пор пропитан кровью великих воинов, и по Альтераку до сих пор слышен звон стали. Не тратьте мое время зря, если не несете новости с фронта!", 0),
(13476, 'ruRU', "Арати до сих пор пропитан кровью великих воинов, и по Альтераку до сих пор слышен звон стали. Не тратьте мое время зря, если не несете новости с фронта!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13305,13394) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13305, 'ruRU', "Ты $Gзакончил:закончила; играть боевыми машинами?", 0),
(13394, 'ruRU', "Ты $Gзакончил:закончила; играть боевыми машинами?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9000,9008) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9000, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части загонщика в обмен на новую Шапку и Мундир Повелителя Зверей?", 0),
(9008, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части загонщика в обмен на новую Шапку и Мундир Повелителя Зверей?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9003,9009) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9003, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Благочестия в обмен на новую Корону и Одеяние добродетели?", 0),
(9009, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Благочестия в обмен на новую Корону и Одеяние добродетели?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9005,9012) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9005, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Багрового Тумана в обмен на новую Маску и Одеяние Тумана смерти?", 0),
(9012, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Багрового Тумана в обмен на новую Маску и Одеяние Тумана смерти?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9004,9010) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9004, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части незаметности в обмен на новую Шапку и Мундир Покрова Тьмы?", 0),
(9010, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части незаметности в обмен на новую Шапку и Мундир Покрова Тьмы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9006,9013) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9006, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Доблести в обмен на новую Кирасу и Шлем Героизма?", 0),
(9013, 'ruRU', "В соответствии с нашей сделкой, готовы ли вы отдать свои части Доблести в обмен на новую Кирасу и Шлем Героизма?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13193,13199) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13193, 'ruRU', "Я не ждал тебя так рано. Ох, а я-то надеялся хоть немного отдохнуть.", 0),
(13199, 'ruRU', "Я не ждал тебя так рано. Ох, а я-то надеялся хоть немного отдохнуть.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24656,24541) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24656, 'ruRU', "Они бросили тебе ящик, чтобы доставить?", 0),
(24541, 'ruRU', "Они бросили тебе ящик, чтобы доставить?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13609,13822) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13609, 'ruRU', "Ну что, $N, где печать?", 0),
(13822, 'ruRU', "Ну что, $N, где печать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13192,13202) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13192, 'ruRU', "Ты $Gпринес:принесла; доспехи?", 0),
(13202, 'ruRU', "Ты $Gпринес:принесла; доспехи?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10626,10627) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10626, 'ruRU', "Ну что, удалось тебе добыть это оружие?", 0),
(10627, 'ruRU', "Ну что, удалось тебе добыть это оружие?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12858,12926) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12858, 'ruRU', "Ты $Gсобрал:собрала>;диск?", 0),
(12926, 'ruRU', "Ты $Gсобрал:собрала>;диск?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24657,24576) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24657, 'ruRU', "Ты $Gнашел:нашла; этого парня – или он от тебя улизнул?", 0),
(24576, 'ruRU', "Ты $Gнашел:нашла; этого парня – или он от тебя улизнул?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14096,14142) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14096, 'ruRU', "Ты освободил Кула и тех безнадежных претендентов?", 0),
(14142, 'ruRU', "Ты освободил Кула и тех безнадежных претендентов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (618,8554) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(618, 'ruRU', "Ты $Gзаполучил:заполучила; мою саблю, $N?", 0),
(8554, 'ruRU', "Ты $Gзаполучил:заполучила; мою саблю, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10606,10611) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10606, 'ruRU', "$GДобыл:Добыла; руководство?", 0),
(10611, 'ruRU', "$GДобыл:Добыла; руководство?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13359,13398) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13359, 'ruRU', "Где пыль, $N?", 0),
(13398, 'ruRU', "Где пыль, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12183,12201) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12183, 'ruRU', "Ты $Gпринес:принесла; униформу?", 0),
(12201, 'ruRU', "Ты $Gпринес:принесла; униформу?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2937,8609) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2937, 'ruRU', "Достали яд?", 0),
(8609, 'ruRU', "Достали яд?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12184,12202) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12184, 'ruRU', "Ты $Gпринес:принесла; снимки?", 0),
(12202, 'ruRU', "Ты $Gпринес:принесла; снимки?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13236,13395) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13236, 'ruRU', "Ты $Gвидел:видела;, $N?", 0),
(13395, 'ruRU', "Ты $Gвидел:видела;, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13361,13400) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13361, 'ruRU', "Ты $Gвидел:видела;, $N?", 0),
(13400, 'ruRU', "Ты $Gвидел:видела;, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13828,13829) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13828, 'ruRU', "Вы разговаривали с Джераном Локвудом и практиковались в рукопашном бою?", 0),
(13829, 'ruRU', "Вы разговаривали с Джераном Локвудом и практиковались в рукопашном бою?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24745,14483) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24745, 'ruRU', "Ты позаботился об этих коварных злодеях?", 0),
(14483, 'ruRU', "Ты позаботился об этих коварных злодеях?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12860,12927) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12860, 'ruRU', "Ну, что там с диском? Тебе удалось считать информацию?", 0),
(12927, 'ruRU', "Ну, что там с диском? Тебе удалось считать информацию?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8234,10524) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8234, 'ruRU', "Мы знакомы?", 0),
(10524, 'ruRU', "Мы знакомы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2603,2604) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2603, 'ruRU', "Не трать зря мое время, $N. Нам нечего обсуждать, пока ты не принесешь то, что мне требуется.", 0),
(2604, 'ruRU', "Не трать зря мое время, $N. Нам нечего обсуждать, пока ты не принесешь то, что мне требуется.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12306,12421) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12306, 'ruRU', "Ты $Gзаполнил:заполнила; членскую карточку?", 0),
(12421, 'ruRU', "Ты $Gзаполнил:заполнила; членскую карточку?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10326,10654) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10326, 'ruRU', "Вы принесли еще перстней наших врагов, |3-6($C)? Пылающий Легион все еще угрожает нам, и мы преследуем его повсеместно.", 0),
(10654, 'ruRU', "Вы принесли еще перстней наших врагов, |3-6($C)? Пылающий Легион все еще угрожает нам, и мы преследуем его повсеместно.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8419,8420) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8419, 'ruRU', "Ты $Gпринес:принесла; мне ткань Скверны?", 0),
(8420, 'ruRU', "Ты $Gпринес:принесла; мне ткань Скверны?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13479,13480) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13479, 'ruRU', "Где же скорлупа?", 0),
(13480, 'ruRU', "Где же скорлупа?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13502,13503) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13502, 'ruRU', "Ты $Gпринес:принесла; десять шоколадных яиц?", 0),
(13503, 'ruRU', "Ты $Gпринес:принесла; десять шоколадных яиц?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14055,14058) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14055, 'ruRU', "Засахаренный батат у тебя?", 0),
(14058, 'ruRU', "Засахаренный батат у тебя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13672,13678) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13672, 'ruRU', "Ты хочешь пройти испытание претендентов?", 0),
(13678, 'ruRU', "Ты хочешь пройти испытание претендентов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10659,10822) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10659, 'ruRU', "Даже самая маленькая помощь нашему делу не останется незамеченной, $N. Армия врага велика, но победа будет за нами!", 0),
(10822, 'ruRU', "Даже самая маленькая помощь нашему делу не останется незамеченной, $N. Армия врага велика, но победа будет за нами!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11002,11003) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11002, 'ruRU', "Наконец-то здесь стало тихо – впервые на моей памяти!", 0),
(11003, 'ruRU', "Наконец-то здесь стало тихо – впервые на моей памяти!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8817,8842) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8817, 'ruRU', "Один рекомендательный жетон позволяет немного улучшить отношение жителей Подгорода к сдавшему его искателю приключений.$B$BИмей в виду, что лучше сдавать разом десять жетонов, это гораздо выгоднее. У тех же, кто заработал не так много жетонов, мы принимаем их по одному.$B$BНу вот, я тебя предупредил, а теперь готов помочь, если ты все же хочешь сдать мне один жетон.", 0),
(8842, 'ruRU', "Один рекомендательный жетон позволяет немного улучшить отношение жителей Подгорода к сдавшему его искателю приключений.$B$BИмей в виду, что лучше сдавать разом десять жетонов, это гораздо выгоднее. У тех же, кто заработал не так много жетонов, мы принимаем их по одному.$B$BНу вот, я тебя предупредил, а теперь готов помочь, если ты все же хочешь сдать мне один жетон.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13606,13821) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13606, 'ruRU', "Ты $Gдобыл:добыла; печать Фрейи, $N?", 0),
(13821, 'ruRU', "Ты $Gдобыл:добыла; печать Фрейи, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12794,12796) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12794, 'ruRU', "Приветствую, |3-6($C).", 0),
(12796, 'ruRU', "Приветствую, |3-6($C).", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13281,13297) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13281, 'ruRU', "Приветствую, $C.", 0),
(13297, 'ruRU', "Приветствую, $C.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2853,2860) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2853, 'ruRU', "Приветствую, $R... Судя по твоему внешнему виду, ты – кожевник, как и я. Ты $Gпришел:пришла; чтобы учиться, или у тебя ко мне другое дело?", 0),
(2860, 'ruRU', "Приветствую, $R... Судя по твоему внешнему виду, ты – кожевник, как и я. Ты $Gпришел:пришла; чтобы учиться, или у тебя ко мне другое дело?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10816,10817) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10816, 'ruRU', "Привет, $N. Какие новости?", 0),
(10817, 'ruRU', "Привет, $N. Какие новости?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5893,6982) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5893, 'ruRU', "Ты $Gвернулся:вернулась; с рудника Ледяного Зуба? А где припасы?", 0),
(6982, 'ruRU', "Ты $Gвернулся:вернулась; с рудника Ледяного Зуба? А где припасы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9073,9075) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9073, 'ruRU', "Ты $Gпринес:принесла; мне то, что мне нужно?", 0),
(9075, 'ruRU', "Ты $Gпринес:принесла; мне то, что мне нужно?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12241,12248) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12241, 'ruRU', "Ты $Gпринес:принесла мне пепел, $N?", 0),
(12248, 'ruRU', "Ты $Gпринес:принесла мне пепел, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10582,10600) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10582, 'ruRU', "Вы уже проложили путь в Кузницу Смерти?", 0),
(10600, 'ruRU', "Вы уже проложили путь в Кузницу Смерти?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12564,12597) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12564, 'ruRU', "Ты $Gсобрал:собрала; водяные маки, $N?", 0),
(12597, 'ruRU', "Ты $Gсобрал:собрала; водяные маки, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10637,10688) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10637, 'ruRU', "Ты $Gвыполнил:выполнила; задание?", 0),
(10688, 'ruRU', "Ты $Gвыполнил:выполнила; задание?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10619,10807) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10619, 'ruRU', "$GВыполнил:Выполнила; ли ты порученное тебе задание, $N?", 0),
(10807, 'ruRU', "$GВыполнил:Выполнила; ли ты порученное тебе задание, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10651,10692) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10651, 'ruRU', "Ты $Gвыполнил:выполнила; задание, порученное мной, $N?", 0),
(10692, 'ruRU', "Ты $Gвыполнил:выполнила; задание, порученное мной, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13312,13337) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13312, 'ruRU', "Ты $Gвыполнил:выполнила; свою миссию?", 0),
(13337, 'ruRU', "Ты $Gвыполнил:выполнила; свою миссию?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13306,13332) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13306, 'ruRU', "Ты $Gпостроил:построила; эти баррикады?", 0),
(13332, 'ruRU', "Ты $Gпостроил:построила; эти баррикады?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12223,12257) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12223, 'ruRU', "Дело сделано?", 0),
(12257, 'ruRU', "Дело сделано?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13679,13680) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13679, 'ruRU', "Вы столкнулись со своим вызовом?", 0),
(13680, 'ruRU', "Вы столкнулись со своим вызовом?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (30,272) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(30, 'ruRU', "Вы уже собрали кулон воедино и принесли мне, $N? Если вам нужна помощь в поиске частей, спросите местных жителей, возможно, они дадут вам немного информации. Кроме того, это даст вам возможность исследовать эту чудесную и священную поляну.", 0),
(272, 'ruRU', "Вы уже собрали кулон воедино и принесли мне, $N? Если вам нужна помощь в поиске частей, спросите местных жителей, возможно, они дадут вам немного информации. Кроме того, это даст вам возможность исследовать эту чудесную и священную поляну.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10564,10598) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10564, 'ruRU', "Тебе удалось уничтожить инферналов Легиона?", 0),
(10598, 'ruRU', "Тебе удалось уничтожить инферналов Легиона?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13633,13634) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13633, 'ruRU', "Тебе удалось найти что-то, что могло бы подтвердить историю Черного рыцаря?", 0),
(13634, 'ruRU', "Тебе удалось найти что-то, что могло бы подтвердить историю Черного рыцаря?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10568,10683) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10568, 'ruRU', "$GНашел:Нашла; ли ты таблички, $N?", 0),
(10683, 'ruRU', "$GНашел:Нашла; ли ты таблички, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9085,9368) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9085, 'ruRU', "Удача на твоей стороне, $N?", 0),
(9368, 'ruRU', "Удача на твоей стороне, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14136,14152) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14136, 'ruRU', "Вы помогли отразить атаку квалдиров?", 0),
(14152, 'ruRU', "Вы помогли отразить атаку квалдиров?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13314,13333) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13314, 'ruRU', "Удалось ли тебе перехватить их донесения?", 0),
(13333, 'ruRU', "Удалось ли тебе перехватить их донесения?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12816,12817) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12816, 'ruRU', "Ты уже $Gрасследовал:расследовала; вторжение? Нет времени бездельничать!", 0),
(12817, 'ruRU', "Ты уже $Gрасследовал:расследовала; вторжение? Нет времени бездельничать!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14090,14141) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14090, 'ruRU', "Вам уже удалось собрать этих снобольдов? Гнев Гормока не проявляет никаких признаков ослабления.", 0),
(14141, 'ruRU', "Вам уже удалось собрать этих снобольдов? Гнев Гормока не проявляет никаких признаков ослабления.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13837,13839) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13837, 'ruRU', "Ты $Gнаучился:научилась; приему \"Рывок\"?", 0),
(13839, 'ruRU', "Ты $Gнаучился:научилась; приему \"Рывок\"?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3382,3564) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3382, 'ruRU', "Ну что, ты $Gговорил:говорила; с Андроном? Он редко покидает Подгород, так что не думаю, что его будет сложно найти.", 0),
(3564, 'ruRU', "Ну что, ты $Gговорил:говорила; с Андроном? Он редко покидает Подгород, так что не думаю, что его будет сложно найти.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8231,9052) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8231, 'ruRU', "Добились ли вы успеха?", 0),
(9052, 'ruRU', "Добились ли вы успеха?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10574,10685) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10574, 'ruRU', "Ты $Gсобрал:собрала; все четыре фрагмента, $N?", 0),
(10685, 'ruRU', "Ты $Gсобрал:собрала; все четыре фрагмента, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13835,13838) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13835, 'ruRU', "Ты уже $Gнаучился:научилась; разбивать щиты противников?", 0),
(13838, 'ruRU', "Ты уже $Gнаучился:научилась; разбивать щиты противников?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (20439,24451) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(20439, 'ruRU', "Книга у тебя?", 0),
(24451, 'ruRU', "Книга у тебя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2601,2602) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2601, 'ruRU', "Удалось ли тебе добыть нужные органы?", 0),
(2602, 'ruRU', "Удалось ли тебе добыть нужные органы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13315,13351) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13315, 'ruRU', "Ты $Gразведал:разведала; врата запустения, $C?", 0),
(13351, 'ruRU', "Ты $Gразведал:разведала; врата запустения, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14077,14144) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14077, 'ruRU', "Ты $Gпозаботился:позаботилась; о душах убитых туаликов?", 0),
(14144, 'ruRU', "Ты $Gпозаботился:позаботилась; о душах убитых туаликов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13328,13339) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13328, 'ruRU', "Тебе удалось разбить новое оружие Короля-лича?", 0),
(13339, 'ruRU', "Тебе удалось разбить новое оружие Короля-лича?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14080,14140) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14080, 'ruRU', "Вы показали квалдирам, что мы не позволим им угрожать нам?", 0),
(14140, 'ruRU', "Вы показали квалдирам, что мы не позволим им угрожать нам?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10562,10595) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10562, 'ruRU', "Вы уже пробовали, $C?", 0),
(10595, 'ruRU', "Вы уже пробовали, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2203,2501) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2203, 'ruRU', "Ты уже $Gнаполнил:наполнила; сосуды кровью опаленных драконов-стражей? Знаю, задание опасное... но в случае успеха тебя ждет рецепт восстановительного эликсира. Игра стоит свеч, мой друг... игра стоит свеч...", 0),
(2501, 'ruRU', "Ты уже $Gнаполнил:наполнила; сосуды кровью опаленных драконов-стражей? Знаю, задание опасное... но в случае успеха тебя ждет рецепт восстановительного эликсира. Игра стоит свеч, мой друг... игра стоит свеч...", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12469,12871) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12469, 'ruRU', "Привет!", 0),
(12871, 'ruRU', "Привет!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3635,3637) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3635, 'ruRU', "Эй, ты! Если собираешься жаловаться, что мой автономный робот пробил стену твоего дома, можешь сразу обращаться к адвокату. Или ты по другому поводу?", 0),
(3637, 'ruRU', "Эй, ты! Если собираешься жаловаться, что мой автономный робот пробил стену твоего дома, можешь сразу обращаться к адвокату. Или ты по другому поводу?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5841,5843) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5841, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный сертификат. Отдай его мне, и я тебе что-нибудь предложу взамен.", 0),
(5843, 'ruRU', "Приветствую! Какое удовольствие встретить тебя!$B$BЯ вижу, у тебя есть специальный сертификат. Отдай его мне, и я тебе что-нибудь предложу взамен.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14054,14060) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14054, 'ruRU', "Как там пироги, уже готовы?", 0),
(14060, 'ruRU', "Как там пироги, уже готовы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (183,7815) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(183, 'ruRU', "Как идет охота?", 0),
(7815, 'ruRU', "Как идет охота?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13154,13196) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13154, 'ruRU', "Как прошла охота на кости? До меня доходили слухи, что место это облюбовали духи, но у меня никак ноги не доходят сходить посмотреть на них самому.", 0),
(13196, 'ruRU', "Как прошла охота на кости? До меня доходили слухи, что место это облюбовали духи, но у меня никак ноги не доходят сходить посмотреть на них самому.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8825,8843) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8825, 'ruRU', "Я принимаю от искателей приключений рекомендательные жетоны, полученные за выполнение долга. За каждые десять отношение жителей Громового утеса к тебе существенно улучшится. Я также принимаю такие жетоны по одному, но по более низкой ставке. Мы больше ценим великие подвиги, чем малые, хотя ни один не остается без внимания.$B$BИтак, я готов с радостью принять от тебя комплект жетонов.", 0),
(8843, 'ruRU', "Я принимаю от искателей приключений рекомендательные жетоны, полученные за выполнение долга. За каждые десять отношение жителей Громового утеса к тебе существенно улучшится. Я также принимаю такие жетоны по одному, но по более низкой ставке. Мы больше ценим великие подвиги, чем малые, хотя ни один не остается без внимания.$B$BИтак, я готов с радостью принять от тебя комплект жетонов.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13300,13302) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13300, 'ruRU', "Я не получал сообщений о том, что наши люди возвращаются в Серебряный Авангард.$B$BТы $Gуверен:уверена;, что $Gбыл:была; в Имирхейме, чтобы освободить их?", 0),
(13302, 'ruRU', "Я не получал сообщений о том, что наши люди возвращаются в Серебряный Авангард.$B$BТы $Gуверен:уверена;, что $Gбыл:была; в Имирхейме, чтобы освободить их?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13156,13195) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13156, 'ruRU', "Я надеюсь, ты случайно не $Gтронул:тронула; ни одного корнехлеста? Ох, ну и досталось от них рядовому Доану на прошлой неделе!", 0),
(13195, 'ruRU', "Я надеюсь, ты случайно не $Gтронул:тронула; ни одного корнехлеста? Ох, ну и досталось от них рядовому Доану на прошлой неделе!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2850,2857) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2850, 'ruRU', "Мне нужны туники и повязки на голову, а еще мне нужен этот кусок дикой лозы, прежде чем я поделюсь с тобой знаниями о диких кожаных шлемах.$B$BГоловные уборы очень популярны среди искателей приключений, будь то обезоруживающая простая повязка на голову или полностью закрывающий шлем. Основы создания ценных головных уборов остаются неизменными, независимо от внешнего вида снаряжения.", 0),
(2857, 'ruRU', "Мне нужны туники и повязки на голову, а еще мне нужен этот кусок дикой лозы, прежде чем я поделюсь с тобой знаниями о диких кожаных шлемах.$B$BГоловные уборы очень популярны среди искателей приключений, будь то обезоруживающая простая повязка на голову или полностью закрывающий шлем. Основы создания ценных головных уборов остаются неизменными, независимо от внешнего вида снаряжения.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10327,10655) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10327, 'ruRU', "Я приму любой оставшийся у тебя знак. Не волнуйся, твои усилия будут оценены должным образом.", 0),
(10655, 'ruRU', "Я приму любой оставшийся у тебя знак. Не волнуйся, твои усилия будут оценены должным образом.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7733,7734) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7733, 'ruRU', "Если эти шкуры не уступают шкурам йети Дикого Утеса, они, должно быть, по прочности ничем не хуже тория!$B$BТы только представь себе!", 0),
(7734, 'ruRU', "Если эти шкуры не уступают шкурам йети Дикого Утеса, они, должно быть, по прочности ничем не хуже тория!$B$BТы только представь себе!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (1369,1371) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(1369, 'ruRU', "Если ты нам не враг, то сделаешь то, о чем я прошу!", 0),
(1371, 'ruRU', "Если ты нам не враг, то сделаешь то, о чем я прошу!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7662,7663) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7662, 'ruRU', "Если ты принесешь мне своего старого кодо, я обменяю тебе его на одного нового. Новый кодо, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе кодо.", 0),
(7663, 'ruRU', "Если ты принесешь мне своего старого кодо, я обменяю тебе его на одного нового. Новый кодо, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе кодо.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7660,7661) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7660, 'ruRU', "Если ты принесешь мне своего старого быстрого волка, я обменяю его тебе на одного нового. Новый волк, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе волка.", 0),
(7661, 'ruRU', "Если ты принесешь мне своего старого быстрого волка, я обменяю его тебе на одного нового. Новый волк, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе волка.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10625,10643) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10625, 'ruRU', "Если ты вдруг потеряешь свои очки, дай мне знать – я сделаю для тебя еще одну пару.", 0),
(10643, 'ruRU', "Если ты вдруг потеряешь свои очки, дай мне знать – я сделаю для тебя еще одну пару.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5141,5145) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5141, 'ruRU', "Если ты $Gготов:готова; принять это решение и из трех школ выбрать школу чешуи драконов, то я возьму тебя в ученики. Принеси мне то, что я просил, и мы начнем обучение.", 0),
(5145, 'ruRU', "Если ты $Gготов:готова; принять это решение и из трех школ выбрать школу чешуи драконов, то я возьму тебя в ученики. Принеси мне то, что я просил, и мы начнем обучение.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12611,12660) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12611, 'ruRU', "Готово, $N?", 0),
(12660, 'ruRU', "Готово, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11400,11419) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11400, 'ruRU', "Это штамп «Почетный пивовар» уже в твоих руках?", 0),
(11419, 'ruRU', "Это штамп «Почетный пивовар» уже в твоих руках?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11502,11503) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11502, 'ruRU', "Твоя задача выполнена, $N?", 0),
(11503, 'ruRU', "Твоя задача выполнена, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9153,9323) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9153, 'ruRU', "Потребуется какое-то время, чтобы избавиться от нависшей над нами угрозы. Как далеко тебе удалось продвинуться, $N?", 0),
(9323, 'ruRU', "Потребуется какое-то время, чтобы избавиться от нависшей над нами угрозы. Как далеко тебе удалось продвинуться, $N?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13382,13404) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13382, 'ruRU', "Держись, $N. Сама по себе воздушная битва не выиграет!", 0),
(13404, 'ruRU', "Держись, $N. Сама по себе воздушная битва не выиграет!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13364,13403) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13364, 'ruRU', "Да пребудет с тобой свет, $N.", 0),
(13403, 'ruRU', "Да пребудет с тобой свет, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5144,5146) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5144, 'ruRU', "Изготовление этого типа кожаных доспехов требует терпения и самоотдачи. Когда решаешься связать свою судьбу со Стихиями, спиной к ним уже не повернешься. Принеси мне доказательства того, что ты на что-то годен, – и мы начнем.", 0),
(5146, 'ruRU', "Изготовление этого типа кожаных доспехов требует терпения и самоотдачи. Когда решаешься связать свою судьбу со Стихиями, спиной к ним уже не повернешься. Принеси мне доказательства того, что ты на что-то годен, – и мы начнем.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (6622,6624) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(6622, 'ruRU', "Чудотворная работа, доктор. Просто чудесно.", 0),
(6624, 'ruRU', "Чудотворная работа, доктор. Просто чудесно.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7481,7482) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7481, 'ruRU', "Моя помощница, ученый ночных эльфов, Рунеторн, вербует своих союзников для выполнения этой задачи.", 0),
(7482, 'ruRU', "Моя помощница, ученый ночных эльфов, Рунеторн, вербует своих союзников для выполнения этой задачи.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5143,5148) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5143, 'ruRU', "Силы природы надлежит умиротворить прежде, чем пытаться использовать их в кожевенном деле. Принеси ко мне свою жертву этим силам, и я позабочусь о том, чтобы тебя услышали!", 0),
(5148, 'ruRU', "Силы природы надлежит умиротворить прежде, чем пытаться использовать их в кожевенном деле. Принеси ко мне свою жертву этим силам, и я позабочусь о том, чтобы тебя услышали!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8356,8359) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8356, 'ruRU', "Никаких конфет, пока не поиграешь мускулами для меня, $N...", 0),
(8359, 'ruRU', "Никаких конфет, пока не поиграешь мускулами для меня, $N...", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5,8499) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5, 'ruRU', "О, посылка от моего брата? Великолепно! Сегодня мне по-настоящему светит удача!", 0),
(8499, 'ruRU', "О, посылка от моего брата? Великолепно! Сегодня мне по-настоящему светит удача!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3641,3643) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3641, 'ruRU', "Как только я получу на рассмотрение ваши искусные инженерные изделия, я выдам вам настоящий членский билет гильдии гномов-инженеров! Пока он будет действителен, вы будете иметь неограниченный допуск к любому наставнику по гномскому инженерному делу в мире.", 0),
(3643, 'ruRU', "Как только я получу на рассмотрение ваши искусные инженерные изделия, я выдам вам настоящий членский билет гильдии гномов-инженеров! Пока он будет действителен, вы будете иметь неограниченный допуск к любому наставнику по гномскому инженерному делу в мире.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13384,13385) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13384, 'ruRU', "Лишь Малигос обладает Сердцем Магии. Это самое ценное, что у него есть.", 0),
(13385, 'ruRU', "Лишь Малигос обладает Сердцем Магии. Это самое ценное, что у него есть.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3781,3782) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3781, 'ruRU', "Да пребудут с тобой мир и спокойствие. Как понимаю, ты с поручением от самого верховного друида?", 0),
(3782, 'ruRU', "Да пребудут с тобой мир и спокойствие. Как понимаю, ты с поручением от самого верховного друида?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (4771,5251) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(4771, 'ruRU', "Помните, $N - мы должны быть терпеливыми, но твердыми в своих убеждениях!", 0),
(5251, 'ruRU', "Помните, $N - мы должны быть терпеливыми, но твердыми в своих убеждениях!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10702,10703) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10702, 'ruRU', "Возвращайся ко мне, когда наши караваны перейдут в безопасные дебри.", 0),
(10703, 'ruRU', "Возвращайся ко мне, когда наши караваны перейдут в безопасные дебри.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12787,12812) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12787, 'ruRU', "Приветствую, $N. Ты из Шаттрата? У тебя есть инструкции от великого аптекаря Гнилесса?", 0),
(12812, 'ruRU', "Приветствую, $N. Ты из Шаттрата? У тебя есть инструкции от великого аптекаря Гнилесса?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (1373,1374) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(1373, 'ruRU', "Докажи, что ты – подлинный друг племени Гелкис, $N.", 0),
(1374, 'ruRU', "Докажи, что ты – подлинный друг племени Гелкис, $N.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (3911,7201) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(3911, 'ruRU', "Покажи мне их!", 0),
(7201, 'ruRU', "Покажи мне их!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13153,13198) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13153, 'ruRU', "Ну как, получилось достать доспехи?", 0),
(13198, 'ruRU', "Ну как, получилось достать доспехи?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10660,10661) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10660, 'ruRU', "Мне нужны селезенки! Где мои селезенки!", 0),
(10661, 'ruRU', "Мне нужны селезенки! Где мои селезенки!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (6145,14350) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(6145, 'ruRU', "Если ты справишься с этой задачей, можешь считать, что почти заслужил мое уважение, $C.", 0),
(14350, 'ruRU', "Если ты справишься с этой задачей, можешь считать, что почти заслужил мое уважение, $C.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13415,13416) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13415, 'ruRU', "На пульте есть специальная панель, которая, кажется, предназначена как раз для диска изобретателя.", 0),
(13416, 'ruRU', "На пульте есть специальная панель, которая, кажется, предназначена как раз для диска изобретателя.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13604,13817) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13604, 'ruRU', "Гнездо приемника открывается, а панель управления жужжит и вибрирует.", 0),
(13817, 'ruRU', "Гнездо приемника открывается, а панель управления жужжит и вибрирует.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13614,13818) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13614, 'ruRU', "Яркие лучи панели периодически освещают стеклянную поверхность, как будто ожидают ввода данных.", 0),
(13818, 'ruRU', "Яркие лучи панели периодически освещают стеклянную поверхность, как будто ожидают ввода данных.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13304,13393) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13304, 'ruRU', "Разрушитель сильно пострадал.", 0),
(13393, 'ruRU', "Разрушитель сильно пострадал.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7938,7944) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7938, 'ruRU', "Этот сундук очень похож на тот, что явился вам в видении.", 0),
(7944, 'ruRU', "Этот сундук очень похож на тот, что явился вам в видении.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10585,10602) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10585, 'ruRU', "Мы не можем позволить им продолжать производство. Ты $Gположил:положила; конец ритуалу призыва?", 0),
(10602, 'ruRU', "Мы не можем позволить им продолжать производство. Ты $Gположил:положила; конец ритуалу призыва?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13321,13322) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13321, 'ruRU', "Что ж, $C?$B$BУ нас меньше сектантов, о которых нужно беспокоиться?", 0),
(13322, 'ruRU', "Что ж, $C?$B$BУ нас меньше сектантов, о которых нужно беспокоиться?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13610,13823) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13610, 'ruRU', "Итак, $N... Ты заполучил это?", 0),
(13823, 'ruRU', "Итак, $N... Ты заполучил это?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12648,12649) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12648, 'ruRU', "Ну что, $N?$B$BТы $Gкупил:купила; эту фляжку?", 0),
(12649, 'ruRU', "Ну что, $N?$B$BТы $Gкупил:купила; эту фляжку?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8355,8358) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8355, 'ruRU', "Ну, а теперь продолжайте...", 0),
(8358, 'ruRU', "Ну, а теперь продолжайте...", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (5505,5511) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(5505, 'ruRU', "Ну, вот, готово, $N – это ключ от Некроситета. Я не сомеваюсь, что он позволит тебе проникнуть в пределы школы. Впрочем, есть лишь один способ узнать наверняка. И не теряй времени даром.$B$BУдачи тебе, герой. Да рассеют твои победы мрак!", 0),
(5511, 'ruRU', "Ну, вот, готово, $N – это ключ от Некроситета. Я не сомеваюсь, что он позволит тебе проникнуть в пределы школы. Впрочем, есть лишь один способ узнать наверняка. И не теряй времени даром.$B$BУдачи тебе, герой. Да рассеют твои победы мрак!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13191,13200) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13191, 'ruRU', "Ну как? Получилось ли у тебя найти угли, или Альянс побил тебя, и ты $Gсбежал:сбежала; $Gвесь:вся; в слезах?", 0),
(13200, 'ruRU', "Ну как? Получилось ли у тебя найти угли, или Альянс побил тебя, и ты $Gсбежал:сбежала; $Gвесь:вся; в слезах?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (236,13197) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(236, 'ruRU', "Ну как? Получилось ли у тебя найти угли, или Орда побила тебя, и ты $Gсбежал:сбежала; $Gвесь:вся; в слезах?", 0),
(13197, 'ruRU', "Ну как? Получилось ли у тебя найти угли, или Орда побила тебя, и ты $Gсбежал:сбежала; $Gвесь:вся; в слезах?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11431,11117) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11431, 'ruRU', "Ты $Gбыл:была; достаточно $Gпьян:пьяна;, чтобы увидеть маленьких зайцелопов?", 0),
(11117, 'ruRU', "Ты $Gбыл:была; достаточно $Gпьян:пьяна;, чтобы увидеть маленьких зайцелопов?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13278,13298) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13278, 'ruRU', "Тебе удалось найти зомби, $C?", 0),
(13298, 'ruRU', "Тебе удалось найти зомби, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14051,14062) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14051, 'ruRU', "Ну, что там с запеканкой?", 0),
(14062, 'ruRU', "Ну, что там с запеканкой?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14053,14059) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14053, 'ruRU', "Ты уже несешь клюквенный соус?", 0),
(14059, 'ruRU', "Ты уже несешь клюквенный соус?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13279,13295) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13279, 'ruRU', "Тебе удалось нейтрализовать чуму, $C?", 0),
(13295, 'ruRU', "Тебе удалось нейтрализовать чуму, $C?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13611,13824) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13611, 'ruRU', "Ну что, $N, где печать?", 0),
(13824, 'ruRU', "Ну что, $N, где печать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14074,14143) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14074, 'ruRU', "Тебе удалось найти украденные припасы?", 0),
(14143, 'ruRU', "Тебе удалось найти украденные припасы?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13194,13201) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13194, 'ruRU', "Удалось ли тебе отыскать травы? Число больных и раненых растет с каждым часом.", 0),
(13201, 'ruRU', "Удалось ли тебе отыскать травы? Число больных и раненых растет с каждым часом.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10662,10663) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10662, 'ruRU', "Что привело тебя сюда, |3-6($R)?У меня не часто бывают гости.", 0),
(10663, 'ruRU', "Что привело тебя сюда, |3-6($R)?У меня не часто бывают гости.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10898,13148) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10898, 'ruRU', "Что привело тебя сюда?", 0),
(13148, 'ruRU', "Что привело тебя сюда?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12014,12204) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12014, 'ruRU', "Что тебе удалось обнаружить?", 0),
(12204, 'ruRU', "Что тебе удалось обнаружить?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11962,12055) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11962, 'ruRU', "Что это у тебя?", 0),
(12055, 'ruRU', "Что это у тебя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11879,12721) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11879, 'ruRU', "Что случилось?", 0),
(12721, 'ruRU', "Что случилось?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12174,12298) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12174, 'ruRU', "Что у тебя, солдат?", 0),
(12298, 'ruRU', "Что у тебя, солдат?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11982,12316) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11982, 'ruRU', "Есть что сообщить?", 0),
(12316, 'ruRU', "Есть что сообщить?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (2978,10756) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(2978, 'ruRU', "Что это?", 0),
(10756, 'ruRU', "Что это?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10586,10603) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10586, 'ruRU', "Ну, какие новости из Кузницы Смерти?", 0),
(10603, 'ruRU', "Ну, какие новости из Кузницы Смерти?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13405,14180) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13405, 'ruRU', "Скажи мне, $N. Какие новости ты $Gпривез:привезла: с фронта?", 0),
(14180, 'ruRU', "Скажи мне, $N. Какие новости ты $Gпривез:привезла; с фронта?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12501,12563) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12501, 'ruRU', "Какие новости из наших постов, |3-6($R)?", 0),
(12563, 'ruRU', "Какие новости из наших постов, |3-6($R)?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12105,12423) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12105, 'ruRU', "Что это у тебя в руках?", 0),
(12423, 'ruRU', "Что это у тебя в руках?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7735,7738) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7735, 'ruRU', "Что это, $N? У тебя есть для меня нечто особенное?", 0),
(7738, 'ruRU', "Что это, $N? У тебя есть для меня нечто особенное?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13320,24917) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13320, 'ruRU', "Ну-ка, |3-6($R), что тут у тебя?", 0),
(24917, 'ruRU', "Ну-ка, |3-6($R), что тут у тебя?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (14203,24431) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(14203, 'ruRU', "Я всегда говорю, что вино так же прекрасно, как и тот, кто его пьет.", 0),
(24431, 'ruRU', "Я всегда говорю, что вино так же прекрасно, как и тот, кто его пьет.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10901,13431) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10901, 'ruRU', "С исправленной дубиной я вырвусь из своих оков и вернусь в Змеиное святилище, чтобы отомстить Вайш и ее приспешникам!", 0),
(13431, 'ruRU', "С исправленной дубиной я вырвусь из своих оков и вернусь в Змеиное святилище, чтобы отомстить Вайш и ее приспешникам!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (12585,12599) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(12585, 'ruRU', "Ты $Gсобрал:собрала; нам дрова для костра, |3-6($R)?", 0),
(12599, 'ruRU', "Ты $Gсобрал:собрала; нам дрова для костра, |3-6($R)?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24536,24655) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24536, 'ruRU', "Ты уже $Gпроанализировал:проанализировала; эту вонь, $Gпарень:девочка;?", 0),
(24655, 'ruRU', "Ты уже $Gпроанализировал:проанализировала; эту вонь, $Gпарень:девочка;?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (485,2766) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(485, 'ruRU', "Больше всего это похоже на обломки... механического цыпленка. Изнутри яйца снова раздается голосок: \"Да, отличная работа! Это мой автономный робот. Сенсоры показывают, что без подзарядки он не заведется и не долетит в Пиратскую бухту на починку... Иди вперед и положи маяк в робота – дальше он сам все сделает!\"", 0),
(2766, 'ruRU', "Больше всего это похоже на обломки... механического цыпленка. Изнутри яйца снова раздается голосок: \"Да, отличная работа! Это мой автономный робот. Сенсоры показывают, что без подзарядки он не заведется и не долетит в Пиратскую бухту на починку... Иди вперед и положи маяк в робота – дальше он сам все сделает!\"", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7664,7665) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7664, 'ruRU', "Если ты принесешь мне своего старого ящера, я обменяю тебе его на одного нового. Новый ящер, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе ящера.", 0),
(7665, 'ruRU', "Если ты принесешь мне своего старого ящера, я обменяю тебе его на одного нового. Новый ящер, будет так же быстр, как и твой старый, но иметь другой вид. Ты можешь посмотреть здесь на их вид и выбрать подходящего тебе ящера.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10769,10776) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10769, 'ruRU', "Ты $Gвернулся:вернулась;!", 0),
(10776, 'ruRU', "Ты $Gвернулся:вернулась;!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (1220,1238) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(1220, 'ruRU', "У тебя что-то есть для меня?", 0),
(1238, 'ruRU', "У тебя что-то есть для меня?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9875,12424) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9875, 'ruRU', "Ты хочешь мне что-то показать?", 0),
(12424, 'ruRU', "Ты хочешь мне что-то показать?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8357,8360) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8357, 'ruRU', "Ты же знаешь, как танцевать? Попробуй поставить вот эту ногу сюда... а вот эту сюда... теперь вот так...", 0),
(8360, 'ruRU', "Ты же знаешь, как танцевать? Попробуй поставить вот эту ногу сюда... а вот эту сюда... теперь вот так...", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10635,10636) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10635, 'ruRU', "Используй Спектроскоп, чтобы увидеть духов долины Призрачной Луны.", 0),
(10636, 'ruRU', "Используй Спектроскоп, чтобы увидеть духов долины Призрачной Луны.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (24823,24828) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(24823, 'ruRU', "Ты желаешь и дальше идти путем разрушения?", 0),
(24828, 'ruRU', "Ты желаешь и дальше идти путем разрушения?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (11010,11102) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(11010, 'ruRU', "Ну как – еще не разделались с их пушечными ядрами?", 0),
(11102, 'ruRU', "Ну как – еще не разделались с их пушечными ядрами?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (10612,10613) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(10612, 'ruRU', "Вы вернулись, так что я предполагаю, что операция прошла хорошо. Что вы должны сообщить?", 0),
(10613, 'ruRU', "Вы вернулись, так что я предполагаю, что операция прошла хорошо. Что вы должны сообщить?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (9022,10497) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(9022, 'ruRU', "Ты $Gвернулся:вернулась; и я вижу по твоим глазам, что тебе есть что сказать мне, $N. Позволь нам в первую очередь позаботиться о твоей награде.", 0),
(10497, 'ruRU', "Ты $Gвернулся:вернулась; и я вижу по твоим глазам, что тебе есть что сказать мне, $N. Позволь нам в первую очередь позаботиться о твоей награде.", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (8922,9255) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(8922, 'ruRU', "Вы что-то мне принесли?", 0),
(9255, 'ruRU', "Вы что-то мне принесли?", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (7737,13662) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(7737, 'ruRU', "Ты быстро продвигаешься по служебной лестнице в Братстве, $R. Ты начинаешь в самом деле завоевывать нашу благосклонность.$B$BЕсли хочешь заслужить еще большее уважение, слушай внимательно.$B$BМы хотим повысить качество нашего огненного плавня путем добавления в него окалины черного железа. Окалину можно добыть в Глубинах Черной горы.$B$BПринеси мне как можно больше!", 0),
(13662, 'ruRU', "Ты быстро продвигаешься по служебной лестнице в Братстве, $R. Ты начинаешь в самом деле завоевывать нашу благосклонность.$B$BЕсли хочешь заслужить еще большее уважение, слушай внимательно.$B$BМы хотим повысить качество нашего огненного плавня путем добавления в него окалины черного железа. Окалину можно добыть в Глубинах Черной горы.$B$BПринеси мне как можно больше!", 0);

DELETE FROM `quest_request_items_locale` WHERE `id` IN (13905,13914) AND `locale` = 'ruRU';
INSERT INTO `quest_request_items_locale` (`ID`, `locale`, `CompletionText`, `VerifiedBuild`) VALUES
(13905, 'ruRU', "Ваш равазаврик выжидательно смотрит на вас.", 0),
(13914, 'ruRU', "Ваш равазаврик выжидательно смотрит на вас.", 0);
