DELETE FROM `instance_encounters` WHERE `instance_encounters`.`entry` IN (1412, 1413, 1414, 1439, 1416, 1417, 1418, 1419, 1397, 1405, 1406, 1304, 1303, 1305, 1306);
INSERT INTO `instance_encounters` VALUES
-- Хмелеварня буйных портеров
(1412, 0, 56637, 0, ''),
(1413, 0, 56717, 0, ''),
(1414, 0, 59479, 465, 'last boss'),
-- Храм нефритовой змеи
(1439, 0, 56439, 0, ''),
(1416, 0, 56732, 0, ''),
(1417, 0, 56843, 0, ''),
(1418, 0, 56448, 464, 'last boss'),
-- Врата Заходящего Солнца
(1419, 0, 56877, 471, 'last boss'),
(1397, 0, 56906, 0, ''),
(1405, 0, 56589, 0, ''),
(1406, 0, 56636, 0, ''),
-- Монастырь ШадоПан
(1304, 0, 56541, 0, ''),
(1303, 0, 56747, 0, ''),
(1305, 0, 56719, 0, ''),
(1306, 0, 56884, 466, 'last boss');