/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET FOREIGN_KEY_CHECKS=0 */;

UPDATE `creature_template` SET `mechanic_immune_mask` = '650854399', `lootid` =  '0', `ScriptName` = 'boss_sha_of_pride' WHERE `entry` = 71734;
DELETE FROM  `creature_loot_template` WHERE  `entry` =71734;
UPDATE `creature_template` SET `unit_class` = '4' WHERE `creature_template`.`entry` = 71734;

UPDATE `creature_template_addon` SET `auras` = '103742' WHERE `creature_template_addon`.`entry` = 71734;
UPDATE `creature_template_addon` SET `auras` = '146058' WHERE `creature_template_addon`.`entry` = 68553;
UPDATE `creature_template` SET `flags_extra` = '128' WHERE `creature_template`.`entry` = 68553;

UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_norushen' WHERE `entry` = 71965;
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_lowerwalker' WHERE `entry` = 61348;
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_manifest_of_pride' WHERE `entry` = 71946;
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_reflection' WHERE `entry` = 72172;

DELETE FROM creature where id in (72172, 72791, 71965, 61348, 72779, 68553, 71946, 72846);
INSERT INTO `creature` (`id`, `map`, `spawnMask`, `phaseMask`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`) VALUES
(72791, 1136, 16632, 1, 0, 0, 700.146, 1090.08, 356.156, 5.90204, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 699.82, 1116.13, 356.156, 5.49896, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 734.304, 1146.34, 356.155, 5.00074, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 777.953, 1135.27, 356.156, 4.43177, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 730.934, 1139.3, 356.156, 5.06857, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 743.84, 1139.94, 356.156, 4.90203, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 718.899, 1046.67, 356.155, 0.480011, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 694.957, 1101.39, 356.156, 5.78219, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 715.559, 1065.27, 356.155, 0.0397535, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 713.693, 1057.61, 356.155, 0.32152, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 696.776, 1083.04, 356.156, 6.02567, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 779.141, 1110.63, 356.156, 4.25885, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 805.464, 1107.68, 356.156, 3.95099, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 806.014, 1123.73, 356.156, 4.00887, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 717.922, 1096.39, 356.156, 5.64795, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 793.252, 1081.22, 356.155, 3.48255, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 708.877, 1077.56, 356.156, 5.94888, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 772.651, 1124.65, 356.156, 4.46131, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 784.688, 1126.91, 356.156, 4.26557, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 716.102, 1114.74, 356.156, 5.43042, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 794.983, 1147.81, 356.156, 4.29584, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 789.443, 1091.32, 356.156, 3.79859, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 711.168, 1091.48, 356.156, 5.79935, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 705.589, 1123.68, 356.156, 5.44733, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 808.809, 1086.21, 356.155, 3.43527, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 794.616, 1068.88, 356.155, 3.31959, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 724.339, 1111.05, 356.156, 5.36218, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 688.736, 1113.34, 356.156, 5.68201, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 790.042, 1105.24, 356.156, 4.10247, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 804.168, 1073.61, 356.155, 3.28433, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 705.993, 1046.03, 356.155, 0.383527, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 800.828, 1092.2, 356.156, 3.67285, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 801.188, 1134.52, 356.156, 4.14211, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 785.592, 1143.98, 356.156, 4.48184, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 704.174, 1064.38, 356.155, 0.0478288, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 794.991, 1122.32, 356.156, 4.12154, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 720.076, 1143.6, 356.096, 1.33856, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 692.725, 1126.38, 356.072, 5.69197, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 758.985, 1152.9, 356.072, 4.78312, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 735.561, 1148.44, 356.072, 3.68394, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 690.549, 1128.55, 356.072, 0.139756, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 771.71, 1143.87, 356.212, 3.61357, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 783.924, 1153.86, 356.072, 0.142603, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 745.721, 1165.68, 356.072, 5.19525, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 704.505, 1141.83, 356.072, 3.03713, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 678.963, 1138.79, 356.072, 0.733409, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 701.258, 1146.86, 356.072, 4.59728, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 707.285, 1158.4, 356.072, 5.62684, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 771.401, 1174.33, 356.072, 3.50128, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
(72791, 1136, 16632, 1, 0, 0, 787.394, 1175.35, 356.072, 4.26258, 7200, 5, 0, 1, 0, 1, 0, 0, 0),
--
(68553, 1136, 16632, 1, 0, 0, 743.182, 1134.5, 356.156, 4.85813, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(68553, 1136, 16632, 1, 0, 0, 768.233, 1017.95, 367.211, 4.95611, 7200, 0, 0, 1, 0, 0, 0, 0, 0),
(68553, 1136, 16632, 1, 0, 0, 748.087, 1112.69, 356.156, 4.90551, 7200, 0, 0, 1, 0, 0, 0, 0, 0);

--
DELETE FROM gameobject WHERE map = 1136 AND id in (221678, 221677, 222683, 221752, 221751, 221753, 222682, 221755, 221754, 
221750, 222679, 221679,221676,  222810,222809,  222680, 221760, 221756, 221761, 222681, 221757, 221759, 221758);
INSERT INTO `gameobject` (`id`, `map`, `spawnMask`, `phaseMask`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`) VALUES
(221678, 1136, 16632, 1, 731.5736, 1087.689, 353.7177, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 221678 (Area: -1)
(221677, 1136, 16632, 1, 772.8319, 1096.459, 353.7179, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 221677 (Area: -1)
(222683, 1136, 16632, 1, 731.6327, 1087.473, 355.6587, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222683 (Area: -1)
(221752, 1136, 16632, 1, 732.0667, 1087.847, 354.6127, 5.838127, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221752 (Area: -1)
(221751, 1136, 16632, 1, 731.5802, 1087.781, 354.6127, 3.743731, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221751 (Area: -1)
(221753, 1136, 16632, 1, 731.9785, 1088.212, 354.6127, 1.649336, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221753 (Area: -1)
(222682, 1136, 16632, 1, 772.892, 1096.243, 355.6587, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222682 (Area: -1)
(221755, 1136, 16632, 1, 772.9168, 1096.363, 354.6127, 5.314528, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221755 (Area: -1)
(221754, 1136, 16632, 1, 772.4857, 1096.761, 354.6127, 3.220161, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221754 (Area: -1)
(221750, 1136, 16632, 1, 772.8506, 1096.849, 354.6127, 1.125737, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221750 (Area: -1)
(222679, 1136, 16632, 1, 747.9799, 1112.775, 356.0117, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222679 (Area: -1)
(221679, 1136, 16632, 1, 722.3209, 1128.392, 353.7177, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 221679 (Area: -1)
(221676, 1136, 16632, 1, 764.0715, 1137.554, 353.7177, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 221676 (Area: -1)
(222810, 1136, 16632, 1, 685.6007, 1099.399, 355.6973, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222810 (Area: -1)
(222809, 1136, 16632, 1, 809.0228, 1126.073, 355.8217, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222809 (Area: -1)
(222680, 1136, 16632, 1, 722.379, 1128.177, 355.6587, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222680 (Area: -1)
(221760, 1136, 16632, 1, 723.4701, 1128.692, 354.6127, 0.07854, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221760 (Area: -1)
(221756, 1136, 16632, 1, 723.1052, 1128.604, 354.6127, 4.267334, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221756 (Area: -1)
(221761, 1136, 16632, 1, 723.039, 1129.091, 354.6127, 2.172932, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221761 (Area: -1)
(222681, 1136, 16632, 1, 764.2142, 1137.069, 355.6587, 4.921829, 0, 0, -0.4656145, 0.8849877, 7200, 255, 1), -- 222681 (Area: -1)
(221757, 1136, 16632, 1, 763.9813, 1137.247, 354.6129, 4.790929, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221757 (Area: -1)
(221759, 1136, 16632, 1, 763.89, 1137.623, 354.6127, 2.696529, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0), -- 221759 (Area: -1)
(221758, 1136, 16632, 1, 764.3764, 1137.689, 354.6127, 0.6021378, 0, 0, -0.4656145, 0.8849877, 7200, 255, 0); -- 221758 (Area: -1);

UPDATE creature SET spawntimesecs = 604800 WHERE id in (72791, 71734);
UPDATE `creature_template_addon` SET `auras` = '146011' WHERE `creature_template_addon`.`entry` = 72779;

DELETE FROM creature_text WHERE entry in (71734, 71965, 61348, 72779);
INSERT INTO `creature_text` (`entry`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `comment`) VALUES
(71734, 0, 0, 'Идите ко мне. Отдайтесь гордыне. Покажите свое «величие»!', 14, 0, 100, 0, 0, 38899, 0),
(71734, 1, 0, 'Как глупо...', 14, 0, 100, 0, 0, 38896, 0),
(71734, 2, 0, 'Ты лучше всех своих друзей!', 14, 0, 100, 0, 0, 38908, 0),
(71734, 3, 0, 'Надменность питает меня!', 14, 0, 100, 0, 0, 38911, 0),
(71734, 4, 0, 'Надменность подчинила тебя.', 14, 0, 100, 0, 0, 38909, 0),
(71734, 5, 0, 'Отдайся... гордыне!', 14, 0, 100, 0, 0, 38910, 0),
(71734, 6, 0, 'Не кланяйтесь ни королю, ни вождю.', 14, 0, 100, 0, 0, 38912, 0),
(71734, 7, 0, 'Какая слабость.', 14, 0, 100, 0, 0, 38905, 0),
(71734, 8, 0, 'Гордыня затуманила твой взор, слуга титанов! ТЕБЕ НЕ ОДОЛЕТЬ МЕНЯ!', 14, 0, 100, 0, 0, 38898, 0),
(71734, 9, 0, 'Это было ваше слабое звено.', 14, 0, 100, 0, 0, 38906, 0),
(71734, 10, 0, 'Вини своих друзей!', 14, 0, 100, 0, 0, 38907, 0),
(71734, 11, 0, '|TInterface/\Icons/\sha_ability_rogue_sturdyrecuperate.blp:20|t %s начинает применять заклинание |cFFF00000|Hspell:144563|h[Пленение]|h|r!', 41, 0, 100, 0, 0, 0, 0),
(71734, 12, 0, '|TInterface/\Icons/\sha_spell_warlock_demonsoul.blp:20|t %s начинает применять заклинание |cFFF00000|Hspell:144400|h[Раздутая гордыня]|h|r!', 41, 0, 100, 0, 0, 0, 0),
(71734, 13, 0, '|TInterface/\Icons/\sha_ability_warrior_bloodnova.blp:20|t Вы создали |cFFF00000|Hspell:145066|h[проекцию]|h|r!', 42, 0, 100, 0, 0, 0, 0),
(71734, 14, 0, '|TInterface/\Icons/\sha_ability_rogue_envelopingshadows.blp:20|t Вас захватывает |cFFF00000|Hspell:146817|h[аура гордыни]|h|r!', 42, 0, 100, 0, 0, 0, 0),
(71734, 15, 0, 'Гордыня затуманила твой взор, слуга титанов! ТЕБЕ НЕ ОДОЛЕТЬ МЕНЯ!', 14, 0, 100, 0, 0, 38898, 0),
-- Norushen
(71965, 0, 0, 'Вы выдержали испытание и доказали, что достойны. Но помните: внутри вас ждут куда более серьезные трудности. Как только будете готовы, можете войти.', 14, 0, 100, 0, 0, 38882, 0),
(71965, 1, 0, 'Порча усиливается. Фрагменты нужно уничтожить, иначе будет поздно.', 14, 0, 100, 0, 0, 38903, 0),
(71965, 2, 0, 'Не сработало. Он идет. Приготовьтесь. Будьте стойки душой и сердцем.', 14, 0, 100, 0, 0, 38904, 0),
(71965, 3, 0, 'Отбросьте высокомерие.', 14, 0, 100, 0, 0, 38901, 0),
(71965, 3, 1, 'Будьте скромнее.', 14, 0, 100, 0, 0, 38900, 0),
(71965, 4, 0, 'Вы... должны... удержать... его...', 14, 0, 100, 0, 0, 38902, 'Ша Гордыни'),
--
(61348, 0, 0, 'Тажань Чжу!', 14, 0, 100, 0, 0, 38144, 0),
(61348, 1, 0, 'Тише. Тише. Я отведу тебя к лекарям.', 12, 0, 100, 0, 0, 38145, 'Тажань Чжу'),
(61348, 2, 0, 'Я найду помощь! Удерживайте ша как можно дольше!', 14, 0, 100, 0, 0, 38146, 'Тажань Чжу'),
(61348, 3, 0, 'Герои! Вы живы. Я привел подмогу.', 14, 0, 100, 0, 0, 38147, 0),
--
(72779, 0, 0, '*кашляет* ', 12, 0, 100, 0, 0, 38307, 'Хранитель истории Чо'),
(72779, 1, 0, 'Чо... чужаки... это все ОНИ... нельзя было их впускать...', 12, 0, 100, 0, 0, 38308, 'Хранитель истории Чо');


SET @id = 0;
SET @entry = 71965;
DELETE FROM `script_waypoint` WHERE `entry` = @entry;
INSERT INTO `script_waypoint` (`entry`, `pointid`, `location_x`, `location_y`, `location_z`, `point_comment`) VALUES 
(@entry, @id := @id+ 1, 794.3706, 894.219, 371.1301, NULL),
(@entry, @id := @id+ 1, 789.6668, 915.727, 357.1924, NULL),
(@entry, @id := @id+ 1, 783.7484, 946.2997, 357.3061, NULL),
(@entry, @id := @id+ 1, 776.5015, 978.3145, 356.5714, NULL),
-- 145979
(@entry, @id := @id+ 1, 763.9922, 1040.491, 357.2061, NULL),
-- Порча усиливается. Фрагменты нужно уничтожить, иначе будет поз
(@entry, @id := @id+ 1, 763.9922, 1040.491, 357.2061, NULL);

SET @id = 0;
SET @entry = 61348;
DELETE FROM `script_waypoint` WHERE `entry` = @entry;
INSERT INTO `script_waypoint` (`entry`, `pointid`, `location_x`, `location_y`, `location_z`, `point_comment`) VALUES 
(@entry, @id := @id+ 1, 801.0469, 893.2049, 371.13, NULL),
(@entry, @id := @id+ 1, 796.3127, 918.0088, 356.9289, NULL),
(@entry, @id := @id+ 1, 792.0138, 942.7969, 356.4434, NULL),
(@entry, @id := @id+ 1, 785.804, 973.9192, 356.4572, NULL),
(@entry, @id := @id+ 1, 781.9784, 997.565, 356.5898, NULL),
(@entry, @id := @id+ 1, 755.4828, 1050.636, 356.2061, NULL),
-- Text: *кашляет* 
-- Text: Тажань Чжу!
(@entry, @id := @id+ 1, 766.8073, 1023.274, 357.3615, NULL),
-- Я найду помощь! Удерживайте ша как можно дольше!
(@entry, @id := @id+ 1, 768.5957, 1015.858, 356.6122, NULL),
(@entry, @id := @id+ 1, 776.3892, 978.5554, 356.4566, NULL),
(@entry, @id := @id+ 1, 784.4169, 941.2675, 356.4563, NULL),
(@entry, @id := @id+ 1, 786.0801, 934.1655, 356.2004, NULL),
(@entry, @id := @id+ 1, 790.1033, 916, 357.3003, NULL),
(@entry, @id := @id+ 1, 791.4607, 908.041, 362.6729, NULL),
(@entry, @id := @id+ 1, 792.4047, 904.1388, 365.1732, NULL),
(@entry, @id := @id+ 1, 800.2216, 866.7416, 371.2193, NULL),
(@entry, @id := @id+ 1, 803.4233, 851.9974, 371.3574, NULL);

-- Corrupted Prison
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144563', 'spell_sha_of_pride_imprison');
DELETE FROM `spell_target_position` WHERE id in (144684, 144683, 144636, 144574);
INSERT INTO `spell_target_position` (`id`, `target_map`, `target_position_x`, `target_position_y`, `target_position_z`, `target_orientation`) VALUES 
('144684', '1136', '722.522', '1128.62', '357.246', '0'), --South
('144683', '1136', '773.23', '1096.34', '357.08', '0'),   --North
('144636', '1136', '764.125', '1137.76', '357.247', '0'), -- East
('144574', '1136', '731.763', '1087.03', '357.249', '0'); -- West
UPDATE `gameobject_template` SET `ScriptName` = 'go_sha_of_pride_corupted_prison' WHERE `entry` in (221678, 221676, 221677, 221679);
UPDATE `gameobject_template` SET `ScriptName` = 'go_sha_of_pride_corupted_prison_button' WHERE `entry` in (221753, 221751, 221752, 221758, 221759, 221757, 221755, 221750, 221754, 221761, 221760, 221756);

UPDATE `gameobject_template` SET `flags` = `flags` | 0x10 WHERE entry in (221678, 221753, 221751, 221752, 221676, 221758, 221759, 221757, 221677, 221755, 221750, 221754, 221679, 221761, 221760, 221756, 221446, 221447);

--
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144800', 'spell_sha_of_pride_self_reflection');

--
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144863', 'spell_sha_of_pride_self_overcome_mc');

--
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('146822', 'spell_sha_of_pride_projection');

--
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_rift_of_corruption', `flags_extra` = '0', `modelid2` = '47641', `faction_A` = '16', `faction_H` = '16', `minlevel` = '93', `maxlevel` = '93', unit_flags = 0x2 | 0x02000000 WHERE `entry` = 72846;
REPLACE INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `auras`) VALUES ('72846', '0', '0', '0', '0', '0', '147211');

DELETE FROM `areatrigger_data` WHERE entry = 1344;
INSERT INTO `areatrigger_data` (`entry`, `radius`, `radius2`, `activationDelay`, `updateDelay`, `maxCount`, `customVisualId`, `visualId`, `comment`) VALUES 
('1344', '2', '0', '0', '0', '0', '0', '0', 'OO:SHA OF PRIDE::Rift of Corruption');
--
DELETE FROM `conditions` WHERE `SourceEntry` = 144832;
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
(13, 1, 144832, 0, 0, 31, 0, 3, 71965, 0, 0, 0, '', NULL);
--
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144359', 'spell_sha_of_pride_gift_of_titans');
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144363', 'spell_sha_of_pride_gift_of_titans_ckecker');

--
REPLACE INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('144351', 'spell_sha_of_pride_mark_of_arrogance');

--
UPDATE `gameobject` SET `spawntimesecs` = '-7200' WHERE id = 221739;