-- 
DELETE FROM `quest_offer_reward_locale` WHERE `ID` IN (13, 28, 29) AND `locale`='ruRU';
INSERT INTO `quest_offer_reward_locale` (`ID`, `locale`, `RewardText`, `VerifiedBuild`) VALUES
(13,'ruRU','Ваша значимость для народного ополчения была подкреплена вашими смелыми действиями. ',18019),
(28,'ruRU','Что же, сдается мне, еще один друид успешно прошел Испытание Озера! Хвалю тебя, мой юный друг.$b%bКак я уже сказала, мое имя Таджарри. Мой долг и привилегия – оберегать Лунную поляны и, в особенности, это святилище. Хранитель Ремул наставляет Круг Кенария в деле сохранения природы и равновесия, а его святилище – мощный вклад в это дело. Использовав здесь безделушку, ты отдал дань уважения этому месту. ',18019),
(29,'ruRU','Что же, сдается мне, еще один друид успешно прошел Испытание Озера! Хвалю тебя, мой юный друг.$b%bКак я уже сказала, мое имя Таджарри. Мой долг и привилегия – оберегать Лунную поляны и, в особенности, это святилище. Хранитель Ремул наставляет Круг Кенария в деле сохранения природы и равновесия, а его святилище – мощный вклад в это дело. Использовав здесь безделушку, ты отдал дань уважения этому месту. ',18019);
