DELETE FROM `broadcast_text_locale` WHERE `VerifiedBuild`>0 AND `locale` = 'ruRU' AND `ID` IN (201778, 753, 195400, 79796, 165870, 79799, 79798, 79804, 194274, 183984, 201777, 79794, 79795, 141708, 201784, 165241, 165243, 165245, 165239, 165246, 165244, 165237);
INSERT INTO `broadcast_text_locale` (`ID`, `locale`, `Text_lang`, `Text1_lang`, `VerifiedBuild`) VALUES
(201778, 'ruRU', 'Мы готовы. Веди!', 'Мы готовы. Веди!', 35435),
(753, 'ruRU', 'Что? Хочешь сказать, что без меня не справишься?', '', 35435),
(195400, 'ruRU', 'Покажи мне искусственные сущности.', 'Покажи мне искусственные сущности.', 35435),
(79796, 'ruRU', 'Открыт камень шаманов: прикосновение пламени', 'Открыт камень шаманов: прикосновение пламени', 35435),
(165870, 'ruRU', '', 'Я расскажу тебе о гибели Растахана, когда захочешь послушать.', 35435),
(79799, 'ruRU', 'Открыт камень шаманов: стойкость огра', 'Открыт камень шаманов: стойкость огра', 35435),
(79798, 'ruRU', 'Открыт камень шаманов: бушующий ветер', 'Открыт камень шаманов: бушующий ветер', 35435),
(79804, 'ruRU', 'Открыт камень шаманов: прикосновение льда', 'Открыт камень шаманов: прикосновение льда', 35435),
(194274, 'ruRU', 'Я хочу телепортироваться в подземелье \"Операция \"Мехагон\".', 'Я хочу телепортироваться в подземелье \"Операция \"Мехагон\".', 35435),
(183984, 'ruRU', '|cfff2e699+$1i ед. здравомыслия|r', '|cfff2e699+$1i ед. здравомыслия|r', 35435),
(201777, 'ruRU', '', 'Я знаю, как добраться до дочери морей. Следуйте за мной.', 35435),
(79794, 'ruRU', 'Открыт камень шаманов: благословение волка', 'Открыт камень шаманов: благословение волка', 35435),
(79795, 'ruRU', 'Открыт камень шаманов: дух волка', 'Открыт камень шаманов: дух волка', 35435),
(141708, 'ruRU', 'Утомите грифона быстрым полетом. Не забывайте поддерживать эффект |TInterface\\ICONS\\INV_MISC_DESECRATED_LEATHERGLOVE.BLP:20|t |cFFFF0000|Hspell:269442|h[Крепкая хватка]|h|r!', '', 35435),
(201784, 'ruRU', 'Я сам видел: леди Джайну атакуют на море!', '', 35435),
(165241, 'ruRU', 'Ближе... Ближе...', 'Ближе... Ближе...', 35435),
(165243, 'ruRU', 'Наконец-то... примите истину тьмы.', 'Наконец-то... примите истину тьмы.', 35435),
(165245, 'ruRU', 'С каждым новым выбором вы все лучше служите мне.', 'С каждым новым выбором вы все лучше служите мне.', 35435),
(165239, 'ruRU', 'Заставьте ярость служить вам... Сделайте ненависть своим оружием.', 'Заставьте ярость служить вам... Сделайте ненависть своим оружием.', 35435),
(165246, 'ruRU', 'Взгляд бога обращает жалкие безделушки в прах.', 'Взгляд бога обращает жалкие безделушки в прах.', 35435),
(165244, 'ruRU', 'Да... вы все ближе... все ближе и ближе...', 'Да... вы все ближе... все ближе и ближе...', 35435),
(165237, 'ruRU', 'О... Вы думаете, что знаете, что такое настоящая сила.', 'О... Вы думаете, что знаете, что такое настоящая сила.', 35435);

DELETE FROM `gameobjects_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `gameobjects_locale` (`ID`, `locale`, `Name_lang`, `VerifiedBuild`) VALUES
(341828, 'ruRU', 'Мехагонский телепорт', 35435),
(341363, 'ruRU', 'Мехагонский телепорт', 35435),
(338477, 'ruRU', 'Мехагонский телепорт', 35435);

DELETE FROM `item_search_name_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `item_search_name_locale` (`ID`, `locale`, `Display_lang`, `VerifiedBuild`) VALUES
(87487, 'ruRU', 'Щит звонкого резонанса', 35435);

DELETE FROM `azerite_essence_power_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `azerite_essence_power_locale` (`ID`, `locale`, `SourceAlliance_lang`, `SourceHorde_lang`, `VerifiedBuild`) VALUES
(114, 'ruRU', 'Жуткие видения Н\'Зота|n|cFFFFD200Достижение:|r|n\"Сквозь глубины видений\"|n|cFFFFD200НИП:|r Гневион|n|cFFFFD200Зона:|r Зал Сердца', '', 35435),
(132, 'ruRU', 'Жуткие видения Н\'Зота|n|cFFFFD200Достижение:|r|n\"Сквозь глубины видений\"|n|cFFFFD200НИП:|r Гневион|n|cFFFFD200Зона:|r Зал Сердца', '', 35435),
(140, 'ruRU', 'Жуткие видения Н\'Зота|n|cFFFFD200Достижение:|r|n\"Сквозь глубины видений\"|n|cFFFFD200НИП:|r Гневион|n|cFFFFD200Зона:|r Зал Сердца', '', 35435);

DELETE FROM `currency_types_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `currency_types_locale` (`ID`, `locale`, `Name_lang`, `Description_lang`, `VerifiedBuild`) VALUES
(1803, 'ruRU', 'Эхо Ни\'алоты', 'МАТРИАРХ может использовать эту очищенную от порчи Н\'Зота субстанцию для создания искусственных сущностей в Зале Сердца.', 35435);

DELETE FROM `spell_name_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `spell_name_locale` (`ID`, `locale`, `Name_lang`, `VerifiedBuild`) VALUES
(324906, 'ruRU', 'Порча - Сумеречное разрушение 2', 35435),
(155343, 'ruRU', 'Камень шаманов: бушующий ветер', 35435),
(324845, 'ruRU', 'Порча - Эхо Бездны 3', 35435),
(304086, 'ruRU', 'Противостояние', 35435),
(154259, 'ruRU', 'Камень шаманов: дух волка', 35435),
(155313, 'ruRU', 'Камень шаманов: прикосновение пламени', 35435),
(154275, 'ruRU', 'Камень шаманов: дух волка', 35435),
(319451, 'ruRU', 'Телепорт в город Мехагон', 35435),
(324887, 'ruRU', 'Порча - Искаженный отросток 2', 35435),
(292907, 'ruRU', 'Пораженный порчей осколок льда', 35435),
(324900, 'ruRU', 'Порча - Сфокусированное сознание 2', 35435),
(296464, 'ruRU', 'Передатчик подкрепления', 35435),
(299937, 'ruRU', 'Передатчик подкрепления', 35435),
(324852, 'ruRU', 'Порча - Скорость 2', 35435),
(324892, 'ruRU', 'Порча - Прилив жизненной силы 1', 35435),
(324901, 'ruRU', 'Порча - Сфокусированное сознание 3', 35435),
(332950, 'ruRU', 'Fire Proc (DNT)', 35435),
(155345, 'ruRU', 'Камень шаманов: стойкость огра', 35435),
(301578, 'ruRU', 'REUSE ME', 35435),
(155315, 'ruRU', 'Камень шаманов: прикосновение пламени', 35435),
(324894, 'ruRU', 'Порча - Прилив жизненной силы 3', 35435),
(324888, 'ruRU', 'Порча - Искаженный отросток 3', 35435),
(324886, 'ruRU', 'Порча - Искаженный отросток 1', 35435),
(324890, 'ruRU', 'Порча - Бесконечные звезды 2', 35435),
(324881, 'ruRU', 'Порча - Вспышка ясности', 35435),
(337816, 'ruRU', 'Неизбежные последствия', 35435),
(301683, 'ruRU', 'REUSE ME', 35435),
(155347, 'ruRU', 'Камень шаманов: дух волка', 35435),
(324851, 'ruRU', 'Порча - Скорость 3', 35435),
(154274, 'ruRU', 'Камень шаманов: благословение волка', 35435),
(110556, 'ruRU', '[DNT] Force Cast Tried to Fly', 35435),
(324862, 'ruRU', 'Порча - Универсальность 1', 35435),
(300932, 'ruRU', 'REUSE ME [MTMM] (DNT)', 35435),
(155333, 'ruRU', 'Камень шаманов: прикосновение льда', 35435),
(291435, 'ruRU', 'Область здравомыслия', 35435),
(324853, 'ruRU', 'Порча - Скорость 1', 35435),
(324884, 'ruRU', 'Порча - Ритуал Бездны 2', 35435),
(324893, 'ruRU', 'Порча - Прилив жизненной силы 2', 35435),
(324854, 'ruRU', 'Порча - Преодоление защиты 3', 35435),
(293777, 'ruRU', 'Темное сокрушение', 35435),
(120679, 'ruRU', 'Ужасный зверь', 35435),
(274909, 'ruRU', 'Сгущающийся туман', 35435),
(300692, 'ruRU', 'REUSE ME [MTMM] (DNT)', 35435),
(324885, 'ruRU', 'Порча - Ритуал Бездны 3', 35435),
(155344, 'ruRU', 'Камень шаманов: бушующий ветер', 35435),
(335642, 'ruRU', 'Uber Strike', 35435),
(335148, 'ruRU', 'Знак Круговерти Пустоты', 35435),
(315958, 'ruRU', 'Телепорт в город Мехагон', 35435),
(327254, 'ruRU', 'Разлагающая спора - угроза', 35435),
(324839, 'ruRU', 'Порча - Смертоносный импульс 3', 35435),
(264663, 'ruRU', 'Жажда хищника', 35435),
(302166, 'ruRU', 'Передатчик подкрепления', 35435),
(293072, 'ruRU', 'Область здравомыслия', 35435),
(311204, 'ruRU', 'Перенеси меня в город Мехагон', 35435),
(324870, 'ruRU', 'Порча - Суровость 3', 35435),
(155334, 'ruRU', 'Камень шаманов: прикосновение льда', 35435),
(324902, 'ruRU', 'Порча - Кровоточащая рана', 35435),
(275496, 'ruRU', 'Неудержимое правосудие', 35435),
(316661, 'ruRU', 'Обсидиановое разрушение', 35435),
(324864, 'ruRU', 'Порча - Универсальность 2', 35435),
(321200, 'ruRU', 'Launch Quest', 35435),
(324904, 'ruRU', 'Порча - Невыразимая истина 2', 35435),
(154253, 'ruRU', 'Камень шаманов: благословение волка', 35435),
(331973, 'ruRU', '', 35435),
(325946, 'ruRU', 'Бросок слизи', 35435),
(324891, 'ruRU', 'Порча - Бесконечные звезды 3', 35435),
(321748, 'ruRU', 'Clone Me!', 35435),
(324882, 'ruRU', 'Порча - Ритуал Бездны 1', 35435),
(324860, 'ruRU', 'Порча - Искусность 2', 35435),
(324850, 'ruRU', 'Порча - Эхо Бездны 1', 35435),
(324899, 'ruRU', 'Порча - Сфокусированное сознание 1', 35435),
(294003, 'ruRU', 'Песнь искателя', 35435),
(313040, 'ruRU', 'Бесконечная тьма', 35435),
(324903, 'ruRU', 'Порча - Невыразимая истина 1', 35435),
(324680, 'ruRU', 'Порча - Смертоносный импульс 1', 35435),
(321201, 'ruRU', 'Launch Quest', 35435),
(155346, 'ruRU', 'Камень шаманов: стойкость огра', 35435),
(294479, 'ruRU', 'Выкапывание', 35435),
(325947, 'ruRU', 'Бросок слизи', 35435),
(328136, 'ruRU', 'Впечатляющая влиятельность', 35435),
(324861, 'ruRU', 'Порча - Искусность 1', 35435),
(300748, 'ruRU', 'REUSE ME [MTMM] (DNT)', 35435),
(335151, 'ruRU', 'Знак туманов', 35435),
(324879, 'ruRU', 'Порча - Вытягивание 2', 35435),
(256133, 'ruRU', 'REUSE ME [SCS]', 35435),
(324880, 'ruRU', 'Порча - Вытягивание 3', 35435),
(335152, 'ruRU', 'Знак железа', 35435),
(306259, 'ruRU', 'Щупальце', 35435),
(324858, 'ruRU', 'Порча - Искусность 3', 35435),
(321428, 'ruRU', 'Бремя бесконечности', 35435),
(335150, 'ruRU', 'Знак Разрушителя', 35435),
(324907, 'ruRU', 'Порча - Сумеречное разрушение 3', 35435),
(324889, 'ruRU', 'Порча - Бесконечные звезды 1', 35435),
(324898, 'ruRU', 'Порча - Учащенное сердцебиение 3', 35435),
(256134, 'ruRU', 'REUSE ME [SCS]', 35435),
(324875, 'ruRU', 'Порча - Избежание 2', 35435),
(324866, 'ruRU', 'Порча - Суровость 1', 35435),
(300798, 'ruRU', 'REUSE ME [MTMM] (DNT)', 35435),
(292579, 'ruRU', 'Кострище неподалеку', 35435),
(337612, 'ruRU', 'Неизбежные последствия', 35435),
(324877, 'ruRU', 'Порча - Вытягивание 1', 35435),
(324868, 'ruRU', 'Порча - Суровость 2', 35435),
(324837, 'ruRU', 'Порча - Смертоносный импульс 2', 35435),
(324848, 'ruRU', 'Порча - Эхо Бездны 2', 35435),
(115546, 'ruRU', 'Вызов', 35435),
(324895, 'ruRU', 'Порча - Избежание 1', 35435),
(324857, 'ruRU', 'Порча - Преодоление защиты 1', 35435),
(324897, 'ruRU', 'Порча - Учащенное сердцебиение 2', 35435),
(321714, 'ruRU', 'Телепортация в Силитус', 35435),
(324896, 'ruRU', 'Порча - Учащенное сердцебиение 1', 35435),
(324856, 'ruRU', 'Порча - Преодоление защиты 2', 35435),
(335149, 'ruRU', 'Знак Плети', 35435),
(324865, 'ruRU', 'Порча - Универсальность 3', 35435),
(324905, 'ruRU', 'Порча - Сумеречное разрушение 1', 35435),
(324874, 'ruRU', 'Порча - Избежание 3', 35435);

DELETE FROM `criteria_tree_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `criteria_tree_locale` (`ID`, `locale`, `Description_lang`, `VerifiedBuild`) VALUES
(85118, 'ruRU', '', 35435),
(85126, 'ruRU', '', 35435),
(85114, 'ruRU', '', 35435),
(85084, 'ruRU', '', 35435),
(85132, 'ruRU', '', 35435),
(85098, 'ruRU', '', 35435),
(85134, 'ruRU', '', 35435),
(85025, 'ruRU', 'Южнобережье против Мельницы Таррен', 35435),
(85128, 'ruRU', '', 35435),
(84755, 'ruRU', 'Завершите цепочку заданий, связанных с легендарным плащом', 35435),
(85090, 'ruRU', '', 35435),
(85130, 'ruRU', '', 35435),
(84814, 'ruRU', 'Игрок может получить традиционные доспехи ночнорожденных', 35435),
(85100, 'ruRU', '', 35435),
(85136, 'ruRU', '', 35435),
(85102, 'ruRU', '', 35435),
(85138, 'ruRU', '', 35435),
(84815, 'ruRU', 'Игрок может получить традиционные доспехи маг\'харов', 35435),
(85108, 'ruRU', '', 35435),
(85110, 'ruRU', '', 35435),
(85116, 'ruRU', '', 35435),
(84812, 'ruRU', 'Игрок может получить традиционные доспехи механогномов', 35435),
(78565, 'ruRU', 'Идеально синхронизированный дифференциал', 35435),
(34935, 'ruRU', 'Получите благословение камня шаманов: дух волка', 35435),
(82623, 'ruRU', 'Зачистите город Мехагон', 35435),
(84810, 'ruRU', 'Игрок может получить традиционные доспехи дворфов из клана Черного Железа', 35435),
(84809, 'ruRU', 'Игрок может получить традиционные доспехи эльфов Бездны', 35435),
(85096, 'ruRU', '', 35435),
(85092, 'ruRU', '', 35435),
(84816, 'ruRU', 'Игрок может получить традиционные доспехи зандаларов', 35435),
(85122, 'ruRU', '', 35435),
(84808, 'ruRU', 'Игрок может получить традиционные доспехи тауренов Крутогорья', 35435),
(85120, 'ruRU', '', 35435),
(85112, 'ruRU', '', 35435),
(84813, 'ruRU', 'Игрок может получить традиционные доспехи вульпер', 35435),
(85124, 'ruRU', '', 35435),
(85088, 'ruRU', '', 35435),
(85094, 'ruRU', '', 35435),
(85086, 'ruRU', '', 35435),
(85106, 'ruRU', '', 35435),
(84817, 'ruRU', 'Игрок может получить традиционные доспехи култирасцев', 35435),
(85104, 'ruRU', '', 35435),
(84811, 'ruRU', 'Игрок может получить традиционные доспехи озаренных дренеев', 35435);

DELETE FROM `item_name_description_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `item_name_description_locale` (`ID`, `locale`, `Description_lang`, `VerifiedBuild`) VALUES
(13566, 'ruRU', '35 ед. порчи', 35435),
(13578, 'ruRU', '16 ед. порчи', 35435),
(13569, 'ruRU', '10 ед. порчи', 35435),
(13574, 'ruRU', '28 ед. порчи', 35435),
(13572, 'ruRU', '25 ед. порчи', 35435),
(13520, 'ruRU', '30 ед. порчи', 35435),
(13579, 'ruRU', '8 ед. порчи', 35435),
(13516, 'ruRU', '5 ед. порчи', 35435),
(13568, 'ruRU', '20 ед. порчи', 35435),
(13521, 'ruRU', '5-30 ед. порчи', 35435),
(13576, 'ruRU', '30 ед. порчи', 35435),
(13518, 'ruRU', '15 ед. порчи', 35435),
(13519, 'ruRU', '20 ед. порчи', 35435),
(13577, 'ruRU', '12 ед. порчи', 35435),
(13575, 'ruRU', '17 ед. порчи', 35435),
(13570, 'ruRU', '75 ед. порчи', 35435),
(13565, 'ruRU', '66 ед. порчи', 35435),
(13513, 'ruRU', '25 ед. порчи', 35435),
(13580, 'ruRU', '60 ед. порчи', 35435),
(13517, 'ruRU', '10 ед. порчи', 35435),
(13571, 'ruRU', '50 ед. порчи', 35435),
(13573, 'ruRU', '45 ед. порчи', 35435),
(13567, 'ruRU', '15 ед. порчи', 35435);

DELETE FROM `area_table_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `area_table_locale` (`ID`, `locale`, `AreaName_lang`, `VerifiedBuild`) VALUES
(12825, 'ruRU', 'Город Мехагон', 35435),
(10290, 'ruRU', 'Мехагон', 35435);

DELETE FROM `ui_map_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `ui_map_locale` (`ID`, `locale`, `Name_lang`, `VerifiedBuild`) VALUES
(1574, 'ruRU', 'Город Мехагон', 35435),
(1573, 'ruRU', 'Город Мехагон', 35435);

DELETE FROM `item_sparse_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `item_sparse_locale` (`ID`, `locale`, `Description_lang`, `Display3_lang`, `Display2_lang`, `Display1_lang`, `Display_lang`, `VerifiedBuild`) VALUES
(177977, 'ruRU', '', '', '', '', 'Консервированная отрава: Кровоточащая рана', 35435),
(177997, 'ruRU', '', '', '', '', 'Консервированная отрава: Вытягивание', 35435),
(178006, 'ruRU', '', '', '', '', 'Консервированная отрава: Сумеречное разрушение', 35435),
(177974, 'ruRU', '', '', '', '', 'Консервированная отрава: Скорость', 35435),
(177976, 'ruRU', '', '', '', '', 'Консервированная отрава: Вспышка ясности', 35435),
(178015, 'ruRU', '', '', '', '', 'Консервированная отрава: Ритуал Бездны', 35435),
(178012, 'ruRU', '', '', '', '', 'Консервированная отрава: Универсальность', 35435),
(87487, 'ruRU', '', '', '', '', 'Щит звонкого резонанса', 35435),
(177983, 'ruRU', '', '', '', '', 'Консервированная отрава: Бесконечные звезды', 35435),
(177980, 'ruRU', '', '', '', '', 'Консервированная отрава: Сфокусированное сознание', 35435),
(178004, 'ruRU', '', '', '', '', 'Консервированная отрава: Сумеречное разрушение', 35435),
(177987, 'ruRU', '', '', '', '', 'Консервированная отрава: Искусность', 35435),
(177965, 'ruRU', '', '', '', '', 'Консервированная отрава: Смертоносный импульс', 35435),
(177989, 'ruRU', '', '', '', '', 'Консервированная отрава: Учащенное сердцебиение', 35435),
(177998, 'ruRU', '', '', '', '', 'Консервированная отрава: Преодоление защиты', 35435),
(178011, 'ruRU', '', '', '', '', 'Консервированная отрава: Универсальность', 35435),
(177993, 'ruRU', '', '', '', '', 'Консервированная отрава: Суровость', 35435),
(177978, 'ruRU', '', '', '', '', 'Консервированная отрава: Сфокусированное сознание', 35435),
(178002, 'ruRU', '', '', '', '', 'Консервированная отрава: Прилив жизненной силы', 35435),
(177967, 'ruRU', '', '', '', '', 'Консервированная отрава: Эхо Бездны', 35435),
(177970, 'ruRU', '', '', '', '', 'Консервированная отрава: Избежание', 35435),
(177972, 'ruRU', '', '', '', '', 'Консервированная отрава: Избежание', 35435),
(177992, 'ruRU', '', '', '', '', 'Консервированная отрава: Суровость', 35435),
(177985, 'ruRU', '', '', '', '', 'Консервированная отрава: Бесконечные звезды', 35435),
(177982, 'ruRU', '', '', '', '', 'Консервированная отрава: Невыразимая истина', 35435),
(177991, 'ruRU', '', '', '', '', 'Консервированная отрава: Учащенное сердцебиение', 35435),
(177971, 'ruRU', '', '', '', '', 'Консервированная отрава: Избежание', 35435),
(168043, 'ruRU', 'Высоко ценится среди аматетов, которые считают себя хранителями наследия титанов.', '', '', '', 'Артефакт титанов', 35435),
(177964, 'ruRU', '', '', '', '', 'Enchant Weapon - Force Multiplier', 35435),
(177986, 'ruRU', '', '', '', '', 'Консервированная отрава: Искусность', 35435),
(178013, 'ruRU', '', '', '', '', 'Консервированная отрава: Ритуал Бездны', 35435),
(177994, 'ruRU', '', '', '', '', 'Консервированная отрава: Суровость', 35435),
(178009, 'ruRU', '', '', '', '', 'Консервированная отрава: Искаженный отросток', 35435),
(173937, 'ruRU', 'Этот глаз чувствует, когда вы на него смотрите, и всегда смотрит на вас в ответ.', '', '', '', 'Отсеченное око', 35435),
(177973, 'ruRU', '', '', '', '', 'Консервированная отрава: Скорость', 35435),
(178007, 'ruRU', '', '', '', '', 'Консервированная отрава: Искаженный отросток', 35435),
(177981, 'ruRU', '', '', '', '', 'Консервированная отрава: Невыразимая истина', 35435),
(178003, 'ruRU', '', '', '', '', 'Консервированная отрава: Прилив жизненной силы', 35435),
(177979, 'ruRU', '', '', '', '', 'Консервированная отрава: Сфокусированное сознание', 35435),
(177966, 'ruRU', '', '', '', '', 'Консервированная отрава: Смертоносный импульс', 35435),
(177999, 'ruRU', '', '', '', '', 'Консервированная отрава: Преодоление защиты', 35435),
(178010, 'ruRU', '', '', '', '', 'Консервированная отрава: Универсальность', 35435),
(177969, 'ruRU', '', '', '', '', 'Консервированная отрава: Эхо Бездны', 35435),
(178000, 'ruRU', '', '', '', '', 'Консервированная отрава: Преодоление защиты', 35435),
(177975, 'ruRU', '', '', '', '', 'Консервированная отрава: Скорость', 35435),
(178001, 'ruRU', '', '', '', '', 'Консервированная отрава: Прилив жизненной силы', 35435),
(178008, 'ruRU', '', '', '', '', 'Консервированная отрава: Искаженный отросток', 35435),
(177995, 'ruRU', '', '', '', '', 'Консервированная отрава: Вытягивание', 35435),
(177968, 'ruRU', '', '', '', '', 'Консервированная отрава: Эхо Бездны', 35435),
(177955, 'ruRU', '', '', '', '', 'Консервированная отрава: Смертоносный импульс', 35435),
(177988, 'ruRU', '', '', '', '', 'Консервированная отрава: ИскусностьI', 35435),
(177996, 'ruRU', '', '', '', '', 'Консервированная отрава: Вытягивание', 35435),
(177984, 'ruRU', '', '', '', '', 'Консервированная отрава: Бесконечные звезды', 35435),
(178014, 'ruRU', '', '', '', '', 'Консервированная отрава: Ритуал Бездны', 35435),
(177990, 'ruRU', '', '', '', '', 'Консервированная отрава: Учащенное сердцебиение', 35435),
(178005, 'ruRU', '', '', '', '', 'Консервированная отрава: Сумеречное разрушение', 35435),
(141057, 'ruRU', 'Обучает начертанию символа вспышки.', '', '', '', 'Техника: символ вспышки', 35435),
(139412, 'ruRU', '', '', '', '', 'Молодые боевые черепахи-мутанты', 35435),
(139345, 'ruRU', '', '', '', '', 'Крысиные лапки', 35435),
(139411, 'ruRU', '', '', '', '', 'Банкет в Клоаке', 35435),
(137826, 'ruRU', 'Обучает изготовлению волшебной подвески из темного рубина.', '', '', '', 'Эскиз: волшебная подвеска из темного рубина', 35435),
(138016, 'ruRU', 'Обучает изготовлению сундука с одеждой: жители Даларана.', '', '', '', 'Выкройка: сундук с одеждой: жители Даларана', 35435),
(137932, 'ruRU', 'Обучает изготовлению горящего обруча.', '', '', '', 'Рецепт: горящий обруч', 35435),
(137954, 'ruRU', 'Обучает изготовлению кушака из шелкового полотна.', '', '', '', 'Выкройка: кушак из шелкового полотна', 35435),
(137901, 'ruRU', 'Обучает изготовлению скованного битвой ремня.', '', '', '', 'Рецепт: скованный битвой ремень', 35435),
(137881, 'ruRU', 'Обучает изготовлению пояса из выдубленной войной кожи.', '', '', '', 'Рецепт: пояс из выдубленной войной кожи', 35435),
(139344, 'ruRU', '', '', '', '', 'Банан маны', 35435),
(139347, 'ruRU', '', '', '', '', 'Желе Клоаки Даларана', 35435),
(137706, 'ruRU', 'Обучает изготовлению порохового заряда.', '', '', '', 'Схема: пороховой заряд', 35435),
(137962, 'ruRU', 'Обучает изготовлению кушака из шелкового полотна.', '', '', '', 'Выкройка: кушак из шелкового полотна', 35435),
(137829, 'ruRU', 'Обучает изготовлению изящной подвески из темного рубина.', '', '', '', 'Эскиз: изящная подвеска из темного рубина', 35435),
(137913, 'ruRU', 'Обучает изготовлению скованного битвой ремня.', '', '', '', 'Рецепт: скованный битвой ремень', 35435),
(137917, 'ruRU', 'Обучает изготовлению инкрустированного чешуйками ремня.', '', '', '', 'Рецепт: инкрустированный чешуйками ремень', 35435),
(139431, 'ruRU', '', '', '', '', 'Ящик с упряжью для крысоконей', 35435),
(141065, 'ruRU', 'Обучает начертанию символа стражника жути.', '', '', '', 'Техника: символ стражника жути', 35435),
(137885, 'ruRU', 'Обучает изготовлению пояса из кожи ужаса.', '', '', '', 'Рецепт: пояс из кожи ужаса', 35435),
(137869, 'ruRU', 'Обучает изготовлению пояса из выдубленной войной кожи.', '', '', '', 'Рецепт: пояс из выдубленной войной кожи', 35435),
(127918, 'ruRU', 'Обучает более эффективным методам изготовления древнего зелья маны.', '', '', '', 'Рецепт: древнее зелье маны', 35435),
(139422, 'ruRU', '', '', '', '', 'Измельченная приманка Скверны', 35435),
(141058, 'ruRU', 'Обучает начертанию символа сглаза зверьков.', '', '', '', 'Техника: символ сглаза зверьков', 35435),
(141038, 'ruRU', 'Обучает начертанию символа взора Тьмы.', '', '', '', 'Техника: символ взора Тьмы', 35435),
(139346, 'ruRU', '', '', '', '', 'Запатентованный напиток Туни', 35435),
(137934, 'ruRU', 'Обучает изготовлению кожаного поводка для питомца.', '', '', '', 'Рецепт: кожаный поводок для питомца', 35435),
(137831, 'ruRU', 'Обучает изготовлению колье из пандемонита злопамятности.', '', '', '', 'Эскиз: колье из пандемонита злопамятности', 35435),
(139425, 'ruRU', '', '', '', '', 'Контракт с бесом', 35435),
(141850, 'ruRU', 'Обучает изготовлению упряжи ездового старорога.', '', '', '', 'Рецепт: упряжь ездового старорога', 35435),
(137966, 'ruRU', 'Обучает изготовлению кушака из прочного шелкового полотна.', '', '', '', 'Выкройка: кушак из прочного шелкового полотна', 35435);

DELETE FROM `mount_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `mount_locale` (`ID`, `locale`, `Name_lang`, `SourceText_lang`, `Description_lang`, `VerifiedBuild`) VALUES
(468, 'ruRU', 'Императорский цийлинь', '|cFFFFD200Промоакция:|r коллекционное издание Mists of Pandaria', 'Любимцы древних правителей могу, цийлини станут верным и бесстрашным компаньоном любому наезднику.', 35435),
(1282, 'ruRU', 'Черный змей Н\'Зота', '|cFFFFD200Достижение:|r \"Сквозь глубины видений\"', 'Черные змеи Н\'Зота возвещают о скором осуществлении планов Древнего бога. Поймать такого змея способны только те служители или враги Н\'Зота, кто может войти в его видения.', 35435);

DELETE FROM `player_condition_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `player_condition_locale` (`ID`, `locale`, `FailureDescription_lang`, `VerifiedBuild`) VALUES
(79509, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Ржавоболтского сопротивления, другим персонажем, чтобы открыть эту сущность.', 35435),
(79518, 'ruRU', 'Изучите \"Раздор и противостояние\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79511, 'ruRU', 'Изучите \"Концентрированную жизненную силу\", \"Проводник жизненной силы\" или \"Дар жизни Азерот\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79508, 'ruRU', 'Изучите \"Кровь врага\", \"Обман времени\" или \"Сферу подавления\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79523, 'ruRU', 'Изучите \"Бесформенную Бездну\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(74078, 'ruRU', 'Требуется Ашжра\'камас, Покров Решимости.', 35435),
(79512, 'ruRU', 'Изучите \"Видение совершенства\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79505, 'ruRU', 'Изучите \"Пространственную рябь\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79499, 'ruRU', 'Изучите \"Сущность радужного кристалла\", \"Чары Хранительницы жизни\" или \"Сущность жизни и смерти\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79522, 'ruRU', 'Изучите любую сущность 3-го уровня из жутких видений другим персонажем, чтобы открыть эту сущность.', 35435),
(79514, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Раджани или Ульдумского союза, другим персонажем, чтобы открыть эту сущность.', 35435),
(75180, 'ruRU', 'Требуется достижение \"Сквозь глубины видений\" и сущность 3-го уровня. (Покупка невозможна, если талант уже открыт.)', 35435),
(79516, 'ruRU', 'Изучите \"Воспоминания о снах наяву\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79519, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Раджани или Ульдумского союза, другим персонажем, чтобы открыть эту сущность.', 35435),
(79504, 'ruRU', 'Изучите \"Концентрированную жизненную силу\", \"Проводник жизненной силы\" или \"Дар жизни Азерот\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(75170, 'ruRU', 'Требуется достижение \"Сквозь глубины видений\" и сущность 3-го уровня. (Покупка невозможна, если талант уже открыт.)', 35435),
(79513, 'ruRU', 'Изучите \"Кровь врага\", \"Обман времени\" или \"Сферу подавления\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79502, 'ruRU', 'Изучите \"Раскаленный тигель\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79501, 'ruRU', 'Изучите \"Сущность радужного кристалла\", \"Чары Хранительницы жизни\" или \"Сущность жизни и смерти\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79486, 'ruRU', 'Изучите \"Концентрированную жизненную силу\", \"Проводник жизненной силы\" или \"Дар жизни Азерот\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79515, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную за репутацию среди назжатарских фракций, другим персонажем, чтобы открыть эту сущность.', 35435),
(79510, 'ruRU', 'Изучите \"Сущность радужного кристалла\", \"Чары Хранительницы жизни\" или \"Сущность жизни и смерти\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79497, 'ruRU', 'Изучите \"Кровь врага\", \"Обман времени\" или \"Сферу подавления\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79521, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Раджани или Ульдумского союза, другим персонажем, чтобы открыть эту сущность.', 35435),
(75191, 'ruRU', 'Требуется достижение \"Сквозь глубины видений\" и сущность 3-го уровня. (Покупка невозможна, если талант уже открыт.)', 35435),
(79506, 'ruRU', 'Изучите любую сущность 3-го уровня из жутких видений другим персонажем, чтобы открыть эту сущность.', 35435),
(79500, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Ржавоболтского сопротивления, другим персонажем, чтобы открыть эту сущность.', 35435),
(79503, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную от Ржавоболтского сопротивления, другим персонажем, чтобы открыть эту сущность.', 35435),
(79498, 'ruRU', 'Изучите \"Резонанс крови мира\" 3-го уровня другим персонажем, чтобы открыть эту сущность.', 35435),
(79507, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную за репутацию среди назжатарских фракций, другим персонажем, чтобы открыть эту сущность.', 35435),
(79517, 'ruRU', 'Изучите любую сущность 3-го уровня, полученную за репутацию среди назжатарских фракций, другим персонажем, чтобы открыть эту сущность.', 35435),
(79520, 'ruRU', 'Изучите любую сущность 3-го уровня из жутких видений другим персонажем, чтобы открыть эту сущность.', 35435);

DELETE FROM `map_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `map_locale` (`ID`, `locale`, `MapName_lang`, `MapDescription0_lang`, `MapDescription1_lang`, `PvpShortDescription_lang`, `PvpLongDescription_lang`, `VerifiedBuild`) VALUES
(2268, 'ruRU', 'Город Мехагон', '', '', '', '', 35435);

DELETE FROM `wmo_area_table_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `wmo_area_table_locale` (`ID`, `locale`, `AreaName_lang`, `VerifiedBuild`) VALUES
(103067, 'ruRU', 'Город Мехагон', 35435);

DELETE FROM `achievement_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `achievement_locale` (`ID`, `locale`, `Description_lang`, `Title_lang`, `Reward_lang`, `VerifiedBuild`) VALUES
(14260, 'ruRU', '', '', '', 35435),
(14251, 'ruRU', '', '', '', 35435),
(14256, 'ruRU', '', '', '', 35435),
(14263, 'ruRU', '', '', '', 35435),
(14250, 'ruRU', '', '', '', 35435),
(14241, 'ruRU', '', '', '', 35435),
(14246, 'ruRU', '', '', '', 35435),
(14244, 'ruRU', '', '', '', 35435),
(14264, 'ruRU', '', '', '', 35435),
(6980, 'ruRU', 'Захватите четыре сферы могущества и победите четырех противников, обладающих сферой могущества, в ходе одного сражения в храме Котмогу.', 'Звезда храма Котмогу', '', 35435),
(14258, 'ruRU', '', '', '', 35435),
(14249, 'ruRU', '', '', '', 35435),
(14254, 'ruRU', '', '', '', 35435),
(14252, 'ruRU', '', '', '', 35435),
(14212, 'ruRU', '', '<Hidden> 8.3 Main Line - Account Has Obtained Legendary Cloak (DNT)', '', 35435),
(14245, 'ruRU', '', '', '', 35435),
(14242, 'ruRU', '', '', '', 35435),
(14257, 'ruRU', '', '', '', 35435),
(14255, 'ruRU', '', '', '', 35435),
(14248, 'ruRU', '', '', '', 35435),
(14259, 'ruRU', '', '', '', 35435),
(14261, 'ruRU', '', '', '', 35435),
(14265, 'ruRU', '', '', '', 35435),
(14247, 'ruRU', '', '', '', 35435),
(14240, 'ruRU', '', '', '', 35435),
(14238, 'ruRU', '', 'Azerite Essence - Rank 3 on any character - Azeroth\'s Undying Gift <DND>', '', 35435),
(14253, 'ruRU', '', '', '', 35435),
(14262, 'ruRU', '', '', '', 35435),
(14239, 'ruRU', '', '', '', 35435),
(14243, 'ruRU', '', '', '', 35435);

DELETE FROM `mail_template_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `mail_template_locale` (`ID`, `locale`, `Body_lang`, `VerifiedBuild`) VALUES
(550, 'ruRU', 'Чтобы возобновить вашу подписку, нам пришлось использовать часть золота, остававшегося в вашем почтовом ящике. Из-за этого вы можете обнаружить, что вам пришло меньше золота, чем вы ожидали – не беспокойтесь, оно не пропало.\nСпасибо и с возвращением в Азерот!\n - Команда разработчиков WoW', 35435);

DELETE FROM `dungeon_encounter_locale` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `dungeon_encounter_locale` (`ID`, `locale`, `Name_lang`, `VerifiedBuild`) VALUES
(786, 'ruRU', 'Верховная жрица Мар\'ли', 35435);


DELETE FROM `hotfix_blob` WHERE `locale` = 'ruRU' AND `VerifiedBuild`>0;
INSERT INTO `hotfix_blob` (`TableHash`, `RecordId`, `locale`, `Blob`, `VerifiedBuild`) VALUES
(3386943305, 195997, 'ruRU', 0x0778781000B20200000400081000000000000000000000000000000001000000000000000097A80200, 35435), -- CreatureDifficulty
(600565378, 267260, 'ruRU', 0xE56501000000803F6666A63F0093A80200, 35435), -- CreatureXDisplayInfo
(600565378, 267271, 'ruRU', 0xB46501000000803F0000803F009BA80200, 35435), -- CreatureXDisplayInfo
(3386291891, 174231, 'ruRU', 0xD097D0B0D0BDD18827D0B8D1802DD0BCD0B8D180D0BCD0B8D0B4D0BED0BD000000000007000000E56501000000000000000000000000000000803F0000803F0000803F0000803F879402000000000000000000, 35435), -- Creature
(600565378, 267266, 'ruRU', 0xE56501000000803F6666A63F0097A80200, 35435), -- CreatureXDisplayInfo
(600565378, 267274, 'ruRU', 0xEA6501000000803F9A99993F009EA80200, 35435), -- CreatureXDisplayInfo
(813076512, 22908, 'ruRU', 0x760000002B2F0300, 35435), -- SpellLabel
(813076512, 22909, 'ruRU', 0x240100002B2F0300, 35435), -- SpellLabel
(3776013982, 324874, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F5741524C4F434B5F44454D4F4E534F554C2E424C503A32347C74207C634646464646464646D098D0B7D0B1D0B5D0B6D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353630390000, 35435), -- Spell
(3776013982, 324905, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F5072696573745F566F6964536561722E626C703A32347C74207C634646464646464646D0A1D183D0BCD0B5D180D0B5D187D0BDD0BED0B520D180D0B0D0B7D180D183D188D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383237360000, 35435), -- Spell
(3776013982, 324865, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F415243414E455F415243414E45544143544943532E424C503A32347C74207C634646464646464646D0A3D0BDD0B8D0B2D0B5D180D181D0B0D0BBD18CD0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353535330000, 35435), -- Spell
(3776013982, 335149, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8205772617468206F6620746865204C696368204B696E672C20D0BDD0B020247331252E007C634646303041413939D091D0BED0BDD183D181D0BDD0BED0B520D181D0BED0B1D18BD182D0B8D0B53A20D0BFD183D182D0B5D188D0B5D181D182D0B2D0B8D0B520D0B2D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B820285772617468206F6620746865204C696368204B696E67297C720D0A0D0AD09ED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8205772617468206F6620746865204C696368204B696E672C20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 35435), -- Spell
(3776013982, 324856, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F50524F46455353494F4E5F46495348494E475F46494E44464953482E424C503A32347C74207C634646464646464646D09FD180D0B5D0BED0B4D0BED0BBD0B5D0BDD0B8D0B520D0B7D0B0D189D0B8D182D18B7C720D0A24407370656C6C646573633331353238310000, 35435), -- Spell
(3776013982, 324896, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F57415252494F525F424C4F4F444652454E5A592E424C503A32347C74207C634646464646464646D0A3D187D0B0D189D0B5D0BDD0BDD0BED0B520D181D0B5D180D0B4D186D0B5D0B1D0B8D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383236360000, 35435), -- Spell
(3776013982, 321714, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324897, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F57415252494F525F424C4F4F444652454E5A592E424C503A32347C74207C634646464646464646D0A3D187D0B0D189D0B5D0BDD0BDD0BED0B520D181D0B5D180D0B4D186D0B5D0B1D0B8D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383439320000, 35435), -- Spell
(2230237587, 1188, 'ruRU', 0xD093D0BED180D0BED0B420D09CD0B5D185D0B0D0B3D0BED0BD0096010000250600000000000000, 35435), -- UiMapGroupMember
(3776013982, 324857, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F50524F46455353494F4E5F46495348494E475F46494E44464953482E424C503A32347C74207C634646464646464646D09FD180D0B5D0BED0B4D0BED0BBD0B5D0BDD0B8D0B520D0B7D0B0D189D0B8D182D18B7C720D0A24407370656C6C646573633331353237370000, 35435), -- Spell
(3776013982, 324895, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F5741524C4F434B5F44454D4F4E534F554C2E424C503A32347C74207C634646464646464646D098D0B7D0B1D0B5D0B6D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353630370000, 35435), -- Spell
(3776013982, 115546, 'ruRU', 0x00D092D18B20D0BDD0B0D181D0BCD0B5D185D0B0D0B5D182D0B5D181D18C20D0BDD0B0D0B420D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0BED0BC2C20D0BFD0BED181D0BBD0B520D187D0B5D0B3D0BE20D0BED0BD20D18120D0BFD0BED0B2D18BD188D0B5D0BDD0BDD0BED0B920D0BDD0B020243131363138396D332520D181D0BAD0BED180D0BED181D182D18CD18E20D0B1D180D0BED181D0B0D0B5D182D181D18F20D0BA20D0B2D0B0D0BC2E243F733131353331355B0D0A0D0AD095D181D0BBD0B820D186D0B5D0BBD18C20E2809320D0B2D0B0D188D0B020D181D182D0B0D182D183D18F20D0A7D0B5D180D0BDD0BED0B3D0BE20D091D18BD0BAD0B02C20D18DD184D184D0B5D0BAD18220D0B4D0B5D0B9D181D182D0B2D183D0B5D18220D0BDD0B020D0B2D181D0B5D18520D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0BED0B220D0B220D180D0B0D0B4D0B8D183D181D0B52024313138363335413120D0BC20D0BED18220D181D182D0B0D182D183D0B82E5D5B5D0000, 35435), -- Spell
(3776013982, 324848, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F5072696573745F566F6964456E74726F70792E626C703A32347C74207C634646464646464646D0ADD185D0BE20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383438350000, 35435), -- Spell
(3776013982, 324837, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F48756E7465725F526170746F72537472696B652E626C703A32347C74207C634646464646464646D0A1D0BCD0B5D180D182D0BED0BDD0BED181D0BDD18BD0B920D0B8D0BCD0BFD183D0BBD18CD1817C720D0A24407370656C6C646573633331383439330000, 35435), -- Spell
(3776013982, 324868, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F5052494553545F534841444F575941505041524954494F4E2E424C503A32347C74207C634646464646464646D0A1D183D180D0BED0B2D0BED181D182D18C7C720D0A24407370656C6C646573633331353535370000, 35435), -- Spell
(3776013982, 324877, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F536861646F775F4C696665447261696E30325F707572706C652E626C703A32347C74207C634646464646464646D092D18BD182D18FD0B3D0B8D0B2D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353539300000, 35435), -- Spell
(3205218938, 41793, 'ruRU', 0x4755494C445F46494E4445525F504F5354494E475F4558504952454400D0A1D180D0BED0BA20D0BFD183D0B1D0BBD0B8D0BAD0B0D186D0B8D0B820D0BE20D0BFD0BED0B8D181D0BAD0B520D0B3D0B8D0BBD18CD0B4D0B8D0B820D0B8D181D182D0B5D0BA210001, 35435), -- GlobalStrings
(3776013982, 337612, 'ruRU', 0x00D09D27D097D0BED18220D0BFD0BED0B4D187D0B8D0BDD18FD0B5D18220D181D0B5D0B1D0B520D181D0B0D0BCD18320D0B2D0B0D188D18320D181D183D189D0BDD0BED181D182D18C2C20D0BED182D0BDD0B8D0BCD0B0D18F202473312520D0BCD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD0BED0B3D0BE20D0B7D0B0D0BFD0B0D181D0B020D0B7D0B4D0BED180D0BED0B2D18CD18F20D180D0B0D0B720D0B22024743120D181D0B5D0BA2E2C20D0BFD0BED0BAD0B020D0B2D18B20D0BDD0B0D185D0BED0B4D0B8D182D0B5D181D18C20D0B220D0B1D0BED18E2E20D09AD0BED0BDD0B5D18620D0B1D0BBD0B8D0B7D0BED0BA2E00D09ED182D0BDD0B8D0BCD0B0D0B5D182202477312520D0BCD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD0BED0B3D0BE20D0B7D0B0D0BFD0B0D181D0B020D0B7D0B4D0BED180D0BED0B2D18CD18F20D180D0B0D0B720D0B22024743120D181D0B5D0BA2E2C20D0BFD0BED0BAD0B020D0B2D18B20D0BDD0B0D185D0BED0B4D0B8D182D0B5D181D18C20D0B220D0B1D0BED18E2E00, 35435), -- Spell
(3776013982, 292579, 'ruRU', 0x00D095D181D0BBD0B820D180D18FD0B4D0BED0BC20D0B5D181D182D18C20D0BAD0BED181D182D180D0B8D189D0B52C20D0B8D181D0BAD0B0D182D0B5D0BBD0B820D0BFD180D0B8D0BAD0BBD18ED187D0B5D0BDD0B8D0B920D0BCD0BED0B3D183D18220D180D0B0D0B7D0B6D0B5D187D18C20D0BDD0B020D0BDD0B5D0BC20D0BED0B3D0BED0BDD18C2E00D095D181D0BBD0B820D180D18FD0B4D0BED0BC20D0B5D181D182D18C20D0BAD0BED181D182D180D0B8D189D0B52C20D0B8D181D0BAD0B0D182D0B5D0BBD0B820D0BFD180D0B8D0BAD0BBD18ED187D0B5D0BDD0B8D0B920D0BCD0BED0B3D183D18220D180D0B0D0B7D0B6D0B5D187D18C20D0BDD0B020D0BDD0B5D0BC20D0BED0B3D0BED0BDD18C2E00, 35435), -- Spell
(2230237587, 1162, 'ruRU', 0xD093D0BED180D0BED0B420D09CD0B5D185D0B0D0B3D0BED0BD008F010000D90500000400000000, 35435), -- UiMapGroupMember
(2035710060, 7072, 'ruRU', 0xD0A2D0B5D0BCD0BDD18BD0B920D0B4D183D18520D0BBD0BED0B000D092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B820D0B8D181D0BFD0BED0BBD18CD0B7D183D0B5D18220D18DD182D18320D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D18C2C20D0BDD0B0D185D0BED0B4D18FD181D18C20D0BFD0BED0B420D0BAD0BED0BDD182D180D0BED0BBD0B5D0BC20D094D183D185D0B020D093D0B0D180D0B027D0B4D0B6D0B0D0BBD0B02E0D0A0D0AD096D180D0B8D186D0B020D0BFD180D0B8D0B7D18BD0B2D0B0D0B5D18220D0BA20D181D0B5D0B1D0B520D182D0B5D0BCD0BDD18BD0B920D0B4D183D18520D0BBD0BED0B02E20D094D183D18520D0B2D18BD0B1D0B8D180D0B0D0B5D18220D181D0B2D0BED0B5D0B920D186D0B5D0BBD18CD18E20D181D0BBD183D187D0B0D0B9D0BDD0BED0B3D0BE20D0B8D0B3D180D0BED0BAD0B020D0B820D0BFD180D0B5D181D0BBD0B5D0B4D183D0B5D18220D0B5D0B3D0BE20D0B220D182D0B5D187D0B5D0BDD0B8D0B52024313337333935642E2C20D0BCD0BED0BCD0B5D0BDD182D0B0D0BBD18CD0BDD0BE20D183D0B1D0B8D0B2D0B0D18F20D182D0BED0B3D0BE2C20D0B5D181D0BBD0B820D0B4D183D185D18320D183D0B4D0B0D0B5D182D181D18F20D0BFD180D0B8D0B1D0BBD0B8D0B7D0B8D182D18CD181D18F20D0BA20D0B6D0B5D180D182D0B2D0B520D0BDD0B020D180D0B0D181D181D182D0BED18FD0BDD0B8D0B52024313337333930413120D0BC2E0D0A0D0AD095D181D0BBD0B820D0B4D183D18520D0BED181D182D0B0D0B5D182D181D18F20D0B6D0B8D0B2D18BD0BC20D0BFD0BE20D0B8D181D182D0B5D187D0B5D0BDD0B8D0B82024313337333935642E2C20D0BED0BD20D0BCD0BED0BCD0B5D0BDD182D0B0D0BBD18CD0BDD0BE20D0BFD0B5D180D0B5D0BDD0BED181D0B8D182D181D18F20D0BA20D186D0B5D0BBD0B820D0B820D183D0B1D0B8D0B2D0B0D0B5D18220D0B5D0B52E0030031C8A1B0000A11B02000000000000000000000000DFA209000200320013, 35435), -- JournalEncounterSection
(3776013982, 300798, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324866, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F5052494553545F534841444F575941505041524954494F4E2E424C503A32347C74207C634646464646464646D0A1D183D180D0BED0B2D0BED181D182D18C7C720D0A24407370656C6C646573633331353535340000, 35435), -- Spell
(3776013982, 324875, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F5741524C4F434B5F44454D4F4E534F554C2E424C503A32347C74207C634646464646464646D098D0B7D0B1D0B5D0B6D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353630380000, 35435), -- Spell
(3776013982, 256134, 'ruRU', 0x00D097D0BDD0B0D187D0B8D182D0B5D0BBD18CD0BDD0BE20D181D0BED0BAD180D0B0D189D0B0D0B5D18220D0BAD0BED0BBD0B8D187D0B5D181D182D0B2D0BE20D0BCD0B0D182D0B5D180D0B8D0B0D0BBD0BED0B22C20D182D180D0B5D0B1D183D0B5D0BCD18BD18520D0B4D0BBD18F20D0B8D0B7D0B3D0BED182D0BED0B2D0BBD0B5D0BDD0B8D18F20D0B4D0B2D0B8D0B3D0B0D182D0B5D0BBD18F20D18120D182D183D180D0B1D0BED0BDD0B0D0B4D0B4D183D0B2D0BED0BC2E0000, 35435), -- Spell
(3776013982, 324898, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F57415252494F525F424C4F4F444652454E5A592E424C503A32347C74207C634646464646464646D0A3D187D0B0D189D0B5D0BDD0BDD0BED0B520D181D0B5D180D0B4D186D0B5D0B1D0B8D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383439360000, 35435), -- Spell
(3776013982, 324889, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F44525549445F5354415246414C4C2E424C503A32347C74207C634646464646464646D091D0B5D181D0BAD0BED0BDD0B5D187D0BDD18BD0B520D0B7D0B2D0B5D0B7D0B4D18B7C720D0A24407370656C6C646573633331383237340000, 35435), -- Spell
(3776013982, 324907, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F5072696573745F566F6964536561722E626C703A32347C74207C634646464646464646D0A1D183D0BCD0B5D180D0B5D187D0BDD0BED0B520D180D0B0D0B7D180D183D188D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383437380000, 35435), -- Spell
(3776013982, 335150, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B82043617461636C79736D2C20D0BDD0B020247331252E007C634646303041413939D091D0BED0BDD183D181D0BDD0BED0B520D181D0BED0B1D18BD182D0B8D0B53A20D0BFD183D182D0B5D188D0B5D181D182D0B2D0B8D0B520D0B2D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B8202843617461636C79736D297C720D0A0D0AD09ED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B82043617461636C79736D2C20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 35435), -- Spell
(3776013982, 321428, 'ruRU', 0x00D09DD0B0D0BDD0BED181D0B8D18220D0B2D181D0B5D0BC20D0B8D0B3D180D0BED0BAD0B0D0BC2024733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D180D0B0D0B720D0B22024743120D181D0B5D0BA2E0024733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D180D0B0D0B720D0B22024743120D181D0B5D0BA2E00, 35435), -- Spell
(2035710060, 7071, 'ruRU', 0xD093D0BDD0B5D0B220D0BBD0BED0B000D092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B820D0B8D181D0BFD0BED0BBD18CD0B7D183D0B5D18220D18DD182D18320D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D18C2C20D0BDD0B0D185D0BED0B4D18FD181D18C20D0BFD0BED0B420D0BAD0BED0BDD182D180D0BED0BBD0B5D0BC20D094D183D185D0B020D093D0B0D180D0B027D0B4D0B6D0B0D0BBD0B02E0D0A0D0AD096D180D0B8D186D0B020D0BFD0BED180D0B0D0B6D0B0D0B5D18220D0B8D0B3D180D0BED0BAD0B020D0B3D0BDD0B5D0B2D0BED0BC20D0BBD0BED0B02C20D0BDD0B0D0BDD0BED181D18F20D0B5D0BCD1832024313337333437733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B82E0030031B8A1B0000A01B02000000000000000000000000BC62090000004000FF, 35435), -- JournalEncounterSection
(3776013982, 324858, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F524F4755455F53494E495354455243414C4C494E472E424C503A32347C74207C634646464646464646D098D181D0BAD183D181D0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353533310000, 35435), -- Spell
(3776013982, 306259, 'ruRU', 0x000000, 35435), -- Spell
(2901650891, 1582, 'ruRU', 0xD092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B800002E060000300372BA0000000000000309000000, 35435), -- JournalEncounterCreature
(3776013982, 335152, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8205761726C6F726473206F6620447261656E6F722C20D0BDD0B020247331252E007C634646303041413939D091D0BED0BDD183D181D0BDD0BED0B520D181D0BED0B1D18BD182D0B8D0B53A20D0BFD183D182D0B5D188D0B5D181D182D0B2D0B8D0B520D0B2D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B820285761726C6F726473206F6620447261656E6F72297C720D0A0D0AD09ED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8205761726C6F726473206F6620447261656E6F722C20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 35435), -- Spell
(3776013982, 324880, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F536861646F775F4C696665447261696E30325F707572706C652E626C703A32347C74207C634646464646464646D092D18BD182D18FD0B3D0B8D0B2D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353539320000, 35435), -- Spell
(3776013982, 256133, 'ruRU', 0x00D0A1D0BED0BAD180D0B0D189D0B0D0B5D18220D0BAD0BED0BBD0B8D187D0B5D181D182D0B2D0BE20D0BCD0B0D182D0B5D180D0B8D0B0D0BBD0BED0B22C20D182D180D0B5D0B1D183D0B5D0BCD18BD18520D0B4D0BBD18F20D0B8D0B7D0B3D0BED182D0BED0B2D0BBD0B5D0BDD0B8D18F20D0B4D0B2D0B8D0B3D0B0D182D0B5D0BBD18F20D18120D182D183D180D0B1D0BED0BDD0B0D0B4D0B4D183D0B2D0BED0BC2E0000, 35435), -- Spell
(3776013982, 324879, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F536861646F775F4C696665447261696E30325F707572706C652E626C703A32347C74207C634646464646464646D092D18BD182D18FD0B3D0B8D0B2D0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331353539310000, 35435), -- Spell
(3776013982, 335151, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8204D69737473206F662050616E64617269612C20D0BDD0B020247331252E007C634646303041413939D091D0BED0BDD183D181D0BDD0BED0B520D181D0BED0B1D18BD182D0B8D0B53A20D0BFD183D182D0B5D188D0B5D181D182D0B2D0B8D0B520D0B2D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B820284D69737473206F662050616E6461726961297C720D0A0D0AD09ED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8204D69737473206F662050616E64617269612C20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 35435), -- Spell
(3776013982, 300748, 'ruRU', 0x000000, 35435), -- Spell
(20077728, 396607, 'ruRU', 0x000001000000474302000001006FD6, 35435), -- QuestObjective
(3205218938, 42497, 'ruRU', 0x47524F55505F46494E4445525F44454C4953545F5741524E494E475F5449544C4500D092D18B20D181D182D0B0D0BBD0B820D0BBD0B8D0B4D0B5D180D0BED0BC7C54496E746572666163655C5C47726F75704672616D655C5C55492D47726F75702D4C656164657249636F6E3A303A303A303A2D317C74207C6E7C6E7C636666666664323030D09ED0BFD183D0B1D0BBD0B8D0BAD0BED0B2D0B0D182D18C20D0BED0B1D18AD18FD0B2D0BBD0B5D0BDD0B8D0B520D0BE20D0BDD0B0D0B1D0BED180D0B520D0B5D189D0B520D180D0B0D0B73F7C727C6E25737C6E0001, 35435), -- GlobalStrings
(3776013982, 324861, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F524F4755455F53494E495354455243414C4C494E472E424C503A32347C74207C634646464646464646D098D181D0BAD183D181D0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353532390000, 35435), -- Spell
(3776013982, 328136, 'ruRU', 0x00D092D18B20D0BFD0BED0BBD183D187D0B0D0B5D182D0B520D0BDD0B0202473312520D0B1D0BED0BBD18CD188D0B520D180D0B5D0BFD183D182D0B0D186D0B8D0B820D0BDD0B020D0A0D0B0D181D0BAD0BED0BBD0BED182D18BD18520D0BED181D182D180D0BED0B2D0B0D1852C20D090D180D0B3D183D181D0B52C20D09AD183D0BB2DD0A2D0B8D180D0B0D181D0B52C20D097D0B0D0BDD0B4D0B0D0BBD0B0D180D0B520D0B820D0B220D09DD0B0D0B7D0B6D0B0D182D0B0D180D0B52E00D092D18B20D0BFD0BED0BBD183D187D0B0D0B5D182D0B520D0BDD0B0202473312520D0B1D0BED0BBD18CD188D0B520D180D0B5D0BFD183D182D0B0D186D0B8D0B820D0BDD0B020D0A0D0B0D181D0BAD0BED0BBD0BED182D18BD18520D0BED181D182D180D0BED0B2D0B0D1852C20D090D180D0B3D183D181D0B52C20D09AD183D0BB2DD0A2D0B8D180D0B0D181D0B52C20D097D0B0D0BDD0B4D0B0D0BBD0B0D180D0B520D0B820D0B220D09DD0B0D0B7D0B6D0B0D182D0B0D180D0B52E00, 35435), -- Spell
(3776013982, 325947, 'ruRU', 0x0024407370656C6C646573633239363832300000, 35435), -- Spell
(3776013982, 294479, 'ruRU', 0x0000D09FD0BED0B8D181D0BA20D0B4D180D0B5D0B2D0BDD0B8D18520D0B0D180D182D0B5D184D0B0D0BAD182D0BED0B22E00, 35435), -- Spell
(3776013982, 155346, 'ruRU', 0x00D092D18B20D0BFD0B5D180D0B8D0BED0B4D0B8D187D0B5D181D0BAD0B820D0BFD180D0B5D0B2D180D0B0D189D0B0D0B5D182D0B5D181D18C20D0B220D0BCD0BED0B3D183D187D0B5D0B3D0BE20D0BED0B3D180D0B020D18120D185D180D0B5D0B1D182D0B020D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F2E20D0ADD182D0BED18220D0BED0B1D0BBD0B8D0BA20D0BFD0BED0B2D18BD188D0B0D0B5D18220D181D0BED0BFD180D0BED182D0B8D0B2D0BBD0B5D0BDD0B8D0B520D0BED182D180D0B8D186D0B0D182D0B5D0BBD18CD0BDD18BD0BC20D18DD184D184D0B5D0BAD182D0B0D0BC20D0BDD0B020243135353333377332252E00D092D18B20D0BFD0B5D180D0B8D0BED0B4D0B8D187D0B5D181D0BAD0B820D0BFD180D0B5D0B2D180D0B0D189D0B0D0B5D182D0B5D181D18C20D0B220D0BCD0BED0B3D183D187D0B5D0B3D0BE20D0BED0B3D180D0B020D18120D185D180D0B5D0B1D182D0B020D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F2E20D0ADD182D0BED18220D0BED0B1D0BBD0B8D0BA20D0BFD0BED0B2D18BD188D0B0D0B5D18220D181D0BED0BFD180D0BED182D0B8D0B2D0BBD0B5D0BDD0B8D0B520D0BED182D180D0B8D186D0B0D182D0B5D0BBD18CD0BDD18BD0BC20D18DD184D184D0B5D0BAD182D0B0D0BC20D0BDD0B020243135353333377332252E00, 35435), -- Spell
(3776013982, 321201, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324680, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F48756E7465725F526170746F72537472696B652E626C703A32347C74207C634646464646464646D0A1D0BCD0B5D180D182D0BED0BDD0BED181D0BDD18BD0B920D0B8D0BCD0BFD183D0BBD18CD1817C720D0A24407370656C6C646573633331383236380000, 35435), -- Spell
(3776013982, 324903, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C494E565F57616E645F31485F4E7A6F7468526169645F445F30312E626C703A32347C74207C634646464646464646D09DD0B5D0B2D18BD180D0B0D0B7D0B8D0BCD0B0D18F20D0B8D181D182D0B8D0BDD0B07C720D0A24407370656C6C646573633331383330330000, 35435), -- Spell
(3205218938, 42500, 'ruRU', 0x47524F55505F46494E4445525F4445534C4953545F5741524E494E475F454449545F4C495354494E4700D098D0B7D0BCD0B5D0BDD0B8D182D18C20D0BED0B1D18AD18FD0B2D0BBD0B5D0BDD0B8D0B50001, 35435), -- GlobalStrings
(3776013982, 313040, 'ruRU', 0x00D0A0D0B0D0B7D180D18BD0B2D0B0D0B5D18220D182D0BAD0B0D0BDD18C20D180D0B5D0B0D0BBD18CD0BDD0BED181D182D0B82C20D0B2D18BD182D18FD0B3D0B8D0B2D0B0D18F2024333133303430733220D0B5D0B42E20D0B7D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D18F20D0B820D0BDD0B0D0BDD0BED181D18F20D0B2D181D0B5D0BC20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BC2024333133303430733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B82E0D0A0D0AD0ADD182D0B0D18220D180D0B0D0B7D180D18BD0B220D181D0BED0B7D0B4D0B0D0B5D18220D18DD184D184D0B5D0BAD182202224407370656C6C6E616D65333137363237222C20D0BAD0BED182D0BED180D18BD0B920D181D183D189D0B5D181D182D0B2D183D0B5D18220D0B220D182D0B5D187D0B5D0BDD0B8D0B52024333137363334442E0000, 35435), -- Spell
(3205218938, 42645, 'ruRU', 0x424E45545F4552524F525F34303031310028434E204F6E6C7929205365636F6E6461727920506172656E74616C20436F6E74726F6C0002, 35435), -- GlobalStrings
(3776013982, 294003, 'ruRU', 0x0000D091D0B5D0B7D183D0BCD0B8D0B520D0BCD0B8D0BDD0BED0B2D0B0D0BBD0BE2E0D0AD097D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D0B520D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D182D181D18F2E00, 35435), -- Spell
(3776013982, 324899, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F4E41545552455F464F43555345444D494E442E424C503A32347C74207C634646464646464646D0A1D184D0BED0BAD183D181D0B8D180D0BED0B2D0B0D0BDD0BDD0BED0B520D181D0BED0B7D0BDD0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331383236390000, 35435), -- Spell
(3776013982, 324850, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F5072696573745F566F6964456E74726F70792E626C703A32347C74207C634646464646464646D0ADD185D0BE20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383238300000, 35435), -- Spell
(3776013982, 324860, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F524F4755455F53494E495354455243414C4C494E472E424C503A32347C74207C634646464646464646D098D181D0BAD183D181D0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353533300000, 35435), -- Spell
(3776013982, 324882, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F534841444F575F5348414445534F464441524B4E4553532E424C503A32347C74207C634646464646464646D0A0D0B8D182D183D0B0D0BB20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383238360000, 35435), -- Spell
(3776013982, 321748, 'ruRU', 0x004361757365207468652063757272656E742074617267657420746F20636C6F6E6520746865206361737465722E0000, 35435), -- Spell
(3776013982, 324891, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F44525549445F5354415246414C4C2E424C503A32347C74207C634646464646464646D091D0B5D181D0BAD0BED0BDD0B5D187D0BDD18BD0B520D0B7D0B2D0B5D0B7D0B4D18B7C720D0A24407370656C6C646573633331383438380000, 35435), -- Spell
(3776013982, 325946, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 331973, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 154253, 'ruRU', 0x00D093D0B5D180D0BED18FD0BC20D0BAD0BBD0B0D0BDD0B020D0A1D0B5D0B2D0B5D180D0BDD0BED0B3D0BE20D092D0BED0BBD0BAD0B020D0B2D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0B1D183D0B4D0B5D18220D0BFD180D0B8D185D0BED0B4D0B8D182D18C20D0BDD0B020D0BFD0BED0BCD0BED189D18C20D181D0B5D0B2D0B5D180D0BDD18BD0B920D0B2D0BED0BBD0BA2E00D093D0B5D180D0BED18FD0BC20D0BAD0BBD0B0D0BDD0B020D0A1D0B5D0B2D0B5D180D0BDD0BED0B3D0BE20D092D0BED0BBD0BAD0B020D0B2D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0B1D183D0B4D0B5D18220D0BFD180D0B8D185D0BED0B4D0B8D182D18C20D0BDD0B020D0BFD0BED0BCD0BED189D18C20D181D0B5D0B2D0B5D180D0BDD18BD0B920D0B2D0BED0BBD0BA2E00, 35435), -- Spell
(3776013982, 324904, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C494E565F57616E645F31485F4E7A6F7468526169645F445F30312E626C703A32347C74207C634646464646464646D09DD0B5D0B2D18BD180D0B0D0B7D0B8D0BCD0B0D18F20D0B8D181D182D0B8D0BDD0B07C720D0A24407370656C6C646573633331383438340000, 35435), -- Spell
(3776013982, 321200, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324864, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F415243414E455F415243414E45544143544943532E424C503A32347C74207C634646464646464646D0A3D0BDD0B8D0B2D0B5D180D181D0B0D0BBD18CD0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353535320000, 35435), -- Spell
(3776013982, 316661, 'ruRU', 0x0024407370656C6C646573633331363635310000, 35435), -- Spell
(3776013982, 275496, 'ruRU', 0x0022D09FD180D0B0D0B2D0BED181D183D0B4D0B8D0B52220D0BDD0B0D0BDD0BED181D0B8D18220D0B1D0BED0BBD18CD188D0B520D183D180D0BED0BDD0B02C20D0B5D181D0BBD0B820D0B2D0B0D18820D183D180D0BED0B2D0B5D0BDD18C20D0B7D0B4D0BED180D0BED0B2D18CD18F20D0B2D18BD188D0B52C20D187D0B5D0BC20D18320D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B02E20D09CD0B0D0BAD181D0B8D0BCD183D0BC20D0B4D0BED0BFD0BED0BBD0BDD0B8D182D0B5D0BBD18CD0BDD0BED0B3D0BE20D183D180D0BED0BDD0B020E280932024733120D0B5D0B42E0000, 35435), -- Spell
(3776013982, 324902, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F49726F6E4D616964656E735F436F72727570746564426C6F6F642E626C703A32347C74207C634646464646464646D09AD180D0BED0B2D0BED182D0BED187D0B0D189D0B0D18F20D180D0B0D0BDD0B07C720D0A24407370656C6C646573633331383237320000, 35435), -- Spell
(3776013982, 155334, 'ruRU', 0x00D092D18B20D0BDD0B0D185D0BED0B4D0B8D182D0B5D181D18C20D0B220D0B3D0B0D180D0BCD0BED0BDD0B8D0B820D181D0BE20D0BBD18CD0B4D0BED0BC20D0B220D0B4D0B0D0BDD0BDD0BED0B920D0BED0B1D0BBD0B0D181D182D0B82E20D092D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B820D0B220D0B2D0B0D188D0B5D0BC20D0BFD180D0B8D181D183D182D181D182D0B2D0B8D0B820D0B1D183D0B4D183D18220D0B7D0B0D181D182D18BD0B2D0B0D182D18C2E00D092D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0B2D0B0D188D0B820D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B820D0B7D0B0D181D182D18BD0B2D0B0D18ED18220D0B220D0B2D0B0D188D0B5D0BC20D0BFD180D0B8D181D183D182D181D182D0B2D0B8D0B82E00, 35435), -- Spell
(3776013982, 324870, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F5052494553545F534841444F575941505041524954494F4E2E424C503A32347C74207C634646464646464646D0A1D183D180D0BED0B2D0BED181D182D18C7C720D0A24407370656C6C646573633331353535380000, 35435), -- Spell
(3776013982, 311204, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 293072, 'ruRU', 0x00D0A1D0BED0B7D0B4D0B0D0B5D18220D0B2D0B8D185D180D18C20D182D0B5D0BDD0B5D0B92C20D0BAD0BED182D0BED180D18BD0B920D0B220D182D0B5D187D0B5D0BDD0B8D0B52024642E20D0B2D18BD182D18FD0B3D0B8D0B2D0B0D0B5D18220D18320D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0BED0B22C20D0BFD0BED0BFD0B0D0B2D188D0B8D18520D0B220D0BDD0B5D0B3D0BE2C20246F3220D0B5D0B42E20D0B7D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D18F2E00D09FD0BED182D0B5D180D18F2024733220D0B5D0B42E20D0B7D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D18F20D180D0B0D0B720D0B22024743220D181D0B5D0BA2E00, 35435), -- Spell
(3776013982, 302166, 'ruRU', 0x00D09ED185D0BED182D0BDD0B8D0BA2DD183D0B1D0B8D0B9D186D0B020D0BFD0B5D180D0B5D0BDD0BED181D0B8D18220D0BFD0BED0B4D0BAD180D0B5D0BFD0BBD0B5D0BDD0B8D0B520D0B8D0B720D09CD0B5D185D0B0D0B3D0BED0BDD0B02E0000, 35435), -- Spell
(3776013982, 264663, 'ruRU', 0xD0A1D0B2D0B8D180D0B5D0BFD0BED181D182D18C2028D0BFD0B0D181D181D0B8D0B2D0BDD0B0D18F20D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D18C2900D092D0B0D188D0B520D181D0B0D0BCD0BED0B8D181D186D0B5D0BBD0B5D0BDD0B8D0B520D0B820D181D0B0D0BCD0BED0B8D181D186D0B5D0BBD0B5D0BDD0B8D0B520D0B2D0B0D188D0B5D0B3D0BE20D0BFD0B8D182D0BED0BCD186D0B020D183D181D0B8D0BBD0B8D0B2D0B0D0B5D182D181D18F20D0BDD0B020247331252E00D0A1D0B0D0BCD0BED0B8D181D186D0B5D0BBD0B5D0BDD0B8D0B520D183D181D0B8D0BBD0B5D0BDD0BE20D0BDD0B020247732252E00, 35435), -- Spell
(3776013982, 324839, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F48756E7465725F526170746F72537472696B652E626C703A32347C74207C634646464646464646D0A1D0BCD0B5D180D182D0BED0BDD0BED181D0BDD18BD0B920D0B8D0BCD0BFD183D0BBD18CD1817C720D0A24407370656C6C646573633331383439370000, 35435), -- Spell
(3776013982, 327254, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 315958, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 335148, 'ruRU', 0x00D0A3D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D0B5D18220D0BED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8204275726E696E6720437275736164652C20D0BDD0B020247331252E007C634646303041413939D091D0BED0BDD183D181D0BDD0BED0B520D181D0BED0B1D18BD182D0B8D0B53A20D0BFD183D182D0B5D188D0B5D181D182D0B2D0B8D0B520D0B2D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B820284275726E696E672043727573616465297C720D0A0D0AD09ED0B1D18AD0B5D0BC20D180D0B5D0BFD183D182D0B0D186D0B8D0B82C20D0BFD0BED0BBD183D187D0B0D0B5D0BCD0BED0B920D0B7D0B020D0B1D0BED0B820D0B820D0B7D0B0D0B4D0B0D0BDD0B8D18F20D0B220D0B4D0BED0BFD0BED0BBD0BDD0B5D0BDD0B8D0B8204275726E696E6720437275736164652C20D183D0B2D0B5D0BBD0B8D187D0B5D0BD20D0BDD0B020247331252E00, 35435), -- Spell
(3776013982, 335642, 'ruRU', 0x00537472696B65732074686520656E656D7920666F72202473312520776561706F6E2064616D61676520617320536861646F772C20616E6420696E637265617365732064616D616765206465616C74206279202473322520666F722024642E0044616D61676520696E63726561736564206279202473322500, 35435), -- Spell
(3776013982, 155344, 'ruRU', 0x00D092D0B0D18120D0B1D0BBD0B0D0B3D0BED181D0BBD0BED0B2D0B8D0BBD0B820D0B2D0B5D182D180D0B020D185D180D0B5D0B1D182D0B020D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F2E20D0B2D18B20D0BCD0BED0B6D0B5D182D0B520D0BFD0BED0BBD183D187D0B8D182D18C20D18DD184D184D0B5D0BAD1822022D091D183D188D183D18ED189D0B8D0B920D0B2D0B5D182D0B5D180222C20D0BFD0BED0B2D18BD188D0B0D18ED189D0B8D0B920D181D0BAD0BED180D0BED181D182D18C20D0BDD0B0203130302520D0B820D0BFD0BED0B7D0B2D0BED0BBD18FD18ED189D0B8D0B920D0BFD0B0D180D0B8D182D18C20D0BDD0B0D0B420D0B7D0B5D0BCD0BBD0B5D0B92E00D092D0B5D180D0BED18FD182D0BDD0BED181D182D18C20D0BFD0BED0BBD183D187D0B5D0BDD0B8D18F20D18DD184D184D0B5D0BAD182D0B02022D091D183D188D183D18ED189D0B8D0B920D0B2D0B5D182D0B5D180222C20D0BFD0BED0B2D18BD188D0B0D18ED189D0B5D0B3D0BE20D181D0BAD0BED180D0BED181D182D18C20D0BDD0B0203130302520D0B820D0BFD0BED0B7D0B2D0BED0BBD18FD18ED189D0B5D0B3D0BE20D0BFD0B0D180D0B8D182D18C20D0BDD0B0D0B420D0B7D0B5D0BCD0BBD0B5D0B92E00, 35435), -- Spell
(3205218938, 41792, 'ruRU', 0x434F4D4D554E4954595F46494E4445525F504F5354494E475F4558504952455F534F4F4E00D094D0BE20D0B8D181D182D0B5D187D0B5D0BDD0B8D18F20D181D180D0BED0BAD0B020D0BFD183D0B1D0BBD0B8D0BAD0B0D186D0B8D0B83A0001, 35435), -- GlobalStrings
(3776013982, 324885, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F534841444F575F5348414445534F464441524B4E4553532E424C503A32347C74207C634646464646464646D0A0D0B8D182D183D0B0D0BB20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383438300D0A0000, 35435), -- Spell
(3776013982, 300692, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 274909, 'ruRU', 0x0022D0A3D0B4D0B0D18020D0B2D0BED181D185D0BED0B4D18FD189D0B5D0B3D0BE20D181D0BED0BBD0BDD186D0B02220D0B2D0BED181D0BFD0BED0BBD0BDD18FD0B5D18220D181D0BED18ED0B7D0BDD0B8D0BAD0B0D0BC2C20D0BDD0B0D185D0BED0B4D18FD189D0B8D0BCD181D18F20D0BFD0BED0B420D0B4D0B5D0B9D181D182D0B2D0B8D0B5D0BC20D0B2D0B0D188D0B5D0B3D0BE2022D097D0B0D0B6D0B8D0B2D0BBD18FD18ED189D0B5D0B3D0BE20D182D183D0BCD0B0D0BDD0B0222C2022D09ED0BAD183D182D18BD0B2D0B0D18ED189D0B5D0B3D0BE20D182D183D0BCD0B0D0BDD0B02220D0B8D0BBD0B82022D09AD183D0BFD0B5D0BBD0B820D181D183D189D0BDD0BED181D182D0B8222C2024323734393132733120D0B5D0B42E20D0B7D0B4D0BED180D0BED0B2D18CD18F20D0B820D0BFD180D0BED0B4D0BBD0B5D0B2D0B0D0B5D18220D0B2D180D0B5D0BCD18F20D0B4D0B5D0B9D181D182D0B2D0B8D18F20D18DD182D0B8D18520D18DD184D184D0B5D0BAD182D0BED0B220D0BDD0B02024733120D181D0B5D0BA2E2C20D0B2D0BFD0BBD0BED182D18C20D0B4D0BE202473322520D0BED18220D0BFD0B5D180D0B2D0BED0BDD0B0D187D0B0D0BBD18CD0BDD0BED0B3D0BE20D0B2D180D0B5D0BCD0B5D0BDD0B820D0B4D0B5D0B9D181D182D0B2D0B8D18F2E0000, 35435), -- Spell
(2035710060, 7050, 'ruRU', 0xD092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B8000030031800009D1B00000172BA000000000000000000000000000001000000FF, 35435), -- JournalEncounterSection
(3776013982, 120679, 'ruRU', 0x00D092D18B20D0BFD180D0B8D0B7D18BD0B2D0B0D0B5D182D0B520D0BCD0BED0B3D183D187D0B5D0B3D0BE20D0B4D0B8D0BAD0BED0B3D0BE20D0B7D0B2D0B5D180D18F2C20D0BAD0BED182D0BED180D18BD0B920D0B0D182D0B0D0BAD183D0B5D18220D186D0B5D0BBD18C20D0B820D180D18BD187D0B8D1822C20D0BFD0BED0B2D18BD188D0B0D18F20D0B2D0B0D188D18320D181D0BAD0BED180D0BED181D182D18C20D0BDD0B0202432383130333673312520D0BDD0B02024642E0000, 35435), -- Spell
(3776013982, 293777, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324854, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F50524F46455353494F4E5F46495348494E475F46494E44464953482E424C503A32347C74207C634646464646464646D09FD180D0B5D0BED0B4D0BED0BBD0B5D0BDD0B8D0B520D0B7D0B0D189D0B8D182D18B7C720D0A24407370656C6C646573633331353238320000, 35435), -- Spell
(3776013982, 324893, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F48554E5445525F4F4E45574954484E41545552452E424C503A32347C74207C634646464646464646D09FD180D0B8D0BBD0B8D0B220D0B6D0B8D0B7D0BDD0B5D0BDD0BDD0BED0B920D181D0B8D0BBD18B7C720D0A24407370656C6C646573633331383439350000, 35435), -- Spell
(3776013982, 324884, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F534841444F575F5348414445534F464441524B4E4553532E424C503A32347C74207C634646464646464646D0A0D0B8D182D183D0B0D0BB20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383437390000, 35435), -- Spell
(3776013982, 324853, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F4D4147455F4E455448455257494E4450524553454E43452E424C503A32347C74207C634646464646464646D0A1D0BAD0BED180D0BED181D182D18C7C720D0A24407370656C6C646573633331353534340000, 35435), -- Spell
(3776013982, 291435, 'ruRU', 0x00D0A1D0BED0B7D0B4D0B0D0B5D18220D0B2D0B8D185D180D18C20D182D0B5D0BDD0B5D0B92C20D0BAD0BED182D0BED180D18BD0B920D0B220D182D0B5D187D0B5D0BDD0B8D0B52024642E20D0B2D18BD182D18FD0B3D0B8D0B2D0B0D0B5D18220D18320D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0BED0B22C20D0BFD0BED0BFD0B0D0B2D188D0B8D18520D0B220D0BDD0B5D0B3D0BE2C20246F3220D0B5D0B42E20D0B7D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D18F2E00D09FD0BED182D0B5D180D18F2024733220D0B5D0B42E20D0B7D0B4D180D0B0D0B2D0BED0BCD18BD181D0BBD0B8D18F20D180D0B0D0B720D0B22024743220D181D0B5D0BA2E00, 35435), -- Spell
(3776013982, 155333, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 300932, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324862, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F415243414E455F415243414E45544143544943532E424C503A32347C74207C634646464646464646D0A3D0BDD0B8D0B2D0B5D180D181D0B0D0BBD18CD0BDD0BED181D182D18C7C720D0A24407370656C6C646573633331353534390000, 35435), -- Spell
(3205218938, 42496, 'ruRU', 0x47524F55505F46494E4445525F44454C4953545F5741524E494E475F53554254455854007C6E257320D0B4D0BE20D0B0D0B2D182D0BED0BCD0B0D182D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D0B4D0B0D0BBD0B5D0BDD0B8D18F20D0B8D0B720D0BED187D0B5D180D0B5D0B4D0B80001, 35435), -- GlobalStrings
(3776013982, 110556, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 154274, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324851, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F4D4147455F4E455448455257494E4450524553454E43452E424C503A32347C74207C634646464646464646D0A1D0BAD0BED180D0BED181D182D18C7C720D0A24407370656C6C646573633331353534360000, 35435), -- Spell
(3776013982, 155347, 'ruRU', 0x00D092D0B0D18120D0BFD0BED0B4D0B4D0B5D180D0B6D0B8D0B2D0B0D0B5D18220D0B4D183D18520D0B2D0BED0BBD0BAD0B02C20D183D0B2D0B5D0BBD0B8D187D0B8D0B2D0B0D18ED189D0B8D0B920D181D0BAD0BED180D0BED181D182D18C20D0B2D0B0D188D0B5D0B3D0BE20D0BFD0B5D180D0B5D0B4D0B2D0B8D0B6D0B5D0BDD0B8D18F20D0BDD0B020243135343235397331252E20D094D0B5D0B9D181D182D0B2D183D0B5D18220D182D0BED0BBD18CD0BAD0BE20D0B2D0BDD0B520D0B1D0BED18F20D0BDD0B020D185D180D0B5D0B1D182D0B520D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F2E00D0A1D0BAD0BED180D0BED181D182D18C20D0B1D0B5D0B3D0B020D0B2D0BDD0B520D0B1D0BED18F20D0BFD0BED0B2D18BD188D0B5D0BDD0B020D0BDD0B020243135343235397331252E00, 35435), -- Spell
(3776013982, 301683, 'ruRU', 0x00D09ED18220D0B2D0B0D188D0B5D0B3D0BE20D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B020D180D0B0D181D185D0BED0B4D0B8D182D181D18F20D0B2D0BED0BBD0BDD0B020D181D0BED182D180D18FD181D0B0D18ED189D0B5D0B3D0BE20D18FD0B4D0B02C20D0BDD0B0D0BDD0BED181D18FD189D0B0D18F2024733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BC20D0B220D180D0B0D0B4D0B8D183D181D0B5203520D0BC2E0000, 35435), -- Spell
(3776013982, 337816, 'ruRU', 0x0024407370656C6C646573633333373631320000, 35435), -- Spell
(3776013982, 324881, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F5741524C4F434B5F534F554C535741502E424C503A32347C74207C634646464646464646D092D181D0BFD18BD188D0BAD0B020D18FD181D0BDD0BED181D182D0B87C720D0A24407370656C6C646573633331383233390000, 35435), -- Spell
(3776013982, 324890, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F44525549445F5354415246414C4C2E424C503A32347C74207C634646464646464646D091D0B5D181D0BAD0BED0BDD0B5D187D0BDD18BD0B520D0B7D0B2D0B5D0B7D0B4D18B7C720D0A24407370656C6C646573633331383438370000, 35435), -- Spell
(3776013982, 324886, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F424F53535F594F47475341524F4E5F30312E424C503A32347C74207C634646464646464646D098D181D0BAD0B0D0B6D0B5D0BDD0BDD18BD0B920D0BED182D180D0BED181D182D0BED0BA7C720D0A24407370656C6C646573633331383438310000, 35435), -- Spell
(3745449290, 6134, 'ruRU', 0xD093D0BED180D0BED0B420D09CD0B5D185D0B0D0B3D0BED0BD0000F61700008E1F2444E4C4BB431233A4C300000000000000007E1A000084110000C5EC000003000000D9050000310800000000000000000000, 35435), -- AreaPOI
(3776013982, 324888, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F424F53535F594F47475341524F4E5F30312E424C503A32347C74207C634646464646464646D098D181D0BAD0B0D0B6D0B5D0BDD0BDD18BD0B920D0BED182D180D0BED181D182D0BED0BA7C720D0A24407370656C6C646573633331383438330000, 35435), -- Spell
(3776013982, 324894, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F48554E5445525F4F4E45574954484E41545552452E424C503A32347C74207C634646464646464646D09FD180D0B8D0BBD0B8D0B220D0B6D0B8D0B7D0BDD0B5D0BDD0BDD0BED0B920D181D0B8D0BBD18B7C720D0A24407370656C6C646573633331383439390000, 35435), -- Spell
(2035710060, 7070, 'ruRU', 0xD091D0BBD0B0D0B3D0BED181D0BBD0BED0B2D0B5D0BDD0BDD18BD0B920D0B4D183D18520D0BBD0BED0B000D092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B820D0BFD180D0B8D0B7D18BD0B2D0B0D0B5D18220D0BA20D181D0B5D0B1D0B520D0B1D0BBD0B0D0B3D0BED181D0BBD0BED0B2D0B5D0BDD0BDD18BD0B920D0B4D183D18520D0BBD0BED0B02E20D0ADD182D0BED18220D0B4D183D18520D0B4D0B2D0B8D0B6D0B5D182D181D18F20D0B220D181D182D0BED180D0BED0BDD18320D181D0BED18ED0B7D0BDD0B8D0BAD0B020D0B6D180D0B8D186D18B20D18120D0BDD0B0D0B8D0BCD0B5D0BDD18CD188D0B8D0BC20D183D180D0BED0B2D0BDD0B5D0BC20D0B7D0B4D0BED180D0BED0B2D18CD18F20D0B820D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D18220D0B5D0BCD183202431333733303373312520D0BED18220D0BCD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD0BED0B3D0BE20D0B7D0B0D0BFD0B0D181D0B020D0B7D0B4D0BED180D0BED0B2D18CD18F2028D0B5D181D0BBD0B820D0BDD0B520D0BFD0BED0B3D0B8D0B1D0B0D0B5D18220D0BFD0BE20D0BFD183D182D0B8292E0D0A0D0AD095D181D0BBD0B820D0B4D183D18520D0BED181D182D0B0D0B5D182D181D18F20D0B6D0B8D0B2D18BD0BC20D0BFD0BE20D0B8D181D182D0B5D187D0B5D0BDD0B8D0B82024313337323837642E2C20D0BED0BD20D0BCD0BED0BCD0B5D0BDD182D0B0D0BBD18CD0BDD0BE20D0BFD0B5D180D0B5D0BDD0BED181D0B8D182D181D18F20D0BA20D181D0B2D0BED0B5D0B920D186D0B5D0BBD0B820D0B820D0B2D0BED181D181D182D0B0D0BDD0B0D0B2D0BBD0B8D0B2D0B0D0B5D18220D0B5D0B9202431333733303373312520D0BED18220D0BCD0B0D0BAD181D0B8D0BCD0B0D0BBD18CD0BDD0BED0B3D0BE20D0B7D0B0D0BFD0B0D181D0B020D0B7D0B4D0BED180D0BED0B2D18CD18F2E0030031A8A1B00009F1B02000000000000000000000000C231080000002200FF, 35435), -- JournalEncounterSection
(3776013982, 155315, 'ruRU', 0x00D092D18B20D0BDD0B0D185D0BED0B4D0B8D182D0B5D181D18C20D0B220D0B3D0B0D180D0BCD0BED0BDD0B8D0B820D18120D0BED0B3D0BDD0B5D0BC20D0B220D0B4D0B0D0BDD0BDD0BED0B920D0BED0B1D0BBD0B0D181D182D0B82E20D092D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0BFD0BED0B420D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BCD0B820D0B8D0B7D0B2D0B5D180D0B3D0B0D0B5D182D181D18F20D0BBD0B0D0B2D0B02E00D09FD0BED0B420D0BFD180D0BED182D0B8D0B2D0BDD0B8D0BAD0B0D0BCD0B820D0B2D180D0B5D0BCD18F20D0BED18220D0B2D180D0B5D0BCD0B5D0BDD0B820D0B8D0B7D0B2D0B5D180D0B3D0B0D0B5D182D181D18F20D0BBD0B0D0B2D0B02E00, 35435), -- Spell
(3776013982, 301578, 'ruRU', 0x000000, 35435), -- Spell
(2035710060, 7073, 'ruRU', 0xD098D0B7D0BCD0B5D0BDD187D0B8D0B2D0B0D18F20D181D183D0B4D18CD0B1D0B000D092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B820D0B8D181D0BFD0BED0BBD18CD0B7D183D0B5D18220D18DD182D18320D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D18C2C20D0BDD0B0D185D0BED0B4D18FD181D18C20D0BFD0BED0B420D0BAD0BED0BDD182D180D0BED0BBD0B5D0BC20D094D183D185D0B020D093D0B0D180D0B027D0B4D0B6D0B0D0BBD0B02E0D0A0D0AD096D180D0B8D186D0B020D0B2D18BD180D18BD0B2D0B0D0B5D18220D0B4D183D188D0B820D0B8D0B720D0B4D0B2D183D18520D181D0BBD183D187D0B0D0B9D0BDD0BE20D0B2D18BD0B1D180D0B0D0BDD0BDD18BD18520D0B8D0B3D180D0BED0BAD0BED0B220D0B820D181D0B2D18FD0B7D18BD0B2D0B0D0B5D18220D0B8D18520D0B2D0BCD0B5D181D182D0B52E20D09AD0B0D0B6D0B4D0B0D18F20D0B4D183D188D0B020D0BFD180D0B5D181D0BBD0B5D0B4D183D0B5D18220D182D18320D0B4D183D188D1832C20D18120D0BAD0BED182D0BED180D0BED0B920D181D0B2D18FD0B7D0B0D0BDD0B02C20D0B820D0BDD0B0D0BDD0BED181D0B8D18220D0B2D181D0B5D0BC20D0B8D0B3D180D0BED0BAD0B0D0BC2024313337393732733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D180D0B0D0B720D0B22024313337393735743120D181D0B5D0BA2E20D0A3D180D0BED0BD20D0BED1822022D098D0B7D0BCD0B5D0BDD187D0B8D0B2D0BED0B920D181D183D0B4D18CD0B1D18B2220D182D0B5D0BC20D0BCD0B5D0BDD18CD188D0B52C20D187D0B5D0BC20D0B4D0B0D0BBD18CD188D0B520D0B4D0B2D0B520D0B4D183D188D0B820D0B4D180D183D0B320D0BED18220D0B4D180D183D0B3D0B02E0D0A0D0AD09AD0BED0B3D0B4D0B020D0BED0B4D0BDD0B020D182D0B0D0BAD0B0D18F20D0B4D183D188D0B020D183D0BCD0B8D180D0B0D0B5D1822C20D180D0B0D0B7D180D18BD0B2D0B0D18F20D183D181D182D0B0D0BDD0BED0B2D0BBD0B5D0BDD0BDD183D18E20D181D0B2D18FD0B7D18C2C20D0BED181D182D0B0D0B2D188D0B0D18FD181D18F20D0B4D183D188D0B020D0BDD0B0D187D0B8D0BDD0B0D0B5D18220D0BDD0B0D0BDD0BED181D0B8D182D18C2024313337393836733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D182D0B5D0BCD0BDD0BED0B920D0BCD0B0D0B3D0B8D0B820D180D0B0D0B720D0B22024313337393836743220D181D0B5D0BA2E0030031D8A1B00000000020000000000000000000000009B07070002001A000C, 35435), -- JournalEncounterSection
(3776013982, 155345, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 332950, 'ruRU', 0x0000D092D0B0D188D0B820D181D0BFD0BED181D0BED0B1D0BDD0BED181D182D0B820D0BCD0BED0B3D183D18220D0BDD0B0D0BDD0B5D181D182D0B820244039303537733120D0B5D0B42E20D183D180D0BED0BDD0B02E00, 35435), -- Spell
(3776013982, 324901, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F4E41545552455F464F43555345444D494E442E424C503A32347C74207C634646464646464646D0A1D184D0BED0BAD183D181D0B8D180D0BED0B2D0B0D0BDD0BDD0BED0B520D181D0BED0B7D0BDD0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331383439380000, 35435), -- Spell
(3776013982, 324892, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F48554E5445525F4F4E45574954484E41545552452E424C503A32347C74207C634646464646464646D09FD180D0B8D0BBD0B8D0B220D0B6D0B8D0B7D0BDD0B5D0BDD0BDD0BED0B920D181D0B8D0BBD18B7C720D0A24407370656C6C646573633331383237300000, 35435), -- Spell
(3776013982, 324852, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4142494C4954595F4D4147455F4E455448455257494E4450524553454E43452E424C503A32347C74207C634646464646464646D0A1D0BAD0BED180D0BED181D182D18C7C720D0A24407370656C6C646573633331353534350000, 35435), -- Spell
(3776013982, 299937, 'ruRU', 0x00D09ED185D0BED182D0BDD0B8D0BA2DD183D0B1D0B8D0B9D186D0B020D0BFD0B5D180D0B5D0BDD0BED181D0B8D18220D0BFD0BED0B4D0BAD180D0B5D0BFD0BBD0B5D0BDD0B8D0B520D0B8D0B720D09CD0B5D185D0B0D0B3D0BED0BDD0B02E0000, 35435), -- Spell
(3776013982, 296464, 'ruRU', 0x00D092D0BED0B7D0B4D183D188D0BDD18BD0B920D0BFD0BED0B4D0B0D0B2D0B8D182D0B5D0BBD18C20D09ED0A32D3820D0BFD0B5D180D0B5D0BDD0BED181D0B8D18220D0BFD0BED0B4D0BAD180D0B5D0BFD0BBD0B5D0BDD0B8D0B520D0B8D0B720D09CD0B5D185D0B0D0B3D0BED0BDD0B02E0000, 35435), -- Spell
(3205218938, 42646, 'ruRU', 0x424E45545F4552524F525F34303031320028434E204F6E6C7929205365636F6E6461727920506172656E74616C20436F6E74726F6C202832290002, 35435), -- GlobalStrings
(3776013982, 324900, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5350454C4C5F4E41545552455F464F43555345444D494E442E424C503A32347C74207C634646464646464646D0A1D184D0BED0BAD183D181D0B8D180D0BED0B2D0B0D0BDD0BDD0BED0B520D181D0BED0B7D0BDD0B0D0BDD0B8D0B57C720D0A24407370656C6C646573633331383439340000, 35435), -- Spell
(3776013982, 292907, 'ruRU', 0x00D092D18BD0BFD183D181D0BAD0B0D0B5D18220D0B220D186D0B5D0BBD18C20D0BBD0B5D0B4D18FD0BDD0BED0B920D0BED181D0BAD0BED0BBD0BED0BA2C20D0BDD0B0D0BDD0BED181D18FD189D0B8D0B9202473312520D183D180D0BED0BDD0B020D0BED18220D0B0D182D0B0D0BAD0B820D0B220D0B2D0B8D0B4D0B520D184D0B8D0B7D0B8D187D0B5D181D0BAD0BED0B3D0BE20D183D180D0BED0BDD0B02E0000, 35435), -- Spell
(3776013982, 324887, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C414348494556454D454E545F424F53535F594F47475341524F4E5F30312E424C503A32347C74207C634646464646464646D098D181D0BAD0B0D0B6D0B5D0BDD0BDD18BD0B920D0BED182D180D0BED181D182D0BED0BA7C720D0A24407370656C6C646573633331383438320000, 35435), -- Spell
(3205218938, 41794, 'ruRU', 0x434F4D4D554E4954595F46494E4445525F504F5354494E475F4558504952454400D0A1D180D0BED0BA20D0BFD183D0B1D0BBD0B8D0BAD0B0D186D0B8D0B820D0B8D181D182D0B5D0BA210001, 35435), -- GlobalStrings
(3776013982, 319451, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 154275, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 155313, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 154259, 'ruRU', 0x00D092D0B0D18120D0BFD0BED0B4D0B4D0B5D180D0B6D0B8D0B2D0B0D0B5D18220D0B4D183D18520D0B2D0BED0BBD0BAD0B02C20D0BFD0BED0B2D18BD188D0B0D18ED189D0B8D0B920D181D0BAD0BED180D0BED181D182D18C20D0BFD0B5D180D0B5D0B4D0B2D0B8D0B6D0B5D0BDD0B8D18F20D0BDD0B020247331252E20D094D0B5D0B9D181D182D0B2D183D0B5D18220D182D0BED0BBD18CD0BAD0BE20D0BDD0B020D185D180D0B5D0B1D182D0B520D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F2E00D0A1D0BAD0BED180D0BED181D182D18C20D0B1D0B5D0B3D0B020D0BDD0B020D185D180D0B5D0B1D182D0B520D09BD0B5D0B4D18FD0BDD0BED0B3D0BE20D09ED0B3D0BDD18F20D0BFD0BED0B2D18BD188D0B5D0BDD0B020D0BDD0B020247331252E00, 35435), -- Spell
(3205218938, 41791, 'ruRU', 0x4755494C445F46494E4445525F504F5354494E475F474F494E475F544F5F45585049524500D094D0BE20D0B8D181D182D0B5D187D0B5D0BDD0B8D18F20D181D180D0BED0BAD0B020D0BFD183D0B1D0BBD0B8D0BAD0B0D186D0B8D0B83A0001, 35435), -- GlobalStrings
(3776013982, 304086, 'ruRU', 0xD090D0B7D0B5D180D0B8D182D0BED0B2D0B0D18F20D181D183D189D0BDD0BED181D182D18C00D09FD0BED0BAD0B020D0B2D18B20D0BED0B3D0BBD183D188D0B5D0BDD18B2C20D0B7D0B0D189D0B8D182D0BDD18BD0B920D18DD184D184D0B5D0BAD18220D183D0BDD0B8D0B2D0B5D180D181D0B0D0BBD18CD0BDD0BED181D182D0B820D0BFD0BED0B2D18BD188D0B0D0B5D182D181D18F20D0BDD0B020243330343737357331252E0000, 35435), -- Spell
(3776013982, 324845, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C4162696C6974795F5072696573745F566F6964456E74726F70792E626C703A32347C74207C634646464646464646D0ADD185D0BE20D091D0B5D0B7D0B4D0BDD18B7C720D0A24407370656C6C646573633331383438360000, 35435), -- Spell
(3776013982, 155343, 'ruRU', 0x000000, 35435), -- Spell
(3776013982, 324906, 'ruRU', 0x00D09DD0B0D0BFD0BED0BBD0BDD18FD0B5D18220D0BFD180D0B5D0B4D0BCD0B5D18220D0BFD0B0D0B3D183D0B1D0BDD0BED0B920D0BFD0BED180D187D0B5D0B920D09D27D097D0BED182D0B02E0D0A0D0A0D0A7C54696E746572666163655C69636F6E735C5370656C6C5F5072696573745F566F6964536561722E626C703A32347C74207C634646464646464646D0A1D183D0BCD0B5D180D0B5D187D0BDD0BED0B520D180D0B0D0B7D180D183D188D0B5D0BDD0B8D0B57C720D0A24407370656C6C646573633331383437370000, 35435), -- Spell
(2035710060, 7069, 'ruRU', 0xD093D0BDD0B5D0B220D0BBD0BED0B000D092D0B5D180D185D0BED0B2D0BDD0B0D18F20D0B6D180D0B8D186D0B020D09CD0B0D18027D0BBD0B820D0BFD0BED180D0B0D0B6D0B0D0B5D18220D0B8D0B3D180D0BED0BAD0B020D0B3D0BDD0B5D0B2D0BED0BC20D0BBD0BED0B02C20D0BDD0B0D0BDD0BED181D18F2024313337333434733120D0B5D0B42E20D183D180D0BED0BDD0B020D0BED18220D181D0B2D0B5D182D0BBD0BED0B920D0BCD0B0D0B3D0B8D0B82E003003198A1B00009E1B020000000000000000000000002413020000004000FF, 35435), -- JournalEncounterSection
(2948698321, 249, 'ruRU', 0xD6968DCA7ACF9DD1, 35435), -- TactKeyLookup
(2948698321, 259, 'ruRU', 0xB50278B84158ABDF, 35435), -- TactKeyLookup
(603412935, 28663, 'ruRU', 0x3130E9878CE5B1B1E8B7AFE4B88DE68DA2E882A90004, 35435), -- ChatProfanity
(603412935, 28664, 'ruRU', 0xE6899BE9BAA6E9838E0004, 35435), -- ChatProfanity
(603412935, 28644, 'ruRU', 0xE689A9E998B4E599A80004, 35435), -- ChatProfanity
(603412935, 28652, 'ruRU', 0xE5A3B9E59C8BE585A9E8A3BD0004, 35435), -- ChatProfanity
(603412935, 28656, 'ruRU', 0xE99988E696B9E5AE89E7949F0004, 35435), -- ChatProfanity
(603412935, 28653, 'ruRU', 0xE994A4E995B0E5B8AE0004, 35435), -- ChatProfanity
(603412935, 28650, 'ruRU', 0x4C69626572617465484B0004, 35435), -- ChatProfanity
(603412935, 28645, 'ruRU', 0xE5BEB7E5AFB8E88C8E0004, 35435), -- ChatProfanity
(603412935, 28648, 'ruRU', 0xE99B8FE5A5B30004, 35435), -- ChatProfanity
(603412935, 28658, 'ruRU', 0xE794B2E7B49AE688A6E78AAF0004, 35435), -- ChatProfanity
(603412935, 28655, 'ruRU', 0xE69C80E9AB98E4BABAE6B0910004, 35435), -- ChatProfanity
(603412935, 28661, 'ruRU', 0xE684BFE88DA3E58589E5BD92E9A699E6B8AF0004, 35435), -- ChatProfanity
(603412935, 28649, 'ruRU', 0xE6B9BFE7A9B40004, 35435), -- ChatProfanity
(603412935, 28657, 'ruRU', 0xE4BD95E4BF8AE4BB810004, 35435), -- ChatProfanity
(603412935, 28647, 'ruRU', 0xE99CB2E998B4E9B8A10004, 35435), -- ChatProfanity
(603412935, 28662, 'ruRU', 0xE58D81E9878CE4B88DE68DA2E882A90004, 35435), -- ChatProfanity
(603412935, 28646, 'ruRU', 0xE88C8EE9BE9F0004, 35435), -- ChatProfanity
(603412935, 28651, 'ruRU', 0x66726565484B0004, 35435), -- ChatProfanity
(603412935, 28660, 'ruRU', 0xE88194E982A6E5AEA3E8A8800004, 35435), -- ChatProfanity
(603412935, 28654, 'ruRU', 0xE4BABAE6B091E6A380E5AF9FE999A20004, 35435), -- ChatProfanity
(603412935, 28659, 'ruRU', 0xE696B0E4B8ADE59BBDE88194E982A60004, 35435), -- ChatProfanity
(4033975491, 403803, 'ruRU', 0x0000704100000000000000410000000000000000000000005B290600308A1300000000000000000000000000000000000000000000000000000000204100000000FFFFFFFFFFFF00000000000000000000000AD50100, 35435), -- SpellVisualKitModelAttach
(4146370265, 91772, 'ruRU', 0x0000A0400000000000002041000000000000000000000000000000000000000022130000000000000000000000000000000000000000000000000000000000000000, 35435), -- SpellVisual
(517656225, 6688, 'ruRU', 0x0000803F00000000E17AD43F000000000000000100001A00000000000303000000000000000000000000A4707D3F0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000FFFF4742000000000000000000000000000000000000C8430000964300000040FFFFFFFF02038030E13E022B873D0AD7233C636D2400000020400000003F69000000000000000000803F0000803F6E186F180000000000000000000000000000000000000000403F3333B33E6666E63E0000000000000000000000000000000000000000000000000000000000000000000000008D5E1E008C5E1E008C5E1E00, 35435), -- SpellChainEffects
(4033975491, 404117, 'ruRU', 0x00000000000000000000C03F000000000000000000000000952A0600D9891300000000000000000000000000000000000000000000000000000000804000000000FFFFFFFFFFFF000000000000000000000009D50100, 35435), -- SpellVisualKitModelAttach
(1181150530, 307455, 'ruRU', 0x020000005B2906000AD50100, 35435), -- SpellVisualKitEffect
(25144992, 2203, 'ruRU', 0x201A0000000000000000000001000000CB0100000000000013000000FFFFFFFF0000000000000000, 35435); -- BeamEffect
